[NoCoverage] ArrowFunction
src/App.tsx:9:26
 import GlobalLoader from "./components/GlobalLoader";
 
 // Lazy load rotas
-const Login = React.lazy(() => import("./pages/login"));
+const Login = React.lazy(() => undefined);
 const Register = React.lazy(() => import("./pages/register"));
 const Recovery = React.lazy(() => import("./pages/Recovery"));

[NoCoverage] ArrowFunction
src/App.tsx:10:29
 
 // Lazy load rotas
 const Login = React.lazy(() => import("./pages/login"));
-const Register = React.lazy(() => import("./pages/register"));
+const Register = React.lazy(() => undefined);
 const Recovery = React.lazy(() => import("./pages/Recovery"));
 const Dashboard = React.lazy(() => import("./pages/dashboard"));

[NoCoverage] ArrowFunction
src/App.tsx:11:29
 // Lazy load rotas
 const Login = React.lazy(() => import("./pages/login"));
 const Register = React.lazy(() => import("./pages/register"));
-const Recovery = React.lazy(() => import("./pages/Recovery"));
+const Recovery = React.lazy(() => undefined);
 const Dashboard = React.lazy(() => import("./pages/dashboard"));
 const Documentos = React.lazy(() => import("./pages/documentos"));

[NoCoverage] ArrowFunction
src/App.tsx:12:30
 const Login = React.lazy(() => import("./pages/login"));
 const Register = React.lazy(() => import("./pages/register"));
 const Recovery = React.lazy(() => import("./pages/Recovery"));
-const Dashboard = React.lazy(() => import("./pages/dashboard"));
+const Dashboard = React.lazy(() => undefined);
 const Documentos = React.lazy(() => import("./pages/documentos"));
 const Trail = React.lazy(() => import("./pages/trail"));

[NoCoverage] ArrowFunction
src/App.tsx:13:31
 const Register = React.lazy(() => import("./pages/register"));
 const Recovery = React.lazy(() => import("./pages/Recovery"));
 const Dashboard = React.lazy(() => import("./pages/dashboard"));
-const Documentos = React.lazy(() => import("./pages/documentos"));
+const Documentos = React.lazy(() => undefined);
 const Trail = React.lazy(() => import("./pages/trail"));
 const Upload = React.lazy(() => import("./pages/upload"));

[NoCoverage] ArrowFunction
src/App.tsx:14:26
 const Recovery = React.lazy(() => import("./pages/Recovery"));
 const Dashboard = React.lazy(() => import("./pages/dashboard"));
 const Documentos = React.lazy(() => import("./pages/documentos"));
-const Trail = React.lazy(() => import("./pages/trail"));
+const Trail = React.lazy(() => undefined);
 const Upload = React.lazy(() => import("./pages/upload"));
 const Settings = React.lazy(() => import("./pages/settings"));

[NoCoverage] ArrowFunction
src/App.tsx:15:27
 const Dashboard = React.lazy(() => import("./pages/dashboard"));
 const Documentos = React.lazy(() => import("./pages/documentos"));
 const Trail = React.lazy(() => import("./pages/trail"));
-const Upload = React.lazy(() => import("./pages/upload"));
+const Upload = React.lazy(() => undefined);
 const Settings = React.lazy(() => import("./pages/settings"));
 const About = React.lazy(() => import("./pages/About"));

[NoCoverage] ArrowFunction
src/App.tsx:16:29
 const Documentos = React.lazy(() => import("./pages/documentos"));
 const Trail = React.lazy(() => import("./pages/trail"));
 const Upload = React.lazy(() => import("./pages/upload"));
-const Settings = React.lazy(() => import("./pages/settings"));
+const Settings = React.lazy(() => undefined);
 const About = React.lazy(() => import("./pages/About"));
 

[NoCoverage] ArrowFunction
src/App.tsx:17:26
 const Trail = React.lazy(() => import("./pages/trail"));
 const Upload = React.lazy(() => import("./pages/upload"));
 const Settings = React.lazy(() => import("./pages/settings"));
-const About = React.lazy(() => import("./pages/About"));
+const About = React.lazy(() => undefined);
 
 const queryClient = new QueryClient();

[NoCoverage] StringLiteral
src/App.tsx:22:66
 const queryClient = new QueryClient();
 
 const NotFound = () => (
-  <div style={{ padding: '2rem', textAlign: 'center', marginTop: '10vh' }}>
+  <div style={{ padding: '2rem', textAlign: 'center', marginTop: "" }}>
     <h2>404 - Página não encontrada</h2>
     <p>A rota que você tentou acessar não existe.</p>

[NoCoverage] StringLiteral
src/App.tsx:36:52
     <BrowserRouter>
       <div style={{ display: 'flex', flexDirection: 'column', minHeight: '100svh' }}>
         <GlobalLoader />
-        <Suspense fallback={<div style={{ padding: '2rem', textAlign: 'center' }}>Carregando...</div>}>
+        <Suspense fallback={<div style={{ padding: "", textAlign: 'center' }}>Carregando...</div>}>
           <Routes>
             <Route path="/" element={<Login/>}/>

[NoCoverage] StringLiteral
src/App.tsx:36:71
     <BrowserRouter>
       <div style={{ display: 'flex', flexDirection: 'column', minHeight: '100svh' }}>
         <GlobalLoader />
-        <Suspense fallback={<div style={{ padding: '2rem', textAlign: 'center' }}>Carregando...</div>}>
+        <Suspense fallback={<div style={{ padding: '2rem', textAlign: "" }}>Carregando...</div>}>
           <Routes>
             <Route path="/" element={<Login/>}/>
