[NoCoverage] BooleanLiteral
src/components/GlobalLoader.tsx:5:48
 import './GlobalLoader.css';
 
 const GlobalLoader: React.FC = () => {
-    const [isLoading, setIsLoading] = useState(false);
+    const [isLoading, setIsLoading] = useState(true);
 
     useEffect(() => {

[NoCoverage] ConditionalExpression
src/components/GlobalLoader.tsx:20:9
         };
     }, []);
 
-    if (!isLoading) return null;
+    if (true) return null;
 
     return (
