[NoCoverage] BlockStatement
src/components/layout/DashboardLayout.tsx:13:105
     breadcrumbs: string[];
 }
 
-const DashboardLayout: React.FC<DashboardLayoutProps> = ({ children, title, subtitle, breadcrumbs }) => {
-    return (
-        <div className="dashboard-layout">
-            <Sidebar />
-            <div className="main-content-wrapper">
-                <Topbar title={title} subtitle={subtitle} breadcrumbs={breadcrumbs} />
-                <main className="main-content">
-                    {children}
-                </main>
-            </div>
-        </div>
-    );
-};
+const DashboardLayout: React.FC<DashboardLayoutProps> = ({ children, title, subtitle, breadcrumbs }) => {};
 
 export default DashboardLayout;
