[NoCoverage] BlockStatement
src/components/layout/Sidebar.tsx:11:35
     const { user, handleLogout } = useAuth();
     const [clickCount, setClickCount] = useState(0);
 
-    const handleLogoClick = () => {
-        const newCount = clickCount + 1;
-        setClickCount(newCount);
-        if (newCount === 7) {
-            alert("🎉 Easter Egg Encontrado! Bem-vindo ao laboratório secreto da EdTech AILAB Makers!");
-            setClickCount(0);
-        }
-    };
+    const handleLogoClick = () => {};
 
     return (

[NoCoverage] ConditionalExpression
src/components/layout/Sidebar.tsx:14:13
     const handleLogoClick = () => {
         const newCount = clickCount + 1;
         setClickCount(newCount);
-        if (newCount === 7) {
+        if (true) {
             alert("🎉 Easter Egg Encontrado! Bem-vindo ao laboratório secreto da EdTech AILAB Makers!");
             setClickCount(0);

[NoCoverage] StringLiteral
src/components/layout/Sidebar.tsx:24:72
         <aside className="sidebar-container">
             <div className="sidebar-header">
                 <div className="logo-section" onClick={handleLogoClick} style={{ cursor: 'pointer' }}>
-                    <img src={logo} alt="EdTech Logo" style={{ height: '32px' }} />
+                    <img src={logo} alt="EdTech Logo" style={{ height: "" }} />
                     <span className="logo-text">EdTech</span>
                 </div>

[NoCoverage] ArrowFunction
src/components/layout/Sidebar.tsx:37:61
                 <div className="nav-section">
                     <span className="nav-section-title">GERAL</span>
                     <div className="nav-links">
-                        <NavLink to="/dashboard" className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}>
+                        <NavLink to="/dashboard" className={() => undefined}>
                             <i className="bi bi-grid-1x2"></i> Visão Geral
                             <i className="bi bi-chevron-right arrow-icon ms-auto"></i>

[NoCoverage] StringLiteral
src/components/layout/Sidebar.tsx:37:107
                 <div className="nav-section">
                     <span className="nav-section-title">GERAL</span>
                     <div className="nav-links">
-                        <NavLink to="/dashboard" className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}>
+                        <NavLink to="/dashboard" className={({ isActive }) => `nav-link-item ${isActive ? "" : ''}`}>
                             <i className="bi bi-grid-1x2"></i> Visão Geral
                             <i className="bi bi-chevron-right arrow-icon ms-auto"></i>

[NoCoverage] ArrowFunction
src/components/layout/Sidebar.tsx:41:62
                             <i className="bi bi-grid-1x2"></i> Visão Geral
                             <i className="bi bi-chevron-right arrow-icon ms-auto"></i>
                         </NavLink>
-                        <NavLink to="/documentos" className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}>
+                        <NavLink to="/documentos" className={() => undefined}>
                             <i className="bi bi-folder2-open"></i> Área de Pesquisa
                             <i className="bi bi-chevron-right arrow-icon ms-auto"></i>

[NoCoverage] StringLiteral
src/components/layout/Sidebar.tsx:41:80
                             <i className="bi bi-grid-1x2"></i> Visão Geral
                             <i className="bi bi-chevron-right arrow-icon ms-auto"></i>
                         </NavLink>
-                        <NavLink to="/documentos" className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}>
+                        <NavLink to="/documentos" className={({ isActive }) => ``}>
                             <i className="bi bi-folder2-open"></i> Área de Pesquisa
                             <i className="bi bi-chevron-right arrow-icon ms-auto"></i>

[NoCoverage] ArrowFunction
src/components/layout/Sidebar.tsx:51:57
                 <div className="nav-section">
                     <span className="nav-section-title">INTELIGÊNCIA</span>
                     <div className="nav-links">
-                        <NavLink to="/trail" className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}>
+                        <NavLink to="/trail" className={() => undefined}>
                             <i className="bi bi-diagram-3"></i> Trilha de Pesquisa
                             <i className="bi bi-chevron-right arrow-icon ms-auto"></i>

[NoCoverage] ArrowFunction
src/components/layout/Sidebar.tsx:61:60
                 <div className="nav-section">
                     <span className="nav-section-title">GOVERNANÇA</span>
                     <div className="nav-links">
-                        <NavLink to="/settings" className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}>
+                        <NavLink to="/settings" className={() => undefined}>
                             <i className="bi bi-gear"></i> Configurações
                         </NavLink>

[NoCoverage] StringLiteral
src/components/layout/Sidebar.tsx:61:117
                 <div className="nav-section">
                     <span className="nav-section-title">GOVERNANÇA</span>
                     <div className="nav-links">
-                        <NavLink to="/settings" className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}>
+                        <NavLink to="/settings" className={({ isActive }) => `nav-link-item ${isActive ? 'active' : "Stryker was here!"}`}>
                             <i className="bi bi-gear"></i> Configurações
                         </NavLink>

[NoCoverage] MethodExpression
src/components/layout/Sidebar.tsx:71:26
             <div className="sidebar-footer">
                 <div className="user-profile">
                     <div className="avatar">
-                        {user?.name?.substring(0, 2).toUpperCase() || 'RS'}
+                        {user?.name?.substring(0, 2).toLowerCase() || 'RS'}
                     </div>
                     <div className="user-info">

[NoCoverage] OptionalChaining
src/components/layout/Sidebar.tsx:71:26
             <div className="sidebar-footer">
                 <div className="user-profile">
                     <div className="avatar">
-                        {user?.name?.substring(0, 2).toUpperCase() || 'RS'}
+                        {user.name?.substring(0, 2).toUpperCase() || 'RS'}
                     </div>
                     <div className="user-info">

[NoCoverage] OptionalChaining
src/components/layout/Sidebar.tsx:74:54
                         {user?.name?.substring(0, 2).toUpperCase() || 'RS'}
                     </div>
                     <div className="user-info">
-                        <span className="user-name">{user?.name || 'Dra. Renata Silva'}</span>
+                        <span className="user-name">{user.name || 'Dra. Renata Silva'}</span>
                         <span className="user-email">{user?.email || 'renata.silva@usp.br'}</span>
                     </div>

[NoCoverage] ConditionalExpression
src/components/layout/Sidebar.tsx:75:55
                     </div>
                     <div className="user-info">
                         <span className="user-name">{user?.name || 'Dra. Renata Silva'}</span>
-                        <span className="user-email">{user?.email || 'renata.silva@usp.br'}</span>
+                        <span className="user-email">{false}</span>
                     </div>
                     <button className="logout-btn" onClick={handleLogout} title="Sair">
