[NoCoverage] BooleanLiteral
src/components/layout/Topbar.tsx:15:64
 const Topbar: React.FC<TopbarProps> = ({ title, subtitle, breadcrumbs }) => {
     const { user } = useAuth();
     const navigate = useNavigate();
-    const [showNotifications, setShowNotifications] = useState(false);
+    const [showNotifications, setShowNotifications] = useState(true);
 
     return (

[NoCoverage] LogicalOperator
src/components/layout/Topbar.tsx:20:18
     return (
         <header className="topbar-container">
             <div className="topbar-left">
-                {breadcrumbs && (
-                    <div className="breadcrumbs">
-                        {breadcrumbs.map((crumb, index) => (
-                            <span key={index}>
-                                {index > 0 && <span className="breadcrumb-separator">
-                                    <i className="bi bi-chevron-right"></i>
-                                </span>}
-                                {index === 0 ? (
-                                    <span className="breadcrumb-item" onClick={() => navigate('/dashboard')} style={{ cursor: 'pointer', transition: 'color 0.2s' }}>
-                                        {crumb}
-                                    </span>
-                                ) : (
-                                    <span className="breadcrumb-item active">{crumb}</span>
-                                )}
-                            </span>
-                        ))}
-                    </div>
-                )}
+                {breadcrumbs || <div className="breadcrumbs">
+                        {breadcrumbs.map((crumb, index) => <span key={index}>
+                                {index > 0 && <span className="breadcrumb-separator">
+                                    <i className="bi bi-chevron-right"></i>
+                                </span>}
+                                {index === 0 ? <span className="breadcrumb-item" onClick={() => navigate('/dashboard')} style={{
+      cursor: 'pointer',
+      transition: 'color 0.2s'
+    }}>
+                                        {crumb}
+                                    </span> : <span className="breadcrumb-item active">{crumb}</span>}
+                            </span>)}
+                    </div>}
                 <h1 className="page-title">{title}</h1>
                 {subtitle && <p className="page-subtitle">{subtitle}</p>}

[NoCoverage] ConditionalExpression
src/components/layout/Topbar.tsx:20:18
     return (
         <header className="topbar-container">
             <div className="topbar-left">
-                {breadcrumbs && (
-                    <div className="breadcrumbs">
-                        {breadcrumbs.map((crumb, index) => (
-                            <span key={index}>
-                                {index > 0 && <span className="breadcrumb-separator">
-                                    <i className="bi bi-chevron-right"></i>
-                                </span>}
-                                {index === 0 ? (
-                                    <span className="breadcrumb-item" onClick={() => navigate('/dashboard')} style={{ cursor: 'pointer', transition: 'color 0.2s' }}>
-                                        {crumb}
-                                    </span>
-                                ) : (
-                                    <span className="breadcrumb-item active">{crumb}</span>
-                                )}
-                            </span>
-                        ))}
-                    </div>
-                )}
+                {true}
                 <h1 className="page-title">{title}</h1>
                 {subtitle && <p className="page-subtitle">{subtitle}</p>}

[NoCoverage] ArrowFunction
src/components/layout/Topbar.tsx:22:42
             <div className="topbar-left">
                 {breadcrumbs && (
                     <div className="breadcrumbs">
-                        {breadcrumbs.map((crumb, index) => (
-                            <span key={index}>
-                                {index > 0 && <span className="breadcrumb-separator">
-                                    <i className="bi bi-chevron-right"></i>
-                                </span>}
-                                {index === 0 ? (
-                                    <span className="breadcrumb-item" onClick={() => navigate('/dashboard')} style={{ cursor: 'pointer', transition: 'color 0.2s' }}>
-                                        {crumb}
-                                    </span>
-                                ) : (
-                                    <span className="breadcrumb-item active">{crumb}</span>
-                                )}
-                            </span>
-                        ))}
+                        {breadcrumbs.map(() => undefined)}
                     </div>
                 )}

[NoCoverage] ConditionalExpression
src/components/layout/Topbar.tsx:24:34
                     <div className="breadcrumbs">
                         {breadcrumbs.map((crumb, index) => (
                             <span key={index}>
-                                {index > 0 && <span className="breadcrumb-separator">
-                                    <i className="bi bi-chevron-right"></i>
-                                </span>}
+                                {false}
                                 {index === 0 ? (
                                     <span className="breadcrumb-item" onClick={() => navigate('/dashboard')} style={{ cursor: 'pointer', transition: 'color 0.2s' }}>

[NoCoverage] ConditionalExpression
src/components/layout/Topbar.tsx:24:34
                     <div className="breadcrumbs">
                         {breadcrumbs.map((crumb, index) => (
                             <span key={index}>
-                                {index > 0 && <span className="breadcrumb-separator">
-                                    <i className="bi bi-chevron-right"></i>
-                                </span>}
+                                {true}
                                 {index === 0 ? (
                                     <span className="breadcrumb-item" onClick={() => navigate('/dashboard')} style={{ cursor: 'pointer', transition: 'color 0.2s' }}>

[NoCoverage] ConditionalExpression
src/components/layout/Topbar.tsx:27:34
                                 {index > 0 && <span className="breadcrumb-separator">
                                     <i className="bi bi-chevron-right"></i>
                                 </span>}
-                                {index === 0 ? (
+                                {true ? (
                                     <span className="breadcrumb-item" onClick={() => navigate('/dashboard')} style={{ cursor: 'pointer', transition: 'color 0.2s' }}>
                                         {crumb}

[NoCoverage] ConditionalExpression
src/components/layout/Topbar.tsx:27:34
                                 {index > 0 && <span className="breadcrumb-separator">
                                     <i className="bi bi-chevron-right"></i>
                                 </span>}
-                                {index === 0 ? (
+                                {false ? (
                                     <span className="breadcrumb-item" onClick={() => navigate('/dashboard')} style={{ cursor: 'pointer', transition: 'color 0.2s' }}>
                                         {crumb}

[NoCoverage] ArrowFunction
src/components/layout/Topbar.tsx:28:80
                                     <i className="bi bi-chevron-right"></i>
                                 </span>}
                                 {index === 0 ? (
-                                    <span className="breadcrumb-item" onClick={() => navigate('/dashboard')} style={{ cursor: 'pointer', transition: 'color 0.2s' }}>
+                                    <span className="breadcrumb-item" onClick={() => undefined} style={{ cursor: 'pointer', transition: 'color 0.2s' }}>
                                         {crumb}
                                     </span>

[NoCoverage] StringLiteral
src/components/layout/Topbar.tsx:28:150
                                     <i className="bi bi-chevron-right"></i>
                                 </span>}
                                 {index === 0 ? (
-                                    <span className="breadcrumb-item" onClick={() => navigate('/dashboard')} style={{ cursor: 'pointer', transition: 'color 0.2s' }}>
+                                    <span className="breadcrumb-item" onClick={() => navigate('/dashboard')} style={{ cursor: 'pointer', transition: "" }}>
                                         {crumb}
                                     </span>

[NoCoverage] LogicalOperator
src/components/layout/Topbar.tsx:39:18
                     </div>
                 )}
                 <h1 className="page-title">{title}</h1>
-                {subtitle && <p className="page-subtitle">{subtitle}</p>}
+                {subtitle || <p className="page-subtitle">{subtitle}</p>}
             </div>
             <div className="topbar-right">

[NoCoverage] ConditionalExpression
src/components/layout/Topbar.tsx:39:18
                     </div>
                 )}
                 <h1 className="page-title">{title}</h1>
-                {subtitle && <p className="page-subtitle">{subtitle}</p>}
+                {false}
             </div>
             <div className="topbar-right">

[NoCoverage] ArrowFunction
src/components/layout/Topbar.tsx:42:57
                 {subtitle && <p className="page-subtitle">{subtitle}</p>}
             </div>
             <div className="topbar-right">
-                <button className="btn-upload" onClick={() => navigate('/upload')}>
+                <button className="btn-upload" onClick={() => undefined}>
                     <i className="bi bi-upload"></i> Enviar documento
                 </button>

[NoCoverage] StringLiteral
src/components/layout/Topbar.tsx:51:43
                     </div>
                     <div 
                         className="action-icon-wrapper notification-icon" 
-                        style={{position: 'relative', cursor: 'pointer'}}
+                        style={{position: "", cursor: 'pointer'}}
                         onClick={() => setShowNotifications(!showNotifications)}
                     >

[NoCoverage] ArrowFunction
src/components/layout/Topbar.tsx:52:34
                     <div 
                         className="action-icon-wrapper notification-icon" 
                         style={{position: 'relative', cursor: 'pointer'}}
-                        onClick={() => setShowNotifications(!showNotifications)}
+                        onClick={() => undefined}
                     >
                         <i className="bi bi-bell"></i>

[NoCoverage] BooleanLiteral
src/components/layout/Topbar.tsx:52:61
                     <div 
                         className="action-icon-wrapper notification-icon" 
                         style={{position: 'relative', cursor: 'pointer'}}
-                        onClick={() => setShowNotifications(!showNotifications)}
+                        onClick={() => setShowNotifications(showNotifications)}
                     >
                         <i className="bi bi-bell"></i>

[NoCoverage] ConditionalExpression
src/components/layout/Topbar.tsx:57:26
                         <i className="bi bi-bell"></i>
                         <span className="notification-dot"></span>
                         
-                        {showNotifications && (
-                            <div className="notifications-dropdown" onClick={(e) => e.stopPropagation()}>
-                                <div className="dropdown-header">
-                                    <h4>Notificações</h4>
-                                </div>
-                                <div className="dropdown-body">
-                                    <div className="notification-item">
-                                        <div className="notification-icon-circle bg-green-light"><i className="bi bi-check-circle"></i></div>
-                                        <div className="notification-text">
-                                            <p><b>Prof. Faria</b> aprovou seu documento.</p>
-                                            <span>há 3 h</span>
-                                        </div>
-                                    </div>
-                                    <div className="notification-item">
-                                        <div className="notification-icon-circle bg-orange-light"><i className="bi bi-chat-left-text"></i></div>
-                                        <div className="notification-text">
-                                            <p>Novo comentário em <b>Referencial_Teorico_v2.pdf</b>.</p>
-                                            <span>há 1 h</span>
-                                        </div>
-                                    </div>
-                                </div>
-                            </div>
-                        )}
+                        {true}
                     </div>
                 </div>

[NoCoverage] ConditionalExpression
src/components/layout/Topbar.tsx:57:26
                         <i className="bi bi-bell"></i>
                         <span className="notification-dot"></span>
                         
-                        {showNotifications && (
-                            <div className="notifications-dropdown" onClick={(e) => e.stopPropagation()}>
-                                <div className="dropdown-header">
-                                    <h4>Notificações</h4>
-                                </div>
-                                <div className="dropdown-body">
-                                    <div className="notification-item">
-                                        <div className="notification-icon-circle bg-green-light"><i className="bi bi-check-circle"></i></div>
-                                        <div className="notification-text">
-                                            <p><b>Prof. Faria</b> aprovou seu documento.</p>
-                                            <span>há 3 h</span>
-                                        </div>
-                                    </div>
-                                    <div className="notification-item">
-                                        <div className="notification-icon-circle bg-orange-light"><i className="bi bi-chat-left-text"></i></div>
-                                        <div className="notification-text">
-                                            <p>Novo comentário em <b>Referencial_Teorico_v2.pdf</b>.</p>
-                                            <span>há 1 h</span>
-                                        </div>
-                                    </div>
-                                </div>
-                            </div>
-                        )}
+                        {false}
                     </div>
                 </div>

[NoCoverage] ArrowFunction
src/components/layout/Topbar.tsx:58:78
                         <span className="notification-dot"></span>
                         
                         {showNotifications && (
-                            <div className="notifications-dropdown" onClick={(e) => e.stopPropagation()}>
+                            <div className="notifications-dropdown" onClick={() => undefined}>
                                 <div className="dropdown-header">
                                     <h4>Notificações</h4>
