[NoCoverage] BlockStatement
src/components/privateRoute.tsx:5:58
 import { useAuth } from "../context/authContext";
 import { Navigate } from "react-router-dom";
  
-function PrivateRoute ({children}: {children: ReactNode}){
-    const {isAuthenticated, isLoading} = useAuth()
-    if (isLoading == true){
-        return (<div className="spinner-border" role="status"></div>)
-    }
-    if (!isAuthenticated){
-        return <Navigate to="/login"/>
-    }
-    return children
-}
+function PrivateRoute ({children}: {children: ReactNode}){}
 export default PrivateRoute

[NoCoverage] ConditionalExpression
src/components/privateRoute.tsx:7:9
  
 function PrivateRoute ({children}: {children: ReactNode}){
     const {isAuthenticated, isLoading} = useAuth()
-    if (isLoading == true){
+    if (true){
         return (<div className="spinner-border" role="status"></div>)
     }

[NoCoverage] EqualityOperator
src/components/privateRoute.tsx:7:9
  
 function PrivateRoute ({children}: {children: ReactNode}){
     const {isAuthenticated, isLoading} = useAuth()
-    if (isLoading == true){
+    if (isLoading != true){
         return (<div className="spinner-border" role="status"></div>)
     }

[NoCoverage] ConditionalExpression
src/components/privateRoute.tsx:10:9
     if (isLoading == true){
         return (<div className="spinner-border" role="status"></div>)
     }
-    if (!isAuthenticated){
+    if (true){
         return <Navigate to="/login"/>
     }
