[Survived] BlockStatement
src/components/themeToggle.tsx:4:24
 import useTheme from "../hooks/useTheme"
 import styles from "./themeToggle.module.css"
 
-function ThemeToggle() {
-    const { tema, toggleTheme } = useTheme()
-    return (
-        <button 
-            onClick={toggleTheme} 
-            className={styles.toggleBtn}
-            aria-label="Alternar Tema"
-            title="Alternar Tema"
-        >
-            {tema === 'dark' ? <i className="bi bi-sun-fill" style={{ fontSize: '1.25rem' }}></i> : <i className="bi bi-moon-stars-fill" style={{ fontSize: '1.25rem' }}></i>}
-        </button>
-    )
-}
+function ThemeToggle() {}
 
 export default ThemeToggle

[Survived] ConditionalExpression
src/components/themeToggle.tsx:13:14
             aria-label="Alternar Tema"
             title="Alternar Tema"
         >
-            {tema === 'dark' ? <i className="bi bi-sun-fill" style={{ fontSize: '1.25rem' }}></i> : <i className="bi bi-moon-stars-fill" style={{ fontSize: '1.25rem' }}></i>}
+            {false ? <i className="bi bi-sun-fill" style={{ fontSize: '1.25rem' }}></i> : <i className="bi bi-moon-stars-fill" style={{ fontSize: '1.25rem' }}></i>}
         </button>
     )

[Survived] ConditionalExpression
src/components/themeToggle.tsx:13:14
             aria-label="Alternar Tema"
             title="Alternar Tema"
         >
-            {tema === 'dark' ? <i className="bi bi-sun-fill" style={{ fontSize: '1.25rem' }}></i> : <i className="bi bi-moon-stars-fill" style={{ fontSize: '1.25rem' }}></i>}
+            {true ? <i className="bi bi-sun-fill" style={{ fontSize: '1.25rem' }}></i> : <i className="bi bi-moon-stars-fill" style={{ fontSize: '1.25rem' }}></i>}
         </button>
     )
