[NoCoverage] BlockStatement
src/hooks/useDocuments.ts:4:90
 import { useQuery, useMutation, useQueryClient } from '@tanstack/react-query';
 import { getDocuments, uploadDocument, getDownloadUrl } from '../services/api';
 
-export const useDocuments = (projectId?: string, title?: string, page = 0, size = 20) => {
-    return useQuery({
-        queryKey: ['documents', projectId, title, page, size],
-        queryFn: async () => {
-            const res = await getDocuments(projectId, title, page, size);
-            if (!res.sucesso) throw new Error(res.mensagem);
-            return res.dados?.content || res.dados || [];
-        },
-    });
-};
+export const useDocuments = (projectId?: string, title?: string, page = 0, size = 20) => {};
 
 export const useUploadDocument = () => {

[NoCoverage] ObjectLiteral
src/hooks/useDocuments.ts:5:21
 import { getDocuments, uploadDocument, getDownloadUrl } from '../services/api';
 
 export const useDocuments = (projectId?: string, title?: string, page = 0, size = 20) => {
-    return useQuery({
-        queryKey: ['documents', projectId, title, page, size],
-        queryFn: async () => {
-            const res = await getDocuments(projectId, title, page, size);
-            if (!res.sucesso) throw new Error(res.mensagem);
-            return res.dados?.content || res.dados || [];
-        },
-    });
+    return useQuery({});
 };
 

[NoCoverage] ArrayDeclaration
src/hooks/useDocuments.ts:6:19
 
 export const useDocuments = (projectId?: string, title?: string, page = 0, size = 20) => {
     return useQuery({
-        queryKey: ['documents', projectId, title, page, size],
+        queryKey: [],
         queryFn: async () => {
             const res = await getDocuments(projectId, title, page, size);

[NoCoverage] BlockStatement
src/hooks/useDocuments.ts:7:30
 export const useDocuments = (projectId?: string, title?: string, page = 0, size = 20) => {
     return useQuery({
         queryKey: ['documents', projectId, title, page, size],
-        queryFn: async () => {
-            const res = await getDocuments(projectId, title, page, size);
-            if (!res.sucesso) throw new Error(res.mensagem);
-            return res.dados?.content || res.dados || [];
-        },
+        queryFn: async () => {},
     });
 };

[NoCoverage] ConditionalExpression
src/hooks/useDocuments.ts:9:17
         queryKey: ['documents', projectId, title, page, size],
         queryFn: async () => {
             const res = await getDocuments(projectId, title, page, size);
-            if (!res.sucesso) throw new Error(res.mensagem);
+            if (true) throw new Error(res.mensagem);
             return res.dados?.content || res.dados || [];
         },

[NoCoverage] BooleanLiteral
src/hooks/useDocuments.ts:9:17
         queryKey: ['documents', projectId, title, page, size],
         queryFn: async () => {
             const res = await getDocuments(projectId, title, page, size);
-            if (!res.sucesso) throw new Error(res.mensagem);
+            if (res.sucesso) throw new Error(res.mensagem);
             return res.dados?.content || res.dados || [];
         },

[NoCoverage] LogicalOperator
src/hooks/useDocuments.ts:10:20
         queryFn: async () => {
             const res = await getDocuments(projectId, title, page, size);
             if (!res.sucesso) throw new Error(res.mensagem);
-            return res.dados?.content || res.dados || [];
+            return res.dados?.content && res.dados || [];
         },
     });

[NoCoverage] BlockStatement
src/hooks/useDocuments.ts:15:40
     });
 };
 
-export const useUploadDocument = () => {
-    const queryClient = useQueryClient();
-
-    return useMutation({
-        mutationFn: async ({ file, title, projectId, onProgress }: { file: File, title: string, projectId: string, onProgress?: (p: any) => void }) => {
-            const res = await uploadDocument(file, title, projectId, onProgress);
-            if (!res.sucesso) throw new Error(res.mensagem);
-            return res.dados;
-        },
-        onSuccess: () => {
-            queryClient.invalidateQueries({ queryKey: ['documents'] });
-        }
-    });
-};
+export const useUploadDocument = () => {};
 
 export const useDownloadUrl = () => {

[NoCoverage] BlockStatement
src/hooks/useDocuments.ts:19:152
     const queryClient = useQueryClient();
 
     return useMutation({
-        mutationFn: async ({ file, title, projectId, onProgress }: { file: File, title: string, projectId: string, onProgress?: (p: any) => void }) => {
-            const res = await uploadDocument(file, title, projectId, onProgress);
-            if (!res.sucesso) throw new Error(res.mensagem);
-            return res.dados;
-        },
+        mutationFn: async ({ file, title, projectId, onProgress }: { file: File, title: string, projectId: string, onProgress?: (p: any) => void }) => {},
         onSuccess: () => {
             queryClient.invalidateQueries({ queryKey: ['documents'] });

[NoCoverage] BlockStatement
src/hooks/useDocuments.ts:24:26
             if (!res.sucesso) throw new Error(res.mensagem);
             return res.dados;
         },
-        onSuccess: () => {
-            queryClient.invalidateQueries({ queryKey: ['documents'] });
-        }
+        onSuccess: () => {}
     });
 };

[NoCoverage] StringLiteral
src/hooks/useDocuments.ts:25:56
             return res.dados;
         },
         onSuccess: () => {
-            queryClient.invalidateQueries({ queryKey: ['documents'] });
+            queryClient.invalidateQueries({ queryKey: [""] });
         }
     });

[NoCoverage] BlockStatement
src/hooks/useDocuments.ts:30:37
     });
 };
 
-export const useDownloadUrl = () => {
-    return useMutation({
-        mutationFn: async (documentId: string) => {
-            const res = await getDownloadUrl(documentId);
-            if (!res.sucesso) throw new Error(res.mensagem);
-            return typeof res.dados === 'string' ? res.dados : (res.dados?.url || res.dados?.downloadUrl || res.dados?.fileUrl);
-        }
-    });
-};
+export const useDownloadUrl = () => {};
 

[NoCoverage] ObjectLiteral
src/hooks/useDocuments.ts:31:24
 };
 
 export const useDownloadUrl = () => {
-    return useMutation({
-        mutationFn: async (documentId: string) => {
-            const res = await getDownloadUrl(documentId);
-            if (!res.sucesso) throw new Error(res.mensagem);
-            return typeof res.dados === 'string' ? res.dados : (res.dados?.url || res.dados?.downloadUrl || res.dados?.fileUrl);
-        }
-    });
+    return useMutation({});
 };
 

[NoCoverage] BlockStatement
src/hooks/useDocuments.ts:32:51
 
 export const useDownloadUrl = () => {
     return useMutation({
-        mutationFn: async (documentId: string) => {
-            const res = await getDownloadUrl(documentId);
-            if (!res.sucesso) throw new Error(res.mensagem);
-            return typeof res.dados === 'string' ? res.dados : (res.dados?.url || res.dados?.downloadUrl || res.dados?.fileUrl);
-        }
+        mutationFn: async (documentId: string) => {}
     });
 };

[NoCoverage] ConditionalExpression
src/hooks/useDocuments.ts:34:17
     return useMutation({
         mutationFn: async (documentId: string) => {
             const res = await getDownloadUrl(documentId);
-            if (!res.sucesso) throw new Error(res.mensagem);
+            if (false) throw new Error(res.mensagem);
             return typeof res.dados === 'string' ? res.dados : (res.dados?.url || res.dados?.downloadUrl || res.dados?.fileUrl);
         }

[NoCoverage] ConditionalExpression
src/hooks/useDocuments.ts:35:20
         mutationFn: async (documentId: string) => {
             const res = await getDownloadUrl(documentId);
             if (!res.sucesso) throw new Error(res.mensagem);
-            return typeof res.dados === 'string' ? res.dados : (res.dados?.url || res.dados?.downloadUrl || res.dados?.fileUrl);
+            return true ? res.dados : (res.dados?.url || res.dados?.downloadUrl || res.dados?.fileUrl);
         }
     });

[NoCoverage] EqualityOperator
src/hooks/useDocuments.ts:35:20
         mutationFn: async (documentId: string) => {
             const res = await getDownloadUrl(documentId);
             if (!res.sucesso) throw new Error(res.mensagem);
-            return typeof res.dados === 'string' ? res.dados : (res.dados?.url || res.dados?.downloadUrl || res.dados?.fileUrl);
+            return typeof res.dados !== 'string' ? res.dados : (res.dados?.url || res.dados?.downloadUrl || res.dados?.fileUrl);
         }
     });
