[NoCoverage] StringLiteral
src/hooks/useProjects.ts:6:20
 
 export const useProjects = () => {
     return useQuery({
-        queryKey: ['projects'],
+        queryKey: [""],
         queryFn: async () => {
             const res = await getProjects();

[NoCoverage] ConditionalExpression
src/hooks/useProjects.ts:9:17
         queryKey: ['projects'],
         queryFn: async () => {
             const res = await getProjects();
-            if (!res.sucesso) throw new Error(res.mensagem);
+            if (true) throw new Error(res.mensagem);
             return res.dados || [];
         },
