[NoCoverage] StringLiteral
src/pages/About.tsx:3:51
 export default function About() {
   return (
-    <div style={{ padding: '40px 20px', maxWidth: '800px', margin: '0 auto', textAlign: 'left', flex: 1 }}>
+    <div style={{ padding: '40px 20px', maxWidth: "", margin: '0 auto', textAlign: 'left', flex: 1 }}>
       <a href="/" style={{ display: 'inline-block', marginBottom: '24px', color: 'var(--accent)', textDecoration: 'none', fontWeight: 600 }}>
         &larr; Voltar

[NoCoverage] ObjectLiteral
src/pages/About.tsx:4:26
 export default function About() {
   return (
     <div style={{ padding: '40px 20px', maxWidth: '800px', margin: '0 auto', textAlign: 'left', flex: 1 }}>
-      <a href="/" style={{ display: 'inline-block', marginBottom: '24px', color: 'var(--accent)', textDecoration: 'none', fontWeight: 600 }}>
+      <a href="/" style={{}}>
         &larr; Voltar
       </a>

[NoCoverage] StringLiteral
src/pages/About.tsx:4:67
 export default function About() {
   return (
     <div style={{ padding: '40px 20px', maxWidth: '800px', margin: '0 auto', textAlign: 'left', flex: 1 }}>
-      <a href="/" style={{ display: 'inline-block', marginBottom: '24px', color: 'var(--accent)', textDecoration: 'none', fontWeight: 600 }}>
+      <a href="/" style={{ display: 'inline-block', marginBottom: "", color: 'var(--accent)', textDecoration: 'none', fontWeight: 600 }}>
         &larr; Voltar
       </a>

[NoCoverage] StringLiteral
src/pages/About.tsx:9:29
       </a>
       
       <h1>Sobre o Projeto EdTech</h1>
-      <p style={{ fontSize: '18px', lineHeight: '1.6', marginBottom: '40px' }}>
+      <p style={{ fontSize: "", lineHeight: '1.6', marginBottom: '40px' }}>
         O DocVault (EdTech) é uma plataforma moderna desenvolvida para simplificar 
         o envio, análise e aprovação de documentos acadêmicos entre orientadores e 

[NoCoverage] StringLiteral
src/pages/About.tsx:9:49
       </a>
       
       <h1>Sobre o Projeto EdTech</h1>
-      <p style={{ fontSize: '18px', lineHeight: '1.6', marginBottom: '40px' }}>
+      <p style={{ fontSize: '18px', lineHeight: "", marginBottom: '40px' }}>
         O DocVault (EdTech) é uma plataforma moderna desenvolvida para simplificar 
         o envio, análise e aprovação de documentos acadêmicos entre orientadores e 

[NoCoverage] StringLiteral
src/pages/About.tsx:16:87
       </p>
 
       <h2>Equipe AILAB Makers</h2>
-      <div style={{ display: 'flex', flexDirection: 'column', gap: '20px', marginTop: '20px' }}>
+      <div style={{ display: 'flex', flexDirection: 'column', gap: '20px', marginTop: "" }}>
         
         <div style={{ padding: '16px', border: '1px solid var(--border)', borderRadius: '8px', backgroundColor: 'var(--code-bg)' }}>

[NoCoverage] StringLiteral
src/pages/About.tsx:18:48
       <h2>Equipe AILAB Makers</h2>
       <div style={{ display: 'flex', flexDirection: 'column', gap: '20px', marginTop: '20px' }}>
         
-        <div style={{ padding: '16px', border: '1px solid var(--border)', borderRadius: '8px', backgroundColor: 'var(--code-bg)' }}>
+        <div style={{ padding: '16px', border: "", borderRadius: '8px', backgroundColor: 'var(--code-bg)' }}>
           <h3 style={{ margin: '0 0 8px 0', color: 'var(--text-h)' }}>Pedro Henrique P. Santos</h3>
           <p style={{ margin: 0, fontSize: '14px', color: 'var(--accent)' }}>Tech Lead</p>

[NoCoverage] ObjectLiteral
src/pages/About.tsx:18:21
       <h2>Equipe AILAB Makers</h2>
       <div style={{ display: 'flex', flexDirection: 'column', gap: '20px', marginTop: '20px' }}>
         
-        <div style={{ padding: '16px', border: '1px solid var(--border)', borderRadius: '8px', backgroundColor: 'var(--code-bg)' }}>
+        <div style={{}}>
           <h3 style={{ margin: '0 0 8px 0', color: 'var(--text-h)' }}>Pedro Henrique P. Santos</h3>
           <p style={{ margin: 0, fontSize: '14px', color: 'var(--accent)' }}>Tech Lead</p>

[NoCoverage] ObjectLiteral
src/pages/About.tsx:19:22
       <div style={{ display: 'flex', flexDirection: 'column', gap: '20px', marginTop: '20px' }}>
         
         <div style={{ padding: '16px', border: '1px solid var(--border)', borderRadius: '8px', backgroundColor: 'var(--code-bg)' }}>
-          <h3 style={{ margin: '0 0 8px 0', color: 'var(--text-h)' }}>Pedro Henrique P. Santos</h3>
+          <h3 style={{}}>Pedro Henrique P. Santos</h3>
           <p style={{ margin: 0, fontSize: '14px', color: 'var(--accent)' }}>Tech Lead</p>
         </div>

[NoCoverage] StringLiteral
src/pages/About.tsx:29:52
         </div>
 
         <div style={{ padding: '16px', border: '1px solid var(--border)', borderRadius: '8px' }}>
-          <h3 style={{ margin: '0 0 8px 0', color: 'var(--text-h)' }}>Alana Feitosa (alanafeitosa-ui)</h3>
+          <h3 style={{ margin: '0 0 8px 0', color: "" }}>Alana Feitosa (alanafeitosa-ui)</h3>
           <p style={{ margin: 0, fontSize: '14px' }}>Padawan - Backend</p>
         </div>

[NoCoverage] StringLiteral
src/pages/About.tsx:34:52
         </div>
 
         <div style={{ padding: '16px', border: '1px solid var(--border)', borderRadius: '8px' }}>
-          <h3 style={{ margin: '0 0 8px 0', color: 'var(--text-h)' }}>Mateus Araújo (mateusaraujo2006)</h3>
+          <h3 style={{ margin: '0 0 8px 0', color: "" }}>Mateus Araújo (mateusaraujo2006)</h3>
           <p style={{ margin: 0, fontSize: '14px' }}>Padawan - QA Automation</p>
         </div>

[NoCoverage] ObjectLiteral
src/pages/About.tsx:35:21
 
         <div style={{ padding: '16px', border: '1px solid var(--border)', borderRadius: '8px' }}>
           <h3 style={{ margin: '0 0 8px 0', color: 'var(--text-h)' }}>Mateus Araújo (mateusaraujo2006)</h3>
-          <p style={{ margin: 0, fontSize: '14px' }}>Padawan - QA Automation</p>
+          <p style={{}}>Padawan - QA Automation</p>
         </div>
 

[NoCoverage] StringLiteral
src/pages/About.tsx:35:44
 
         <div style={{ padding: '16px', border: '1px solid var(--border)', borderRadius: '8px' }}>
           <h3 style={{ margin: '0 0 8px 0', color: 'var(--text-h)' }}>Mateus Araújo (mateusaraujo2006)</h3>
-          <p style={{ margin: 0, fontSize: '14px' }}>Padawan - QA Automation</p>
+          <p style={{ margin: 0, fontSize: "" }}>Padawan - QA Automation</p>
         </div>
 

[NoCoverage] StringLiteral
src/pages/About.tsx:39:32
         </div>
 
         <div style={{ padding: '16px', border: '1px solid var(--border)', borderRadius: '8px' }}>
-          <h3 style={{ margin: '0 0 8px 0', color: 'var(--text-h)' }}>Mariana Farias (mariana-farias12)</h3>
+          <h3 style={{ margin: "", color: 'var(--text-h)' }}>Mariana Farias (mariana-farias12)</h3>
           <p style={{ margin: 0, fontSize: '14px' }}>Padawan - Frontend & Design</p>
         </div>

[NoCoverage] StringLiteral
src/pages/About.tsx:39:52
         </div>
 
         <div style={{ padding: '16px', border: '1px solid var(--border)', borderRadius: '8px' }}>
-          <h3 style={{ margin: '0 0 8px 0', color: 'var(--text-h)' }}>Mariana Farias (mariana-farias12)</h3>
+          <h3 style={{ margin: '0 0 8px 0', color: "" }}>Mariana Farias (mariana-farias12)</h3>
           <p style={{ margin: 0, fontSize: '14px' }}>Padawan - Frontend & Design</p>
         </div>
