[NoCoverage] BlockStatement
src/pages/dashboard.tsx:19:21
         researchProgress: 0
     });
 
-    useEffect(() => {
-        if (user?.role === 'RESEARCHER') {
-            getDashboardStats().then(data => {
-                if (data) setStats(data);
-            }).catch(err => console.error("Erro ao carregar estatísticas:", err));
-        }
-    }, [user]);
+    useEffect(() => {}, [user]);
 
 

[NoCoverage] OptionalChaining
src/pages/dashboard.tsx:20:13
     });
 
     useEffect(() => {
-        if (user?.role === 'RESEARCHER') {
+        if (user.role === 'RESEARCHER') {
             getDashboardStats().then(data => {
                 if (data) setStats(data);

[NoCoverage] EqualityOperator
src/pages/dashboard.tsx:20:13
     });
 
     useEffect(() => {
-        if (user?.role === 'RESEARCHER') {
+        if (user?.role !== 'RESEARCHER') {
             getDashboardStats().then(data => {
                 if (data) setStats(data);

[NoCoverage] BlockStatement
src/pages/dashboard.tsx:21:46
 
     useEffect(() => {
         if (user?.role === 'RESEARCHER') {
-            getDashboardStats().then(data => {
-                if (data) setStats(data);
-            }).catch(err => console.error("Erro ao carregar estatísticas:", err));
+            getDashboardStats().then(data => {}).catch(err => console.error("Erro ao carregar estatísticas:", err));
         }
     }, [user]);

[NoCoverage] ConditionalExpression
src/pages/dashboard.tsx:22:21
     useEffect(() => {
         if (user?.role === 'RESEARCHER') {
             getDashboardStats().then(data => {
-                if (data) setStats(data);
+                if (false) setStats(data);
             }).catch(err => console.error("Erro ao carregar estatísticas:", err));
         }

[NoCoverage] ConditionalExpression
src/pages/dashboard.tsx:22:21
     useEffect(() => {
         if (user?.role === 'RESEARCHER') {
             getDashboardStats().then(data => {
-                if (data) setStats(data);
+                if (true) setStats(data);
             }).catch(err => console.error("Erro ao carregar estatísticas:", err));
         }

[NoCoverage] ArrowFunction
src/pages/dashboard.tsx:23:22
         if (user?.role === 'RESEARCHER') {
             getDashboardStats().then(data => {
                 if (data) setStats(data);
-            }).catch(err => console.error("Erro ao carregar estatísticas:", err));
+            }).catch(() => undefined);
         }
     }, [user]);

[NoCoverage] ArrayDeclaration
src/pages/dashboard.tsx:25:8
                 if (data) setStats(data);
             }).catch(err => console.error("Erro ao carregar estatísticas:", err));
         }
-    }, [user]);
+    }, []);
 
 

[NoCoverage] BlockStatement
src/pages/dashboard.tsx:28:51
     }, [user]);
 
 
-    if (user?.role && user.role !== 'RESEARCHER') {
-        return (
-            <DashboardLayout
-                title="Página não encontrada"
-                subtitle="A rota que você tentou acessar não existe ou não está disponível para o seu perfil."
-                breadcrumbs={['EdTech', '404']}
-            >
-                <div style={{ padding: '4rem 2rem', textAlign: 'center' }}>
-                    <i className="bi bi-exclamation-triangle" style={{ fontSize: '3rem', color: 'var(--ed-orange)' }}></i>
-                    <h2 style={{ marginTop: '1rem', color: 'var(--text-main)' }}>Painel indisponível</h2>
-                    <p style={{ color: 'var(--text-muted)' }}>O painel para o seu perfil de {user.role === 'ADVISOR' ? 'Orientador' : 'Auditor'} ainda está em desenvolvimento.</p>
-                    <button className="btn-primary mt-4" onClick={() => navigate('/')}>Voltar para o início</button>
-                </div>
-            </DashboardLayout>
-        );
-    }
+    if (user?.role && user.role !== 'RESEARCHER') {}
 
     return (

[NoCoverage] EqualityOperator
src/pages/dashboard.tsx:28:23
     }, [user]);
 
 
-    if (user?.role && user.role !== 'RESEARCHER') {
+    if (user?.role && user.role === 'RESEARCHER') {
         return (
             <DashboardLayout

[NoCoverage] StringLiteral
src/pages/dashboard.tsx:36:82
                 breadcrumbs={['EdTech', '404']}
             >
                 <div style={{ padding: '4rem 2rem', textAlign: 'center' }}>
-                    <i className="bi bi-exclamation-triangle" style={{ fontSize: '3rem', color: 'var(--ed-orange)' }}></i>
+                    <i className="bi bi-exclamation-triangle" style={{ fontSize: "", color: 'var(--ed-orange)' }}></i>
                     <h2 style={{ marginTop: '1rem', color: 'var(--text-main)' }}>Painel indisponível</h2>
                     <p style={{ color: 'var(--text-muted)' }}>O painel para o seu perfil de {user.role === 'ADVISOR' ? 'Orientador' : 'Auditor'} ainda está em desenvolvimento.</p>

[NoCoverage] StringLiteral
src/pages/dashboard.tsx:37:45
             >
                 <div style={{ padding: '4rem 2rem', textAlign: 'center' }}>
                     <i className="bi bi-exclamation-triangle" style={{ fontSize: '3rem', color: 'var(--ed-orange)' }}></i>
-                    <h2 style={{ marginTop: '1rem', color: 'var(--text-main)' }}>Painel indisponível</h2>
+                    <h2 style={{ marginTop: "", color: 'var(--text-main)' }}>Painel indisponível</h2>
                     <p style={{ color: 'var(--text-muted)' }}>O painel para o seu perfil de {user.role === 'ADVISOR' ? 'Orientador' : 'Auditor'} ainda está em desenvolvimento.</p>
                     <button className="btn-primary mt-4" onClick={() => navigate('/')}>Voltar para o início</button>

[NoCoverage] EqualityOperator
src/pages/dashboard.tsx:38:94
                 <div style={{ padding: '4rem 2rem', textAlign: 'center' }}>
                     <i className="bi bi-exclamation-triangle" style={{ fontSize: '3rem', color: 'var(--ed-orange)' }}></i>
                     <h2 style={{ marginTop: '1rem', color: 'var(--text-main)' }}>Painel indisponível</h2>
-                    <p style={{ color: 'var(--text-muted)' }}>O painel para o seu perfil de {user.role === 'ADVISOR' ? 'Orientador' : 'Auditor'} ainda está em desenvolvimento.</p>
+                    <p style={{ color: 'var(--text-muted)' }}>O painel para o seu perfil de {user.role !== 'ADVISOR' ? 'Orientador' : 'Auditor'} ainda está em desenvolvimento.</p>
                     <button className="btn-primary mt-4" onClick={() => navigate('/')}>Voltar para o início</button>
                 </div>

[NoCoverage] ConditionalExpression
src/pages/dashboard.tsx:38:94
                 <div style={{ padding: '4rem 2rem', textAlign: 'center' }}>
                     <i className="bi bi-exclamation-triangle" style={{ fontSize: '3rem', color: 'var(--ed-orange)' }}></i>
                     <h2 style={{ marginTop: '1rem', color: 'var(--text-main)' }}>Painel indisponível</h2>
-                    <p style={{ color: 'var(--text-muted)' }}>O painel para o seu perfil de {user.role === 'ADVISOR' ? 'Orientador' : 'Auditor'} ainda está em desenvolvimento.</p>
+                    <p style={{ color: 'var(--text-muted)' }}>O painel para o seu perfil de {false ? 'Orientador' : 'Auditor'} ainda está em desenvolvimento.</p>
                     <button className="btn-primary mt-4" onClick={() => navigate('/')}>Voltar para o início</button>
                 </div>

[NoCoverage] ArrowFunction
src/pages/dashboard.tsx:39:67
                     <i className="bi bi-exclamation-triangle" style={{ fontSize: '3rem', color: 'var(--ed-orange)' }}></i>
                     <h2 style={{ marginTop: '1rem', color: 'var(--text-main)' }}>Painel indisponível</h2>
                     <p style={{ color: 'var(--text-muted)' }}>O painel para o seu perfil de {user.role === 'ADVISOR' ? 'Orientador' : 'Auditor'} ainda está em desenvolvimento.</p>
-                    <button className="btn-primary mt-4" onClick={() => navigate('/')}>Voltar para o início</button>
+                    <button className="btn-primary mt-4" onClick={() => undefined}>Voltar para o início</button>
                 </div>
             </DashboardLayout>

[NoCoverage] ArrowFunction
src/pages/dashboard.tsx:109:56
                         <span className="alert-desc">2 documentos têm seções de metodologia incompletas e 1 dataset precisa de anonimização LGPD antes da submissão.</span>
                     </div>
                 </div>
-                <button className="btn-alert" onClick={() => navigate('/trail')}>
+                <button className="btn-alert" onClick={() => undefined}>
                     <i className="bi bi-arrow-right-short"></i> Ver detalhes
                 </button>

[NoCoverage] ObjectLiteral
src/pages/dashboard.tsx:151:76
                             <div className="doc-item">
                                 <div className="doc-info">
                                     <i className="bi bi-file-earmark-code text-muted ms-2"></i>
-                                    <span className="doc-name ms-2" style={{fontWeight: 500}}>config_modelo_final.json</span>
+                                    <span className="doc-name ms-2" style={{}}>config_modelo_final.json</span>
                                 </div>
                                 <span className="doc-status status-draft">Rascunho</span>

[NoCoverage] StringLiteral
src/pages/dashboard.tsx:160:98
 
                     {/* Research Progress */}
                     <div className="dashboard-card">
-                        <div className="card-header-flex" style={{paddingBottom: '10px', border: 'none'}}>
+                        <div className="card-header-flex" style={{paddingBottom: '10px', border: ""}}>
                             <div className="card-title">Progresso da Pesquisa</div>
                         </div>

[NoCoverage] ObjectLiteral
src/pages/dashboard.tsx:180:91
                                     <span>64%</span>
                                 </div>
                                 <div className="progress-bar-bg">
-                                    <div className="progress-bar-fill fill-orange" style={{width: '64%'}}></div>
+                                    <div className="progress-bar-fill fill-orange" style={{}}></div>
                                 </div>
                             </div>

[NoCoverage] StringLiteral
src/pages/dashboard.tsx:190:97
                                     <span>41%</span>
                                 </div>
                                 <div className="progress-bar-bg">
-                                    <div className="progress-bar-fill fill-blue" style={{width: '41%'}}></div>
+                                    <div className="progress-bar-fill fill-blue" style={{width: ""}}></div>
                                 </div>
                             </div>

[NoCoverage] ObjectLiteral
src/pages/dashboard.tsx:190:89
                                     <span>41%</span>
                                 </div>
                                 <div className="progress-bar-bg">
-                                    <div className="progress-bar-fill fill-blue" style={{width: '41%'}}></div>
+                                    <div className="progress-bar-fill fill-blue" style={{}}></div>
                                 </div>
                             </div>

[NoCoverage] StringLiteral
src/pages/dashboard.tsx:231:82
 
                     {/* Activity Feed */}
                     <div className="dashboard-card">
-                        <div className="card-header-flex" style={{paddingBottom: '10px', border: 'none'}}>
+                        <div className="card-header-flex" style={{paddingBottom: "", border: 'none'}}>
                             <div className="card-title">Atividades Recentes</div>
                         </div>

[NoCoverage] StringLiteral
src/pages/dashboard.tsx:268:122
                             </div>
 
                             <div className="activity-item">
-                                <div className="activity-icon" style={{backgroundColor: 'rgba(239, 68, 68, 0.1)', color: '#EF4444'}}><i className="bi bi-exclamation-circle"></i></div>
+                                <div className="activity-icon" style={{backgroundColor: 'rgba(239, 68, 68, 0.1)', color: ""}}><i className="bi bi-exclamation-circle"></i></div>
                                 <div className="activity-details">
                                     <span className="activity-text"><b>Sistema</b> sinalizou risco em <b>Coleta_Entrevistas_Jun.pdf</b></span>
