[NoCoverage] BooleanLiteral
src/pages/documentos.tsx:19:62
     // Modal State
     const [isUploadModalOpen, setIsUploadModalOpen] = useState(false);
     const [previewDoc, setPreviewDoc] = useState<Document | null>(null);
-    const [isPreviewLoading, setIsPreviewLoading] = useState(false);
+    const [isPreviewLoading, setIsPreviewLoading] = useState(true);
     const [isDragging, setIsDragging] = useState(false);
     const [uploadFile, setUploadFile] = useState<File | null>(null);

[NoCoverage] StringLiteral
src/pages/documentos.tsx:22:54
     const [isPreviewLoading, setIsPreviewLoading] = useState(false);
     const [isDragging, setIsDragging] = useState(false);
     const [uploadFile, setUploadFile] = useState<File | null>(null);
-    const [toastMessage, setToastMessage] = useState("");
+    const [toastMessage, setToastMessage] = useState("Stryker was here!");
 
     // React Query Hooks

[NoCoverage] BlockStatement
src/pages/documentos.tsx:29:44
     const { mutateAsync: getUrl } = useDownloadUrl();
     const { mutateAsync: uploadDoc } = useUploadDocument();
 
-    const showToast = (message: string) => {
-        setToastMessage(message);
-        setTimeout(() => setToastMessage(""), 3000);
-    };
+    const showToast = (message: string) => {};
 
     const handleDownload = async (docId: string) => {

[NoCoverage] ArrowFunction
src/pages/documentos.tsx:31:20
 
     const showToast = (message: string) => {
         setToastMessage(message);
-        setTimeout(() => setToastMessage(""), 3000);
+        setTimeout(() => undefined, 3000);
     };
 

[NoCoverage] BlockStatement
src/pages/documentos.tsx:34:53
         setTimeout(() => setToastMessage(""), 3000);
     };
 
-    const handleDownload = async (docId: string) => {
-        showToast("Iniciando download seguro...");
-        
-        try {
-            const url = await getUrl(docId);
-            if (url) {
-                window.open(url, '_blank', 'noopener,noreferrer');
-                showToast("Download finalizado com sucesso!");
-            }
-        } catch (error: any) {
-            showToast("Aviso: Falha ao baixar documento. " + (error.message || "Erro ao obter link."));
-        }
-    };
+    const handleDownload = async (docId: string) => {};
 
     const handleView = (doc: Document) => {

[NoCoverage] StringLiteral
src/pages/documentos.tsx:35:19
     };
 
     const handleDownload = async (docId: string) => {
-        showToast("Iniciando download seguro...");
+        showToast("");
         
         try {

[NoCoverage] BlockStatement
src/pages/documentos.tsx:37:13
     const handleDownload = async (docId: string) => {
         showToast("Iniciando download seguro...");
         
-        try {
-            const url = await getUrl(docId);
-            if (url) {
-                window.open(url, '_blank', 'noopener,noreferrer');
-                showToast("Download finalizado com sucesso!");
-            }
-        } catch (error: any) {
+        try {} catch (error: any) {
             showToast("Aviso: Falha ao baixar documento. " + (error.message || "Erro ao obter link."));
         }

[NoCoverage] BlockStatement
src/pages/documentos.tsx:39:22
         
         try {
             const url = await getUrl(docId);
-            if (url) {
-                window.open(url, '_blank', 'noopener,noreferrer');
-                showToast("Download finalizado com sucesso!");
-            }
+            if (url) {}
         } catch (error: any) {
             showToast("Aviso: Falha ao baixar documento. " + (error.message || "Erro ao obter link."));

[NoCoverage] BlockStatement
src/pages/documentos.tsx:43:30
                 window.open(url, '_blank', 'noopener,noreferrer');
                 showToast("Download finalizado com sucesso!");
             }
-        } catch (error: any) {
-            showToast("Aviso: Falha ao baixar documento. " + (error.message || "Erro ao obter link."));
-        }
+        } catch (error: any) {}
     };
 

[NoCoverage] ConditionalExpression
src/pages/documentos.tsx:44:63
                 showToast("Download finalizado com sucesso!");
             }
         } catch (error: any) {
-            showToast("Aviso: Falha ao baixar documento. " + (error.message || "Erro ao obter link."));
+            showToast("Aviso: Falha ao baixar documento. " + (true));
         }
     };

[NoCoverage] ConditionalExpression
src/pages/documentos.tsx:44:63
                 showToast("Download finalizado com sucesso!");
             }
         } catch (error: any) {
-            showToast("Aviso: Falha ao baixar documento. " + (error.message || "Erro ao obter link."));
+            showToast("Aviso: Falha ao baixar documento. " + (false));
         }
     };

[NoCoverage] BlockStatement
src/pages/documentos.tsx:48:43
         }
     };
 
-    const handleView = (doc: Document) => {
-        setPreviewDoc(doc);
-        setIsPreviewLoading(true);
-        setTimeout(() => {
-            setIsPreviewLoading(false);
-        }, 2000);
-    };
+    const handleView = (doc: Document) => {};
 
     const closePreviewModal = () => {

[NoCoverage] BlockStatement
src/pages/documentos.tsx:51:26
     const handleView = (doc: Document) => {
         setPreviewDoc(doc);
         setIsPreviewLoading(true);
-        setTimeout(() => {
-            setIsPreviewLoading(false);
-        }, 2000);
+        setTimeout(() => {}, 2000);
     };
 

[NoCoverage] BooleanLiteral
src/pages/documentos.tsx:52:33
         setPreviewDoc(doc);
         setIsPreviewLoading(true);
         setTimeout(() => {
-            setIsPreviewLoading(false);
+            setIsPreviewLoading(true);
         }, 2000);
     };

[NoCoverage] ConditionalExpression
src/pages/documentos.tsx:86:13
     const handleDrop = (e: React.DragEvent) => {
         e.preventDefault();
         setIsDragging(false);
-        if (e.dataTransfer.files && e.dataTransfer.files[0]) {
+        if (true) {
             setUploadFile(e.dataTransfer.files[0]);
         }

[NoCoverage] LogicalOperator
src/pages/documentos.tsx:86:13
     const handleDrop = (e: React.DragEvent) => {
         e.preventDefault();
         setIsDragging(false);
-        if (e.dataTransfer.files && e.dataTransfer.files[0]) {
+        if (e.dataTransfer.files || e.dataTransfer.files[0]) {
             setUploadFile(e.dataTransfer.files[0]);
         }

[NoCoverage] ConditionalExpression
src/pages/documentos.tsx:92:13
     };
 
     const handleFileInput = (e: React.ChangeEvent<HTMLInputElement>) => {
-        if (e.target.files && e.target.files.length > 0) {
+        if (true) {
             setUploadFile(e.target.files[0]);
         }

[NoCoverage] StringLiteral
src/pages/documentos.tsx:99:92
 
     // Mocks for prototype UI structure
     const mockDocuments = [
-        { id: '1', title: 'Metodologia_Qualitativa_v3.pdf', project: 'Análise LGPD', type: 'PDF', size: '2.4 MB', modified: 'Hoje, 14:32', status: 'Em Revisão' },
+        { id: '1', title: 'Metodologia_Qualitativa_v3.pdf', project: 'Análise LGPD', type: "", size: '2.4 MB', modified: 'Hoje, 14:32', status: 'Em Revisão' },
         { id: '2', title: 'Dataset_Experimento_A.csv', project: 'Sistemas de IA', type: 'CSV', size: '18.7 MB', modified: 'Ontem, 09:15', status: 'Aprovado' },
         { id: '3', title: 'Referencial_Teorico_v2.pdf', project: 'Análise LGPD', type: 'PDF', size: '890 KB', modified: '12 Jun 2026', status: 'Submetido' },

[NoCoverage] StringLiteral
src/pages/documentos.tsx:100:27
     // Mocks for prototype UI structure
     const mockDocuments = [
         { id: '1', title: 'Metodologia_Qualitativa_v3.pdf', project: 'Análise LGPD', type: 'PDF', size: '2.4 MB', modified: 'Hoje, 14:32', status: 'Em Revisão' },
-        { id: '2', title: 'Dataset_Experimento_A.csv', project: 'Sistemas de IA', type: 'CSV', size: '18.7 MB', modified: 'Ontem, 09:15', status: 'Aprovado' },
+        { id: '2', title: "", project: 'Sistemas de IA', type: 'CSV', size: '18.7 MB', modified: 'Ontem, 09:15', status: 'Aprovado' },
         { id: '3', title: 'Referencial_Teorico_v2.pdf', project: 'Análise LGPD', type: 'PDF', size: '890 KB', modified: '12 Jun 2026', status: 'Submetido' },
         { id: '4', title: 'config_modelo_final.json', project: 'Sistemas de IA', type: 'JSON', size: '12 KB', modified: '10 Jun 2026', status: 'Rascunho' },

[NoCoverage] StringLiteral
src/pages/documentos.tsx:100:102
     // Mocks for prototype UI structure
     const mockDocuments = [
         { id: '1', title: 'Metodologia_Qualitativa_v3.pdf', project: 'Análise LGPD', type: 'PDF', size: '2.4 MB', modified: 'Hoje, 14:32', status: 'Em Revisão' },
-        { id: '2', title: 'Dataset_Experimento_A.csv', project: 'Sistemas de IA', type: 'CSV', size: '18.7 MB', modified: 'Ontem, 09:15', status: 'Aprovado' },
+        { id: '2', title: 'Dataset_Experimento_A.csv', project: 'Sistemas de IA', type: 'CSV', size: "", modified: 'Ontem, 09:15', status: 'Aprovado' },
         { id: '3', title: 'Referencial_Teorico_v2.pdf', project: 'Análise LGPD', type: 'PDF', size: '890 KB', modified: '12 Jun 2026', status: 'Submetido' },
         { id: '4', title: 'config_modelo_final.json', project: 'Sistemas de IA', type: 'JSON', size: '12 KB', modified: '10 Jun 2026', status: 'Rascunho' },

[NoCoverage] StringLiteral
src/pages/documentos.tsx:101:27
     const mockDocuments = [
         { id: '1', title: 'Metodologia_Qualitativa_v3.pdf', project: 'Análise LGPD', type: 'PDF', size: '2.4 MB', modified: 'Hoje, 14:32', status: 'Em Revisão' },
         { id: '2', title: 'Dataset_Experimento_A.csv', project: 'Sistemas de IA', type: 'CSV', size: '18.7 MB', modified: 'Ontem, 09:15', status: 'Aprovado' },
-        { id: '3', title: 'Referencial_Teorico_v2.pdf', project: 'Análise LGPD', type: 'PDF', size: '890 KB', modified: '12 Jun 2026', status: 'Submetido' },
+        { id: '3', title: "", project: 'Análise LGPD', type: 'PDF', size: '890 KB', modified: '12 Jun 2026', status: 'Submetido' },
         { id: '4', title: 'config_modelo_final.json', project: 'Sistemas de IA', type: 'JSON', size: '12 KB', modified: '10 Jun 2026', status: 'Rascunho' },
         { id: '5', title: 'Resultados_Parciais_Q2.pdf', project: 'Bioinformática', type: 'PDF', size: '4.1 MB', modified: '08 Jun 2026', status: 'Aprovado' },

[NoCoverage] StringLiteral
src/pages/documentos.tsx:101:101
     const mockDocuments = [
         { id: '1', title: 'Metodologia_Qualitativa_v3.pdf', project: 'Análise LGPD', type: 'PDF', size: '2.4 MB', modified: 'Hoje, 14:32', status: 'Em Revisão' },
         { id: '2', title: 'Dataset_Experimento_A.csv', project: 'Sistemas de IA', type: 'CSV', size: '18.7 MB', modified: 'Ontem, 09:15', status: 'Aprovado' },
-        { id: '3', title: 'Referencial_Teorico_v2.pdf', project: 'Análise LGPD', type: 'PDF', size: '890 KB', modified: '12 Jun 2026', status: 'Submetido' },
+        { id: '3', title: 'Referencial_Teorico_v2.pdf', project: 'Análise LGPD', type: 'PDF', size: "", modified: '12 Jun 2026', status: 'Submetido' },
         { id: '4', title: 'config_modelo_final.json', project: 'Sistemas de IA', type: 'JSON', size: '12 KB', modified: '10 Jun 2026', status: 'Rascunho' },
         { id: '5', title: 'Resultados_Parciais_Q2.pdf', project: 'Bioinformática', type: 'PDF', size: '4.1 MB', modified: '08 Jun 2026', status: 'Aprovado' },

[NoCoverage] StringLiteral
src/pages/documentos.tsx:102:121
         { id: '1', title: 'Metodologia_Qualitativa_v3.pdf', project: 'Análise LGPD', type: 'PDF', size: '2.4 MB', modified: 'Hoje, 14:32', status: 'Em Revisão' },
         { id: '2', title: 'Dataset_Experimento_A.csv', project: 'Sistemas de IA', type: 'CSV', size: '18.7 MB', modified: 'Ontem, 09:15', status: 'Aprovado' },
         { id: '3', title: 'Referencial_Teorico_v2.pdf', project: 'Análise LGPD', type: 'PDF', size: '890 KB', modified: '12 Jun 2026', status: 'Submetido' },
-        { id: '4', title: 'config_modelo_final.json', project: 'Sistemas de IA', type: 'JSON', size: '12 KB', modified: '10 Jun 2026', status: 'Rascunho' },
+        { id: '4', title: 'config_modelo_final.json', project: 'Sistemas de IA', type: 'JSON', size: '12 KB', modified: "", status: 'Rascunho' },
         { id: '5', title: 'Resultados_Parciais_Q2.pdf', project: 'Bioinformática', type: 'PDF', size: '4.1 MB', modified: '08 Jun 2026', status: 'Aprovado' },
     ];

[NoCoverage] StringLiteral
src/pages/documentos.tsx:102:88
         { id: '1', title: 'Metodologia_Qualitativa_v3.pdf', project: 'Análise LGPD', type: 'PDF', size: '2.4 MB', modified: 'Hoje, 14:32', status: 'Em Revisão' },
         { id: '2', title: 'Dataset_Experimento_A.csv', project: 'Sistemas de IA', type: 'CSV', size: '18.7 MB', modified: 'Ontem, 09:15', status: 'Aprovado' },
         { id: '3', title: 'Referencial_Teorico_v2.pdf', project: 'Análise LGPD', type: 'PDF', size: '890 KB', modified: '12 Jun 2026', status: 'Submetido' },
-        { id: '4', title: 'config_modelo_final.json', project: 'Sistemas de IA', type: 'JSON', size: '12 KB', modified: '10 Jun 2026', status: 'Rascunho' },
+        { id: '4', title: 'config_modelo_final.json', project: 'Sistemas de IA', type: "", size: '12 KB', modified: '10 Jun 2026', status: 'Rascunho' },
         { id: '5', title: 'Resultados_Parciais_Q2.pdf', project: 'Bioinformática', type: 'PDF', size: '4.1 MB', modified: '08 Jun 2026', status: 'Aprovado' },
     ];

[NoCoverage] StringLiteral
src/pages/documentos.tsx:103:123
         { id: '2', title: 'Dataset_Experimento_A.csv', project: 'Sistemas de IA', type: 'CSV', size: '18.7 MB', modified: 'Ontem, 09:15', status: 'Aprovado' },
         { id: '3', title: 'Referencial_Teorico_v2.pdf', project: 'Análise LGPD', type: 'PDF', size: '890 KB', modified: '12 Jun 2026', status: 'Submetido' },
         { id: '4', title: 'config_modelo_final.json', project: 'Sistemas de IA', type: 'JSON', size: '12 KB', modified: '10 Jun 2026', status: 'Rascunho' },
-        { id: '5', title: 'Resultados_Parciais_Q2.pdf', project: 'Bioinformática', type: 'PDF', size: '4.1 MB', modified: '08 Jun 2026', status: 'Aprovado' },
+        { id: '5', title: 'Resultados_Parciais_Q2.pdf', project: 'Bioinformática', type: 'PDF', size: '4.1 MB', modified: "", status: 'Aprovado' },
     ];
 

[NoCoverage] BlockStatement
src/pages/documentos.tsx:106:48
         { id: '5', title: 'Resultados_Parciais_Q2.pdf', project: 'Bioinformática', type: 'PDF', size: '4.1 MB', modified: '08 Jun 2026', status: 'Aprovado' },
     ];
 
-    const getStatusClass = (status: string) => {
-        switch(status) {
-            case 'Em Revisão': return 'status-review';
-            case 'Aprovado': return 'status-approved';
-            case 'Submetido': return 'status-submitted';
-            case 'Rascunho': return 'status-draft';
-            default: return 'status-draft';
-        }
-    };
+    const getStatusClass = (status: string) => {};
 
     const getTypeColor = (type: string) => {

[NoCoverage] ConditionalExpression
src/pages/documentos.tsx:108:13
 
     const getStatusClass = (status: string) => {
         switch(status) {
-            case 'Em Revisão': return 'status-review';
+            case 'Em Revisão':
             case 'Aprovado': return 'status-approved';
             case 'Submetido': return 'status-submitted';

[NoCoverage] ConditionalExpression
src/pages/documentos.tsx:109:13
     const getStatusClass = (status: string) => {
         switch(status) {
             case 'Em Revisão': return 'status-review';
-            case 'Aprovado': return 'status-approved';
+            case 'Aprovado':
             case 'Submetido': return 'status-submitted';
             case 'Rascunho': return 'status-draft';

[NoCoverage] StringLiteral
src/pages/documentos.tsx:109:18
     const getStatusClass = (status: string) => {
         switch(status) {
             case 'Em Revisão': return 'status-review';
-            case 'Aprovado': return 'status-approved';
+            case "": return 'status-approved';
             case 'Submetido': return 'status-submitted';
             case 'Rascunho': return 'status-draft';

[NoCoverage] ConditionalExpression
src/pages/documentos.tsx:110:13
         switch(status) {
             case 'Em Revisão': return 'status-review';
             case 'Aprovado': return 'status-approved';
-            case 'Submetido': return 'status-submitted';
+            case 'Submetido':
             case 'Rascunho': return 'status-draft';
             default: return 'status-draft';

[NoCoverage] ConditionalExpression
src/pages/documentos.tsx:111:13
             case 'Em Revisão': return 'status-review';
             case 'Aprovado': return 'status-approved';
             case 'Submetido': return 'status-submitted';
-            case 'Rascunho': return 'status-draft';
+            case 'Rascunho':
             default: return 'status-draft';
         }

[NoCoverage] StringLiteral
src/pages/documentos.tsx:111:18
             case 'Em Revisão': return 'status-review';
             case 'Aprovado': return 'status-approved';
             case 'Submetido': return 'status-submitted';
-            case 'Rascunho': return 'status-draft';
+            case "": return 'status-draft';
             default: return 'status-draft';
         }

[NoCoverage] ConditionalExpression
src/pages/documentos.tsx:112:13
             case 'Aprovado': return 'status-approved';
             case 'Submetido': return 'status-submitted';
             case 'Rascunho': return 'status-draft';
-            default: return 'status-draft';
+            default:
         }
     };

[NoCoverage] BlockStatement
src/pages/documentos.tsx:116:44
         }
     };
 
-    const getTypeColor = (type: string) => {
-        switch(type) {
-            case 'PDF': return 'type-pdf';
-            case 'CSV': return 'type-csv';
-            case 'JSON': return 'type-json';
-            default: return 'type-default';
-        }
-    };
+    const getTypeColor = (type: string) => {};
 
     return (

[NoCoverage] ConditionalExpression
src/pages/documentos.tsx:118:13
 
     const getTypeColor = (type: string) => {
         switch(type) {
-            case 'PDF': return 'type-pdf';
+            case 'PDF':
             case 'CSV': return 'type-csv';
             case 'JSON': return 'type-json';

[NoCoverage] StringLiteral
src/pages/documentos.tsx:118:32
 
     const getTypeColor = (type: string) => {
         switch(type) {
-            case 'PDF': return 'type-pdf';
+            case 'PDF': return "";
             case 'CSV': return 'type-csv';
             case 'JSON': return 'type-json';

[NoCoverage] ConditionalExpression
src/pages/documentos.tsx:119:13
     const getTypeColor = (type: string) => {
         switch(type) {
             case 'PDF': return 'type-pdf';
-            case 'CSV': return 'type-csv';
+            case 'CSV':
             case 'JSON': return 'type-json';
             default: return 'type-default';

[NoCoverage] StringLiteral
src/pages/documentos.tsx:119:18
     const getTypeColor = (type: string) => {
         switch(type) {
             case 'PDF': return 'type-pdf';
-            case 'CSV': return 'type-csv';
+            case "": return 'type-csv';
             case 'JSON': return 'type-json';
             default: return 'type-default';

[NoCoverage] ConditionalExpression
src/pages/documentos.tsx:120:13
         switch(type) {
             case 'PDF': return 'type-pdf';
             case 'CSV': return 'type-csv';
-            case 'JSON': return 'type-json';
+            case 'JSON':
             default: return 'type-default';
         }

[NoCoverage] StringLiteral
src/pages/documentos.tsx:120:18
         switch(type) {
             case 'PDF': return 'type-pdf';
             case 'CSV': return 'type-csv';
-            case 'JSON': return 'type-json';
+            case "": return 'type-json';
             default: return 'type-default';
         }

[NoCoverage] ConditionalExpression
src/pages/documentos.tsx:121:13
             case 'PDF': return 'type-pdf';
             case 'CSV': return 'type-csv';
             case 'JSON': return 'type-json';
-            default: return 'type-default';
+            default:
         }
     };

[NoCoverage] ArrayDeclaration
src/pages/documentos.tsx:129:26
         <DashboardLayout
             title="Meus Documentos"
             subtitle="Gerencie seus arquivos de pesquisa e acompanhe submissões"
-            breadcrumbs={['EdTech', 'Área de Pesquisa']}
+            breadcrumbs={[]}
         >
             {/* Top Stats Cards */}

[NoCoverage] StringLiteral
src/pages/documentos.tsx:234:63
                                     <td>
                                         <div className="d-flex align-items-center gap-3">
                                             <div className={`doc-type-icon ${getTypeColor(doc.type)}-bg`}>
-                                                <i className={`bi bi-file-earmark-text ${getTypeColor(doc.type)}-text`}></i>
+                                                <i className={``}></i>
                                             </div>
                                             <span className="doc-title-cell">{doc.title}</span>

[NoCoverage] StringLiteral
src/pages/documentos.tsx:250:58
                                         <i className="bi bi-clock me-1"></i> {doc.modified}
                                     </td>
                                     <td>
-                                        <span className={`doc-status ${getStatusClass(doc.status)}`}>
+                                        <span className={``}>
                                             {doc.status}
                                         </span>

[NoCoverage] ArrowFunction
src/pages/documentos.tsx:256:109
                                     </td>
                                     <td>
                                         <div className="table-actions">
-                                            <button className="btn-icon-action" title="Visualizar" onClick={() => handleView(doc)}>
+                                            <button className="btn-icon-action" title="Visualizar" onClick={() => undefined}>
                                                 <i className="bi bi-eye"></i>
                                             </button>

[NoCoverage] ArrowFunction
src/pages/documentos.tsx:259:107
                                             <button className="btn-icon-action" title="Visualizar" onClick={() => handleView(doc)}>
                                                 <i className="bi bi-eye"></i>
                                             </button>
-                                            <button className="btn-icon-action" title="Download" onClick={() => handleDownload(doc.id)}>
+                                            <button className="btn-icon-action" title="Download" onClick={() => undefined}>
                                                 <i className="bi bi-download"></i>
                                             </button>

[NoCoverage] ArrowFunction
src/pages/documentos.tsx:262:105
                                             <button className="btn-icon-action" title="Download" onClick={() => handleDownload(doc.id)}>
                                                 <i className="bi bi-download"></i>
                                             </button>
-                                            <button className="btn-icon-action" title="Opções" onClick={() => handleOptions(doc.name)}>
+                                            <button className="btn-icon-action" title="Opções" onClick={() => undefined}>
                                                 <i className="bi bi-three-dots"></i>
                                             </button>

[NoCoverage] StringLiteral
src/pages/documentos.tsx:300:69
                                     <i className="bi bi-upload"></i>
                                 </div>
                                 <p className="upload-main-text">
-                                    {uploadFile ? uploadFile.name : 'Arraste e solte ou clique para selecionar'}
+                                    {uploadFile ? uploadFile.name : ""}
                                 </p>
                                 <p className="upload-sub-text">

[NoCoverage] ArrowFunction
src/pages/documentos.tsx:330:69
             {/* Document Preview Modal */}
             {previewDoc && (
                 <div className="modal-overlay" onClick={closePreviewModal} style={{ zIndex: 1050 }}>
-                    <div className="preview-modal-content" onClick={(e) => e.stopPropagation()}>
+                    <div className="preview-modal-content" onClick={() => undefined}>
                         <div className="preview-modal-header">
                             <div className="d-flex align-items-center gap-3">

[NoCoverage] StringLiteral
src/pages/documentos.tsx:333:50
                     <div className="preview-modal-content" onClick={(e) => e.stopPropagation()}>
                         <div className="preview-modal-header">
                             <div className="d-flex align-items-center gap-3">
-                                <span className={`type-badge ${getTypeColor(previewDoc.type)}-text`}>
+                                <span className={``}>
                                     {previewDoc.type}
                                 </span>

[NoCoverage] StringLiteral
src/pages/documentos.tsx:337:91
                                     {previewDoc.type}
                                 </span>
                                 <div>
-                                    <h3 className="m-0" style={{ fontSize: '18px', color: 'var(--ed-text-light)' }}>{previewDoc.name}</h3>
+                                    <h3 className="m-0" style={{ fontSize: '18px', color: "" }}>{previewDoc.name}</h3>
                                     <span style={{ fontSize: '12px', color: 'var(--ed-text-muted)' }}>{previewDoc.size} • {previewDoc.project}</span>
                                 </div>

[NoCoverage] ObjectLiteral
src/pages/documentos.tsx:337:64
                                     {previewDoc.type}
                                 </span>
                                 <div>
-                                    <h3 className="m-0" style={{ fontSize: '18px', color: 'var(--ed-text-light)' }}>{previewDoc.name}</h3>
+                                    <h3 className="m-0" style={{}}>{previewDoc.name}</h3>
                                     <span style={{ fontSize: '12px', color: 'var(--ed-text-muted)' }}>{previewDoc.size} • {previewDoc.project}</span>
                                 </div>

[NoCoverage] StringLiteral
src/pages/documentos.tsx:362:106
                                         <div className="dummy-line short"></div>
                                         
                                         <div className="dummy-image">
-                                            <i className="bi bi-image" style={{ fontSize: '48px', color: 'rgba(255,255,255,0.1)' }}></i>
+                                            <i className="bi bi-image" style={{ fontSize: '48px', color: "" }}></i>
                                         </div>
 

[NoCoverage] StringLiteral
src/pages/documentos.tsx:371:98
                                     </div>
                                 ) : (
                                     <div className="dummy-page document-content">
-                                        <h2 style={{ color: 'var(--ed-text-dark)', marginBottom: '24px' }}>{previewDoc.name}</h2>
+                                        <h2 style={{ color: 'var(--ed-text-dark)', marginBottom: "" }}>{previewDoc.name}</h2>
                                         <p style={{ color: '#4a4a4a', lineHeight: '1.6', marginBottom: '16px' }}>
                                             Este é um documento de visualização fictício para o arquivo selecionado.

[NoCoverage] ObjectLiteral
src/pages/documentos.tsx:372:51
                                 ) : (
                                     <div className="dummy-page document-content">
                                         <h2 style={{ color: 'var(--ed-text-dark)', marginBottom: '24px' }}>{previewDoc.name}</h2>
-                                        <p style={{ color: '#4a4a4a', lineHeight: '1.6', marginBottom: '16px' }}>
+                                        <p style={{}}>
                                             Este é um documento de visualização fictício para o arquivo selecionado.
                                             Na versão final do sistema conectado ao Storage, aqui será renderizado o conteúdo nativo

[NoCoverage] StringLiteral
src/pages/documentos.tsx:377:83
                                             Na versão final do sistema conectado ao Storage, aqui será renderizado o conteúdo nativo
                                             do arquivo (PDF Viewer integrado, tabela de dados CSV ou renderizador JSON).
                                         </p>
-                                        <p style={{ color: '#4a4a4a', lineHeight: '1.6', marginBottom: '16px' }}>
+                                        <p style={{ color: '#4a4a4a', lineHeight: "", marginBottom: '16px' }}>
                                             A plataforma EdTech garante acesso seguro e auditado. Todas as ações de visualização
                                             são registradas nos logs de segurança da <strong>Trilha de Pesquisa</strong>.
