[NoCoverage] StringLiteral
src/pages/documentos.tsx:382:136
                                             são registradas nos logs de segurança da <strong>Trilha de Pesquisa</strong>.
                                         </p>
                                         
-                                        <div style={{ backgroundColor: 'var(--code-bg)', padding: '24px', borderRadius: '8px', border: '1px solid var(--border)', marginTop: '32px' }}>
+                                        <div style={{ backgroundColor: 'var(--code-bg)', padding: '24px', borderRadius: '8px', border: "", marginTop: '32px' }}>
                                             <h4 style={{ color: 'var(--ed-purple-main)', marginTop: 0, marginBottom: '12px' }}>Detalhes do Arquivo</h4>
                                             <ul style={{ listStyleType: 'none', padding: 0, margin: 0, color: 'var(--ed-text-muted)', fontSize: '14px' }}>

[NoCoverage] StringLiteral
src/pages/documentos.tsx:382:121
                                             são registradas nos logs de segurança da <strong>Trilha de Pesquisa</strong>.
                                         </p>
                                         
-                                        <div style={{ backgroundColor: 'var(--code-bg)', padding: '24px', borderRadius: '8px', border: '1px solid var(--border)', marginTop: '32px' }}>
+                                        <div style={{ backgroundColor: 'var(--code-bg)', padding: '24px', borderRadius: "", border: '1px solid var(--border)', marginTop: '32px' }}>
                                             <h4 style={{ color: 'var(--ed-purple-main)', marginTop: 0, marginBottom: '12px' }}>Detalhes do Arquivo</h4>
                                             <ul style={{ listStyleType: 'none', padding: 0, margin: 0, color: 'var(--ed-text-muted)', fontSize: '14px' }}>

[NoCoverage] ObjectLiteral
src/pages/documentos.tsx:383:56
                                         </p>
                                         
                                         <div style={{ backgroundColor: 'var(--code-bg)', padding: '24px', borderRadius: '8px', border: '1px solid var(--border)', marginTop: '32px' }}>
-                                            <h4 style={{ color: 'var(--ed-purple-main)', marginTop: 0, marginBottom: '12px' }}>Detalhes do Arquivo</h4>
+                                            <h4 style={{}}>Detalhes do Arquivo</h4>
                                             <ul style={{ listStyleType: 'none', padding: 0, margin: 0, color: 'var(--ed-text-muted)', fontSize: '14px' }}>
                                                 <li style={{ marginBottom: '8px' }}><strong>ID do Registro:</strong> {previewDoc.id}</li>

[NoCoverage] ObjectLiteral
src/pages/documentos.tsx:384:56
                                         
                                         <div style={{ backgroundColor: 'var(--code-bg)', padding: '24px', borderRadius: '8px', border: '1px solid var(--border)', marginTop: '32px' }}>
                                             <h4 style={{ color: 'var(--ed-purple-main)', marginTop: 0, marginBottom: '12px' }}>Detalhes do Arquivo</h4>
-                                            <ul style={{ listStyleType: 'none', padding: 0, margin: 0, color: 'var(--ed-text-muted)', fontSize: '14px' }}>
+                                            <ul style={{}}>
                                                 <li style={{ marginBottom: '8px' }}><strong>ID do Registro:</strong> {previewDoc.id}</li>
                                                 <li style={{ marginBottom: '8px' }}><strong>Projeto / Workpace:</strong> {previewDoc.project}</li>

[NoCoverage] StringLiteral
src/pages/documentos.tsx:385:76
                                         <div style={{ backgroundColor: 'var(--code-bg)', padding: '24px', borderRadius: '8px', border: '1px solid var(--border)', marginTop: '32px' }}>
                                             <h4 style={{ color: 'var(--ed-purple-main)', marginTop: 0, marginBottom: '12px' }}>Detalhes do Arquivo</h4>
                                             <ul style={{ listStyleType: 'none', padding: 0, margin: 0, color: 'var(--ed-text-muted)', fontSize: '14px' }}>
-                                                <li style={{ marginBottom: '8px' }}><strong>ID do Registro:</strong> {previewDoc.id}</li>
+                                                <li style={{ marginBottom: "" }}><strong>ID do Registro:</strong> {previewDoc.id}</li>
                                                 <li style={{ marginBottom: '8px' }}><strong>Projeto / Workpace:</strong> {previewDoc.project}</li>
                                                 <li style={{ marginBottom: '8px' }}><strong>Tamanho Identificado:</strong> {previewDoc.size}</li>

[NoCoverage] ObjectLiteral
src/pages/documentos.tsx:385:60
                                         <div style={{ backgroundColor: 'var(--code-bg)', padding: '24px', borderRadius: '8px', border: '1px solid var(--border)', marginTop: '32px' }}>
                                             <h4 style={{ color: 'var(--ed-purple-main)', marginTop: 0, marginBottom: '12px' }}>Detalhes do Arquivo</h4>
                                             <ul style={{ listStyleType: 'none', padding: 0, margin: 0, color: 'var(--ed-text-muted)', fontSize: '14px' }}>
-                                                <li style={{ marginBottom: '8px' }}><strong>ID do Registro:</strong> {previewDoc.id}</li>
+                                                <li style={{}}><strong>ID do Registro:</strong> {previewDoc.id}</li>
                                                 <li style={{ marginBottom: '8px' }}><strong>Projeto / Workpace:</strong> {previewDoc.project}</li>
                                                 <li style={{ marginBottom: '8px' }}><strong>Tamanho Identificado:</strong> {previewDoc.size}</li>

[NoCoverage] ObjectLiteral
src/pages/documentos.tsx:386:60
                                             <h4 style={{ color: 'var(--ed-purple-main)', marginTop: 0, marginBottom: '12px' }}>Detalhes do Arquivo</h4>
                                             <ul style={{ listStyleType: 'none', padding: 0, margin: 0, color: 'var(--ed-text-muted)', fontSize: '14px' }}>
                                                 <li style={{ marginBottom: '8px' }}><strong>ID do Registro:</strong> {previewDoc.id}</li>
-                                                <li style={{ marginBottom: '8px' }}><strong>Projeto / Workpace:</strong> {previewDoc.project}</li>
+                                                <li style={{}}><strong>Projeto / Workpace:</strong> {previewDoc.project}</li>
                                                 <li style={{ marginBottom: '8px' }}><strong>Tamanho Identificado:</strong> {previewDoc.size}</li>
                                                 <li><strong>Status de Conformidade:</strong> <span style={{ color: 'var(--ed-green-main)' }}>Validado</span></li>

[NoCoverage] StringLiteral
src/pages/documentos.tsx:386:76
                                             <h4 style={{ color: 'var(--ed-purple-main)', marginTop: 0, marginBottom: '12px' }}>Detalhes do Arquivo</h4>
                                             <ul style={{ listStyleType: 'none', padding: 0, margin: 0, color: 'var(--ed-text-muted)', fontSize: '14px' }}>
                                                 <li style={{ marginBottom: '8px' }}><strong>ID do Registro:</strong> {previewDoc.id}</li>
-                                                <li style={{ marginBottom: '8px' }}><strong>Projeto / Workpace:</strong> {previewDoc.project}</li>
+                                                <li style={{ marginBottom: "" }}><strong>Projeto / Workpace:</strong> {previewDoc.project}</li>
                                                 <li style={{ marginBottom: '8px' }}><strong>Tamanho Identificado:</strong> {previewDoc.size}</li>
                                                 <li><strong>Status de Conformidade:</strong> <span style={{ color: 'var(--ed-green-main)' }}>Validado</span></li>

[NoCoverage] ObjectLiteral
src/pages/documentos.tsx:387:60
                                             <ul style={{ listStyleType: 'none', padding: 0, margin: 0, color: 'var(--ed-text-muted)', fontSize: '14px' }}>
                                                 <li style={{ marginBottom: '8px' }}><strong>ID do Registro:</strong> {previewDoc.id}</li>
                                                 <li style={{ marginBottom: '8px' }}><strong>Projeto / Workpace:</strong> {previewDoc.project}</li>
-                                                <li style={{ marginBottom: '8px' }}><strong>Tamanho Identificado:</strong> {previewDoc.size}</li>
+                                                <li style={{}}><strong>Tamanho Identificado:</strong> {previewDoc.size}</li>
                                                 <li><strong>Status de Conformidade:</strong> <span style={{ color: 'var(--ed-green-main)' }}>Validado</span></li>
                                             </ul>

[NoCoverage] StringLiteral
src/pages/documentos.tsx:388:116
                                                 <li style={{ marginBottom: '8px' }}><strong>ID do Registro:</strong> {previewDoc.id}</li>
                                                 <li style={{ marginBottom: '8px' }}><strong>Projeto / Workpace:</strong> {previewDoc.project}</li>
                                                 <li style={{ marginBottom: '8px' }}><strong>Tamanho Identificado:</strong> {previewDoc.size}</li>
-                                                <li><strong>Status de Conformidade:</strong> <span style={{ color: 'var(--ed-green-main)' }}>Validado</span></li>
+                                                <li><strong>Status de Conformidade:</strong> <span style={{ color: "" }}>Validado</span></li>
                                             </ul>
                                         </div>
