[Survived] StringLiteral
src/pages/Recovery.tsx:11:38
 function Recovery() {
     const [step, setStep] = useState(1)
     const [email, setEmail] = useState('')
-    const [code, setCode] = useState('')
+    const [code, setCode] = useState("Stryker was here!")
     const [senha, setSenha] = useState('')
     const [confirmarSenha, setConfirmarSenha] = useState('')

[Survived] BooleanLiteral
src/pages/Recovery.tsx:15:54
     const [senha, setSenha] = useState('')
     const [confirmarSenha, setConfirmarSenha] = useState('')
     
-    const [showPassword, setShowPassword] = useState(false)
+    const [showPassword, setShowPassword] = useState(true)
     const [showConfirmPassword, setShowConfirmPassword] = useState(false)
     

[Survived] BooleanLiteral
src/pages/Recovery.tsx:16:68
     const [confirmarSenha, setConfirmarSenha] = useState('')
     
     const [showPassword, setShowPassword] = useState(false)
-    const [showConfirmPassword, setShowConfirmPassword] = useState(false)
+    const [showConfirmPassword, setShowConfirmPassword] = useState(true)
     
     const [erro, setErro] = useState('')

[Survived] StringLiteral
src/pages/Recovery.tsx:18:38
     const [showPassword, setShowPassword] = useState(false)
     const [showConfirmPassword, setShowConfirmPassword] = useState(false)
     
-    const [erro, setErro] = useState('')
+    const [erro, setErro] = useState("Stryker was here!")
     const [sucesso, setSucesso] = useState('')
     const [loading, setLoading] = useState(false)

[Killed] BooleanLiteral
src/pages/Recovery.tsx:20:44
     
     const [erro, setErro] = useState('')
     const [sucesso, setSucesso] = useState('')
-    const [loading, setLoading] = useState(false)
+    const [loading, setLoading] = useState(true)
     const [isShaking, setIsShaking] = useState(false)
     
killedBy: Recovery Component - Unit Tests Submete e-mail e avança para Passo 2 com sucesso
statusReason: Unable to find an accessible element with the role "button" and name `/Continuar/i`

Here are the accessible roles:

  heading:

  Name "Governança de Pesquisa Acadêmica":
  <h1

[Survived] BooleanLiteral
src/pages/Recovery.tsx:21:48
     const [erro, setErro] = useState('')
     const [sucesso, setSucesso] = useState('')
     const [loading, setLoading] = useState(false)
-    const [isShaking, setIsShaking] = useState(false)
+    const [isShaking, setIsShaking] = useState(true)
     
     const navigate = useNavigate()

[Survived] BlockStatement
src/pages/Recovery.tsx:24:32
     const [isShaking, setIsShaking] = useState(false)
     
     const navigate = useNavigate()
-    const triggerShake = () => {
-        setIsShaking(true)
-        setTimeout(() => setIsShaking(false), 500)
-    }
+    const triggerShake = () => {}
 
     const handleRequestCode = async (e: React.FormEvent) => {

[Survived] BooleanLiteral
src/pages/Recovery.tsx:25:22
     
     const navigate = useNavigate()
     const triggerShake = () => {
-        setIsShaking(true)
+        setIsShaking(false)
         setTimeout(() => setIsShaking(false), 500)
     }

[Survived] ArrowFunction
src/pages/Recovery.tsx:26:20
     const navigate = useNavigate()
     const triggerShake = () => {
         setIsShaking(true)
-        setTimeout(() => setIsShaking(false), 500)
+        setTimeout(() => undefined, 500)
     }
 

[NoCoverage] BooleanLiteral
src/pages/Recovery.tsx:26:39
     const navigate = useNavigate()
     const triggerShake = () => {
         setIsShaking(true)
-        setTimeout(() => setIsShaking(false), 500)
+        setTimeout(() => setIsShaking(true), 500)
     }
 

[Killed] BlockStatement
src/pages/Recovery.tsx:29:61
         setTimeout(() => setIsShaking(false), 500)
     }
 
-    const handleRequestCode = async (e: React.FormEvent) => {
-        if (e) e.preventDefault()
-        setErro('')
-        setLoading(true)
-        
-        try {
-            const res = await requestPasswordRecovery(email)
-            if (res.sucesso) {
-                setSucesso(res.mensagem)
-                setStep(2)
-                setTimeout(() => setSucesso(''), 3000)
-            } else {
-                setErro(res.mensagem || 'Erro ao solicitar código')
-                triggerShake()
-            }
-        } catch {
-            setErro('Erro no servidor')
-            triggerShake()
-        } finally {
-            setLoading(false)
-        }
-    }
+    const handleRequestCode = async (e: React.FormEvent) => {}
 
     const handleVerifyCode = async (e: React.FormEvent) => {
killedBy: Recovery Component - Unit Tests Submete e-mail e avança para Passo 2 com sucesso
statusReason: expected "vi.fn()" to be called with arguments: [ 'teste@unb.br' ]

Number of calls: 0

[Survived] ConditionalExpression
src/pages/Recovery.tsx:30:13
     }
 
     const handleRequestCode = async (e: React.FormEvent) => {
-        if (e) e.preventDefault()
+        if (false) e.preventDefault()
         setErro('')
         setLoading(true)

[Survived] ConditionalExpression
src/pages/Recovery.tsx:30:13
     }
 
     const handleRequestCode = async (e: React.FormEvent) => {
-        if (e) e.preventDefault()
+        if (true) e.preventDefault()
         setErro('')
         setLoading(true)

[Survived] BooleanLiteral
src/pages/Recovery.tsx:32:20
     const handleRequestCode = async (e: React.FormEvent) => {
         if (e) e.preventDefault()
         setErro('')
-        setLoading(true)
+        setLoading(false)
         
         try {

[Killed] BlockStatement
src/pages/Recovery.tsx:34:13
         setErro('')
         setLoading(true)
         
-        try {
-            const res = await requestPasswordRecovery(email)
-            if (res.sucesso) {
-                setSucesso(res.mensagem)
-                setStep(2)
-                setTimeout(() => setSucesso(''), 3000)
-            } else {
-                setErro(res.mensagem || 'Erro ao solicitar código')
-                triggerShake()
-            }
-        } catch {
+        try {} catch {
             setErro('Erro no servidor')
             triggerShake()
killedBy: Recovery Component - Unit Tests Submete e-mail e avança para Passo 2 com sucesso
statusReason: expected "vi.fn()" to be called with arguments: [ 'teste@unb.br' ]

Number of calls: 0

[Killed] ConditionalExpression
src/pages/Recovery.tsx:36:17
         
         try {
             const res = await requestPasswordRecovery(email)
-            if (res.sucesso) {
+            if (false) {
                 setSucesso(res.mensagem)
                 setStep(2)
killedBy: Recovery Component - Unit Tests Submete e-mail e avança para Passo 2 com sucesso
statusReason: Unable to find an element with the text: Verificação de Código. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      animate="[object Object]"
      class="_loginWrapper_d61aea"

[Killed] BlockStatement
src/pages/Recovery.tsx:36:30
         
         try {
             const res = await requestPasswordRecovery(email)
-            if (res.sucesso) {
-                setSucesso(res.mensagem)
-                setStep(2)
-                setTimeout(() => setSucesso(''), 3000)
-            } else {
+            if (res.sucesso) {} else {
                 setErro(res.mensagem || 'Erro ao solicitar código')
                 triggerShake()
killedBy: Recovery Component - Unit Tests Submete e-mail e avança para Passo 2 com sucesso
statusReason: Unable to find an element with the text: Verificação de Código. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      animate="[object Object]"
      class="_loginWrapper_d61aea"

[Survived] ArrowFunction
src/pages/Recovery.tsx:39:28
             if (res.sucesso) {
                 setSucesso(res.mensagem)
                 setStep(2)
-                setTimeout(() => setSucesso(''), 3000)
+                setTimeout(() => undefined, 3000)
             } else {
                 setErro(res.mensagem || 'Erro ao solicitar código')

[Killed] BlockStatement
src/pages/Recovery.tsx:40:20
                 setSucesso(res.mensagem)
                 setStep(2)
                 setTimeout(() => setSucesso(''), 3000)
-            } else {
-                setErro(res.mensagem || 'Erro ao solicitar código')
-                triggerShake()
-            }
+            } else {}
         } catch {
             setErro('Erro no servidor')
killedBy: Recovery Component - Unit Tests Exibe erro se a API retornar falha no Passo 1
statusReason: Unable to find an element with the text: /E-mail não encontrado/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      animate="[object Object]"
      class="_loginWrapper_d61aea"

[Killed] ConditionalExpression
src/pages/Recovery.tsx:41:25
                 setStep(2)
                 setTimeout(() => setSucesso(''), 3000)
             } else {
-                setErro(res.mensagem || 'Erro ao solicitar código')
+                setErro(true)
                 triggerShake()
             }
killedBy: Recovery Component - Unit Tests Exibe erro se a API retornar falha no Passo 1
statusReason: Unable to find an element with the text: /E-mail não encontrado/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      animate="[object Object]"
      class="_loginWrapper_d61aea"

[Killed] ConditionalExpression
src/pages/Recovery.tsx:41:25
                 setStep(2)
                 setTimeout(() => setSucesso(''), 3000)
             } else {
-                setErro(res.mensagem || 'Erro ao solicitar código')
+                setErro(false)
                 triggerShake()
             }
killedBy: Recovery Component - Unit Tests Exibe erro se a API retornar falha no Passo 1
statusReason: Unable to find an element with the text: /E-mail não encontrado/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      animate="[object Object]"
      class="_loginWrapper_d61aea"

[NoCoverage] BlockStatement
src/pages/Recovery.tsx:44:17
                 setErro(res.mensagem || 'Erro ao solicitar código')
                 triggerShake()
             }
-        } catch {
-            setErro('Erro no servidor')
-            triggerShake()
-        } finally {
+        } catch {} finally {
             setLoading(false)
         }

[NoCoverage] StringLiteral
src/pages/Recovery.tsx:45:21
                 triggerShake()
             }
         } catch {
-            setErro('Erro no servidor')
+            setErro("")
             triggerShake()
         } finally {

[Survived] BlockStatement
src/pages/Recovery.tsx:47:19
         } catch {
             setErro('Erro no servidor')
             triggerShake()
-        } finally {
-            setLoading(false)
-        }
+        } finally {}
     }
 

[Survived] BooleanLiteral
src/pages/Recovery.tsx:48:24
             setErro('Erro no servidor')
             triggerShake()
         } finally {
-            setLoading(false)
+            setLoading(true)
         }
     }

[NoCoverage] BlockStatement
src/pages/Recovery.tsx:52:60
         }
     }
 
-    const handleVerifyCode = async (e: React.FormEvent) => {
-        if (e) e.preventDefault()
-        setErro('')
-        setLoading(true)
-        
-        try {
-            const res = await verifyRecoveryCode(email, code)
-            if (res.sucesso) {
-                setSucesso(res.mensagem)
-                setStep(3)
-                setTimeout(() => setSucesso(''), 3000)
-            } else {
-                setErro(res.mensagem || 'Código inválido')
-                triggerShake()
-            }
-        } catch {
-            setErro('Erro no servidor')
-            triggerShake()
-        } finally {
-            setLoading(false)
-        }
-    }
+    const handleVerifyCode = async (e: React.FormEvent) => {}
 
     const handleResetPassword = async (e: React.FormEvent) => {

[NoCoverage] ConditionalExpression
src/pages/Recovery.tsx:53:13
     }
 
     const handleVerifyCode = async (e: React.FormEvent) => {
-        if (e) e.preventDefault()
+        if (false) e.preventDefault()
         setErro('')
         setLoading(true)

[NoCoverage] ConditionalExpression
src/pages/Recovery.tsx:53:13
     }
 
     const handleVerifyCode = async (e: React.FormEvent) => {
-        if (e) e.preventDefault()
+        if (true) e.preventDefault()
         setErro('')
         setLoading(true)

[NoCoverage] BlockStatement
src/pages/Recovery.tsx:57:13
         setErro('')
         setLoading(true)
         
-        try {
-            const res = await verifyRecoveryCode(email, code)
-            if (res.sucesso) {
-                setSucesso(res.mensagem)
-                setStep(3)
-                setTimeout(() => setSucesso(''), 3000)
-            } else {
-                setErro(res.mensagem || 'Código inválido')
-                triggerShake()
-            }
-        } catch {
+        try {} catch {
             setErro('Erro no servidor')
             triggerShake()

[NoCoverage] ConditionalExpression
src/pages/Recovery.tsx:59:17
         
         try {
             const res = await verifyRecoveryCode(email, code)
-            if (res.sucesso) {
+            if (true) {
                 setSucesso(res.mensagem)
                 setStep(3)

[NoCoverage] ConditionalExpression
src/pages/Recovery.tsx:59:17
         
         try {
             const res = await verifyRecoveryCode(email, code)
-            if (res.sucesso) {
+            if (false) {
                 setSucesso(res.mensagem)
                 setStep(3)

[NoCoverage] ArrowFunction
src/pages/Recovery.tsx:62:28
             if (res.sucesso) {
                 setSucesso(res.mensagem)
                 setStep(3)
-                setTimeout(() => setSucesso(''), 3000)
+                setTimeout(() => undefined, 3000)
             } else {
                 setErro(res.mensagem || 'Código inválido')

[NoCoverage] BlockStatement
src/pages/Recovery.tsx:63:20
                 setSucesso(res.mensagem)
                 setStep(3)
                 setTimeout(() => setSucesso(''), 3000)
-            } else {
-                setErro(res.mensagem || 'Código inválido')
-                triggerShake()
-            }
+            } else {}
         } catch {
             setErro('Erro no servidor')

[NoCoverage] ConditionalExpression
src/pages/Recovery.tsx:64:25
                 setStep(3)
                 setTimeout(() => setSucesso(''), 3000)
             } else {
-                setErro(res.mensagem || 'Código inválido')
+                setErro(true)
                 triggerShake()
             }

[NoCoverage] ConditionalExpression
src/pages/Recovery.tsx:64:25
                 setStep(3)
                 setTimeout(() => setSucesso(''), 3000)
             } else {
-                setErro(res.mensagem || 'Código inválido')
+                setErro(false)
                 triggerShake()
             }

[NoCoverage] ConditionalExpression
src/pages/Recovery.tsx:76:13
     }
 
     const handleResetPassword = async (e: React.FormEvent) => {
-        if (e) e.preventDefault()
+        if (true) e.preventDefault()
         setErro('')
         

[NoCoverage] ConditionalExpression
src/pages/Recovery.tsx:76:13
     }
 
     const handleResetPassword = async (e: React.FormEvent) => {
-        if (e) e.preventDefault()
+        if (false) e.preventDefault()
         setErro('')
         

[NoCoverage] StringLiteral
src/pages/Recovery.tsx:77:17
 
     const handleResetPassword = async (e: React.FormEvent) => {
         if (e) e.preventDefault()
-        setErro('')
+        setErro("Stryker was here!")
         
         if (senha !== confirmarSenha) {

[NoCoverage] ConditionalExpression
src/pages/Recovery.tsx:79:13
         if (e) e.preventDefault()
         setErro('')
         
-        if (senha !== confirmarSenha) {
+        if (true) {
             setErro('As senhas não coincidem.')
             triggerShake()

[NoCoverage] BooleanLiteral
src/pages/Recovery.tsx:85:20
             return
         }
 
-        setLoading(true)
+        setLoading(false)
         try {
             const res = await resetPassword(email, code, senha)

[NoCoverage] BlockStatement
src/pages/Recovery.tsx:86:13
         }
 
         setLoading(true)
-        try {
-            const res = await resetPassword(email, code, senha)
-            if (res.sucesso) {
-                setSucesso('Senha redefinida com sucesso! Redirecionando...')
-                setTimeout(() => navigate('/login'), 2000)
-            } else {
-                setErro(res.mensagem || 'Erro ao redefinir senha')
-                triggerShake()
-            }
-        } catch {
+        try {} catch {
             setErro('Erro no servidor')
             triggerShake()

[NoCoverage] ConditionalExpression
src/pages/Recovery.tsx:88:17
         setLoading(true)
         try {
             const res = await resetPassword(email, code, senha)
-            if (res.sucesso) {
+            if (true) {
                 setSucesso('Senha redefinida com sucesso! Redirecionando...')
                 setTimeout(() => navigate('/login'), 2000)

[NoCoverage] BlockStatement
src/pages/Recovery.tsx:88:30
         setLoading(true)
         try {
             const res = await resetPassword(email, code, senha)
-            if (res.sucesso) {
-                setSucesso('Senha redefinida com sucesso! Redirecionando...')
-                setTimeout(() => navigate('/login'), 2000)
-            } else {
+            if (res.sucesso) {} else {
                 setErro(res.mensagem || 'Erro ao redefinir senha')
                 triggerShake()

[NoCoverage] ArrowFunction
src/pages/Recovery.tsx:90:28
             const res = await resetPassword(email, code, senha)
             if (res.sucesso) {
                 setSucesso('Senha redefinida com sucesso! Redirecionando...')
-                setTimeout(() => navigate('/login'), 2000)
+                setTimeout(() => undefined, 2000)
             } else {
                 setErro(res.mensagem || 'Erro ao redefinir senha')

[NoCoverage] StringLiteral
src/pages/Recovery.tsx:90:43
             const res = await resetPassword(email, code, senha)
             if (res.sucesso) {
                 setSucesso('Senha redefinida com sucesso! Redirecionando...')
-                setTimeout(() => navigate('/login'), 2000)
+                setTimeout(() => navigate(""), 2000)
             } else {
                 setErro(res.mensagem || 'Erro ao redefinir senha')

[NoCoverage] BlockStatement
src/pages/Recovery.tsx:91:20
             if (res.sucesso) {
                 setSucesso('Senha redefinida com sucesso! Redirecionando...')
                 setTimeout(() => navigate('/login'), 2000)
-            } else {
-                setErro(res.mensagem || 'Erro ao redefinir senha')
-                triggerShake()
-            }
+            } else {}
         } catch {
             setErro('Erro no servidor')

[NoCoverage] LogicalOperator
src/pages/Recovery.tsx:92:25
                 setSucesso('Senha redefinida com sucesso! Redirecionando...')
                 setTimeout(() => navigate('/login'), 2000)
             } else {
-                setErro(res.mensagem || 'Erro ao redefinir senha')
+                setErro(res.mensagem && 'Erro ao redefinir senha')
                 triggerShake()
             }

[NoCoverage] ConditionalExpression
src/pages/Recovery.tsx:92:25
                 setSucesso('Senha redefinida com sucesso! Redirecionando...')
                 setTimeout(() => navigate('/login'), 2000)
             } else {
-                setErro(res.mensagem || 'Erro ao redefinir senha')
+                setErro(false)
                 triggerShake()
             }

[Survived] ObjectLiteral
src/pages/Recovery.tsx:104:17
     }
 
     const formVariants = {
-        hidden: { opacity: 0, x: 20 },
+        hidden: {},
         visible: { opacity: 1, x: 0, transition: { staggerChildren: 0.05, delayChildren: 0.1 } }
     }

[Survived] ObjectLiteral
src/pages/Recovery.tsx:113:27
         visible: { opacity: 1, y: 0 }
     }
 
-    const shakeVariants = {
-        shake: { x: [-10, 10, -10, 10, -5, 5, 0], transition: { duration: 0.4 } }
-    }
+    const shakeVariants = {}
 
     const title = step === 1 ? "Esqueceu a senha?" : step === 2 ? "Verificação de Código" : "Nova Senha"

[Survived] UnaryOperator
src/pages/Recovery.tsx:114:31
     }
 
     const shakeVariants = {
-        shake: { x: [-10, 10, -10, 10, -5, 5, 0], transition: { duration: 0.4 } }
+        shake: { x: [-10, 10, +10, 10, -5, 5, 0], transition: { duration: 0.4 } }
     }
 

[Survived] UnaryOperator
src/pages/Recovery.tsx:114:40
     }
 
     const shakeVariants = {
-        shake: { x: [-10, 10, -10, 10, -5, 5, 0], transition: { duration: 0.4 } }
+        shake: { x: [-10, 10, -10, 10, +5, 5, 0], transition: { duration: 0.4 } }
     }
 

[Killed] ConditionalExpression
src/pages/Recovery.tsx:117:54
         shake: { x: [-10, 10, -10, 10, -5, 5, 0], transition: { duration: 0.4 } }
     }
 
-    const title = step === 1 ? "Esqueceu a senha?" : step === 2 ? "Verificação de Código" : "Nova Senha"
+    const title = step === 1 ? "Esqueceu a senha?" : false ? "Verificação de Código" : "Nova Senha"
     const subtitle = step === 1 ? "Informe seu e-mail para receber um código de segurança." : step === 2 ? `Enviamos um código de 6 dígitos para ${email}` : "Crie uma nova senha forte para sua conta."
 
killedBy: Recovery Component - Unit Tests Submete e-mail e avança para Passo 2 com sucesso
statusReason: Unable to find an element with the text: Verificação de Código. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      animate="[object Object]"
      class="_loginWrapper_d61aea"

[Killed] EqualityOperator
src/pages/Recovery.tsx:117:19
         shake: { x: [-10, 10, -10, 10, -5, 5, 0], transition: { duration: 0.4 } }
     }
 
-    const title = step === 1 ? "Esqueceu a senha?" : step === 2 ? "Verificação de Código" : "Nova Senha"
+    const title = step !== 1 ? "Esqueceu a senha?" : step === 2 ? "Verificação de Código" : "Nova Senha"
     const subtitle = step === 1 ? "Informe seu e-mail para receber um código de segurança." : step === 2 ? `Enviamos um código de 6 dígitos para ${email}` : "Crie uma nova senha forte para sua conta."
 
killedBy: Recovery Component - Unit Tests Renderiza o Passo 1 inicialmente e pede e-mail institucional
statusReason: Unable to find an element with the text: Esqueceu a senha?. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      animate="[object Object]"
      class="_loginWrapper_d61aea"

[Survived] ConditionalExpression
src/pages/Recovery.tsx:118:22
     }
 
     const title = step === 1 ? "Esqueceu a senha?" : step === 2 ? "Verificação de Código" : "Nova Senha"
-    const subtitle = step === 1 ? "Informe seu e-mail para receber um código de segurança." : step === 2 ? `Enviamos um código de 6 dígitos para ${email}` : "Crie uma nova senha forte para sua conta."
+    const subtitle = true ? "Informe seu e-mail para receber um código de segurança." : step === 2 ? `Enviamos um código de 6 dígitos para ${email}` : "Crie uma nova senha forte para sua conta."
 
     return (

[Survived] ConditionalExpression
src/pages/Recovery.tsx:118:22
     }
 
     const title = step === 1 ? "Esqueceu a senha?" : step === 2 ? "Verificação de Código" : "Nova Senha"
-    const subtitle = step === 1 ? "Informe seu e-mail para receber um código de segurança." : step === 2 ? `Enviamos um código de 6 dígitos para ${email}` : "Crie uma nova senha forte para sua conta."
+    const subtitle = false ? "Informe seu e-mail para receber um código de segurança." : step === 2 ? `Enviamos um código de 6 dígitos para ${email}` : "Crie uma nova senha forte para sua conta."
 
     return (

[Killed] EqualityOperator
src/pages/Recovery.tsx:124:35
         <AuthLayout title={title} subtitle={subtitle}>
             <div style={{width: '100%'}} key={step}>
                 <form 
-                        onSubmit={step === 1 ? handleRequestCode : step === 2 ? handleVerifyCode : handleResetPassword}
+                        onSubmit={step !== 1 ? handleRequestCode : step === 2 ? handleVerifyCode : handleResetPassword}
                         onInvalid={(e) => {
                             e.preventDefault(); 
killedBy: Recovery Component - Unit Tests Submete e-mail e avança para Passo 2 com sucesso
statusReason: expected "vi.fn()" to be called with arguments: [ 'teste@unb.br' ]

Number of calls: 0

[Killed] ConditionalExpression
src/pages/Recovery.tsx:124:35
         <AuthLayout title={title} subtitle={subtitle}>
             <div style={{width: '100%'}} key={step}>
                 <form 
-                        onSubmit={step === 1 ? handleRequestCode : step === 2 ? handleVerifyCode : handleResetPassword}
+                        onSubmit={false ? handleRequestCode : step === 2 ? handleVerifyCode : handleResetPassword}
                         onInvalid={(e) => {
                             e.preventDefault(); 
killedBy: Recovery Component - Unit Tests Submete e-mail e avança para Passo 2 com sucesso
statusReason: expected "vi.fn()" to be called with arguments: [ 'teste@unb.br' ]

Number of calls: 0

[NoCoverage] BlockStatement
src/pages/Recovery.tsx:125:43
             <div style={{width: '100%'}} key={step}>
                 <form 
                         onSubmit={step === 1 ? handleRequestCode : step === 2 ? handleVerifyCode : handleResetPassword}
-                        onInvalid={(e) => {
-                            e.preventDefault(); 
-                            triggerShake();
-                        }}
+                        onInvalid={(e) => {}}
                     >
                         {erro && (

[Killed] ConditionalExpression
src/pages/Recovery.tsx:130:26
                             triggerShake();
                         }}
                     >
-                        {erro && (
-                            <motion.div initial={{ opacity: 0, height: 0 }} animate={{ opacity: 1, height: 'auto' }} className={styles.errorAlert}>
-                                <span style={{ marginRight: '8px' }}>⚠️</span> {erro}
-                            </motion.div>
-                        )}
+                        {true}
                         {sucesso && (
killedBy: Recovery Component - Unit Tests Exibe erro se a API retornar falha no Passo 1
statusReason: Unable to find an element with the text: /E-mail não encontrado/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      animate="[object Object]"
      class="_loginWrapper_d61aea"

[Killed] ConditionalExpression
src/pages/Recovery.tsx:130:26
                             triggerShake();
                         }}
                     >
-                        {erro && (
-                            <motion.div initial={{ opacity: 0, height: 0 }} animate={{ opacity: 1, height: 'auto' }} className={styles.errorAlert}>
-                                <span style={{ marginRight: '8px' }}>⚠️</span> {erro}
-                            </motion.div>
-                        )}
+                        {false}
                         {sucesso && (
killedBy: Recovery Component - Unit Tests Exibe erro se a API retornar falha no Passo 1
statusReason: Unable to find an element with the text: /E-mail não encontrado/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      animate="[object Object]"
      class="_loginWrapper_d61aea"

[Survived] StringLiteral
src/pages/Recovery.tsx:131:108
                         }}
                     >
                         {erro && (
-                            <motion.div initial={{ opacity: 0, height: 0 }} animate={{ opacity: 1, height: 'auto' }} className={styles.errorAlert}>
+                            <motion.div initial={{ opacity: 0, height: 0 }} animate={{ opacity: 1, height: "" }} className={styles.errorAlert}>
                                 <span style={{ marginRight: '8px' }}>⚠️</span> {erro}
                             </motion.div>
