[Survived] ObjectLiteral
src/pages/Recovery.tsx:131:50
                         }}
                     >
                         {erro && (
-                            <motion.div initial={{ opacity: 0, height: 0 }} animate={{ opacity: 1, height: 'auto' }} className={styles.errorAlert}>
+                            <motion.div initial={{}} animate={{ opacity: 1, height: 'auto' }} className={styles.errorAlert}>
                                 <span style={{ marginRight: '8px' }}>⚠️</span> {erro}
                             </motion.div>

[Survived] ObjectLiteral
src/pages/Recovery.tsx:137:46
                         )}
                         {sucesso && (
-                                <span style={{ marginRight: '8px' }}>✅</span> {sucesso}
+                                <span style={{}}>✅</span> {sucesso}
                             </motion.div>
                         )}

[Killed] EqualityOperator
src/pages/Recovery.tsx:141:26
                             </motion.div>
                         )}
 
-                        {step === 1 && (
+                        {step !== 1 && (
                             <motion.div variants={itemVariants} className={styles.inputGroup}>
                                 <div className={styles.labelRow}>
killedBy: Recovery Component - Unit Tests Renderiza o Passo 1 inicialmente e pede e-mail institucional
statusReason: Unable to find an element with the placeholder text of: seu.nome@universidade.br

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      animate="[object Object]"
      class="_loginWrapper_d61aea"

[NoCoverage] StringLiteral
src/pages/Recovery.tsx:188:75
                                     <div className={styles.inputWrapper}>
                                         <input 
                                             className={styles.inputField} 
-                                            type={showPassword ? "text" : "password"} 
+                                            type={showPassword ? "text" : ""} 
                                             value={senha} 
                                             onChange={(e) => setSenha(e.target.value)} 

[NoCoverage] StringLiteral
src/pages/Recovery.tsx:221:82
                                     <div className={styles.inputWrapper}>
                                         <input 
                                             className={styles.inputField} 
-                                            type={showConfirmPassword ? "text" : "password"} 
+                                            type={showConfirmPassword ? "text" : ""} 
                                             value={confirmarSenha} 
                                             onChange={(e) => setConfirmarSenha(e.target.value)} 

[Survived] ObjectLiteral
src/pages/Recovery.tsx:253:41
                         <motion.button 
                             variants={Object.assign({}, itemVariants, shakeVariants)}
                             animate={isShaking ? "shake" : "visible"}
-                            whileHover={{ scale: 1.02 }}
+                            whileHover={{}}
                             whileTap={{ scale: 0.98 }}
                             type="submit" 

[Killed] EqualityOperator
src/pages/Recovery.tsx:259:60
                             className={styles.submitBtn}
                             disabled={loading}
                         >
-                            {loading ? "Processando..." : (step === 3 ? "Redefinir Senha" : "Continuar")} <span>→</span>
+                            {loading ? "Processando..." : (step !== 3 ? "Redefinir Senha" : "Continuar")} <span>→</span>
                         </motion.button>
                     </form>
killedBy: Recovery Component - Unit Tests Submete e-mail e avança para Passo 2 com sucesso
statusReason: Unable to find an accessible element with the role "button" and name `/Continuar/i`

Here are the accessible roles:

  heading:

  Name "Governança de Pesquisa Acadêmica":
  <h1

[Killed] ConditionalExpression
src/pages/Recovery.tsx:259:60
                             className={styles.submitBtn}
                             disabled={loading}
                         >
-                            {loading ? "Processando..." : (step === 3 ? "Redefinir Senha" : "Continuar")} <span>→</span>
+                            {loading ? "Processando..." : (true ? "Redefinir Senha" : "Continuar")} <span>→</span>
                         </motion.button>
                     </form>
killedBy: Recovery Component - Unit Tests Submete e-mail e avança para Passo 2 com sucesso
statusReason: Unable to find an accessible element with the role "button" and name `/Continuar/i`

Here are the accessible roles:

  heading:

  Name "Governança de Pesquisa Acadêmica":
  <h1

[Survived] ObjectLiteral
src/pages/Recovery.tsx:263:54
                         </motion.button>
                     </form>
 
-            <motion.p variants={itemVariants} style={{ textAlign: 'center', margin: '1.5rem 0 0 0', fontSize: '0.875rem' }}>
+            <motion.p variants={itemVariants} style={{}}>
                 Lembrou a senha? <Link to="/login" className={styles.forgotLink}>Voltar para o Login</Link>
             </motion.p>

[Survived] StringLiteral
src/pages/Recovery.tsx:263:85
                         </motion.button>
                     </form>
 
-            <motion.p variants={itemVariants} style={{ textAlign: 'center', margin: '1.5rem 0 0 0', fontSize: '0.875rem' }}>
+            <motion.p variants={itemVariants} style={{ textAlign: 'center', margin: "", fontSize: '0.875rem' }}>
                 Lembrou a senha? <Link to="/login" className={styles.forgotLink}>Voltar para o Login</Link>
             </motion.p>
