[NoCoverage] StringLiteral
src/pages/register.tsx:9:38
 import styles from "./auth.module.css"
 
 function Register() {
-    const [nome, setNome] = useState('')
+    const [nome, setNome] = useState("Stryker was here!")
     const [email, setEmail] = useState('')
     const [senha, setSenha] = useState('')

[NoCoverage] StringLiteral
src/pages/register.tsx:11:40
 function Register() {
     const [nome, setNome] = useState('')
     const [email, setEmail] = useState('')
-    const [senha, setSenha] = useState('')
+    const [senha, setSenha] = useState("Stryker was here!")
     const [confirmarSenha, setConfirmarSenha] = useState('')
     const [erro, setErro] = useState('')

[NoCoverage] StringLiteral
src/pages/register.tsx:12:58
     const [nome, setNome] = useState('')
     const [email, setEmail] = useState('')
     const [senha, setSenha] = useState('')
-    const [confirmarSenha, setConfirmarSenha] = useState('')
+    const [confirmarSenha, setConfirmarSenha] = useState("Stryker was here!")
     const [erro, setErro] = useState('')
     const [showPassword, setShowPassword] = useState(false)

[NoCoverage] StringLiteral
src/pages/register.tsx:13:38
     const [email, setEmail] = useState('')
     const [senha, setSenha] = useState('')
     const [confirmarSenha, setConfirmarSenha] = useState('')
-    const [erro, setErro] = useState('')
+    const [erro, setErro] = useState("Stryker was here!")
     const [showPassword, setShowPassword] = useState(false)
     const [showConfirmPassword, setShowConfirmPassword] = useState(false)

[NoCoverage] BooleanLiteral
src/pages/register.tsx:14:54
     const [senha, setSenha] = useState('')
     const [confirmarSenha, setConfirmarSenha] = useState('')
     const [erro, setErro] = useState('')
-    const [showPassword, setShowPassword] = useState(false)
+    const [showPassword, setShowPassword] = useState(true)
     const [showConfirmPassword, setShowConfirmPassword] = useState(false)
     const [isShaking, setIsShaking] = useState(false)

[NoCoverage] BooleanLiteral
src/pages/register.tsx:16:48
     const [erro, setErro] = useState('')
     const [showPassword, setShowPassword] = useState(false)
     const [showConfirmPassword, setShowConfirmPassword] = useState(false)
-    const [isShaking, setIsShaking] = useState(false)
+    const [isShaking, setIsShaking] = useState(true)
     
     const navigate = useNavigate()

[NoCoverage] BlockStatement
src/pages/register.tsx:20:56
     
     const navigate = useNavigate()
     
-    const handleSubmit = async (e: React.FormEvent) => {
-        if (e) e.preventDefault()
-        setErro('')
-        if (senha !== confirmarSenha) {
-            setErro('As senhas não coincidem. Por favor tente novamente')
-            setIsShaking(true)
-            setTimeout(() => setIsShaking(false), 500)
-            return
-        }
-        try {
-            const resultado = await register(nome, email, senha)
-            if (resultado.sucesso === true) {
-                navigate('/login')
-            } else {
-                setErro(resultado.mensagem)
-            }
-        } catch (erro) {
-            setErro(erro.message)
-        }
-    }
+    const handleSubmit = async (e: React.FormEvent) => {}
 
     const formVariants = {

[NoCoverage] ConditionalExpression
src/pages/register.tsx:21:13
     const navigate = useNavigate()
     
     const handleSubmit = async (e: React.FormEvent) => {
-        if (e) e.preventDefault()
+        if (false) e.preventDefault()
         setErro('')
         if (senha !== confirmarSenha) {

[NoCoverage] ConditionalExpression
src/pages/register.tsx:21:13
     const navigate = useNavigate()
     
     const handleSubmit = async (e: React.FormEvent) => {
-        if (e) e.preventDefault()
+        if (true) e.preventDefault()
         setErro('')
         if (senha !== confirmarSenha) {

[NoCoverage] BlockStatement
src/pages/register.tsx:23:39
     const handleSubmit = async (e: React.FormEvent) => {
         if (e) e.preventDefault()
         setErro('')
-        if (senha !== confirmarSenha) {
-            setErro('As senhas não coincidem. Por favor tente novamente')
-            setIsShaking(true)
-            setTimeout(() => setIsShaking(false), 500)
-            return
-        }
+        if (senha !== confirmarSenha) {}
         try {
             const resultado = await register(nome, email, senha)

[NoCoverage] ConditionalExpression
src/pages/register.tsx:23:13
     const handleSubmit = async (e: React.FormEvent) => {
         if (e) e.preventDefault()
         setErro('')
-        if (senha !== confirmarSenha) {
+        if (false) {
             setErro('As senhas não coincidem. Por favor tente novamente')
             setIsShaking(true)

[NoCoverage] BooleanLiteral
src/pages/register.tsx:25:26
         setErro('')
         if (senha !== confirmarSenha) {
             setErro('As senhas não coincidem. Por favor tente novamente')
-            setIsShaking(true)
+            setIsShaking(false)
             setTimeout(() => setIsShaking(false), 500)
             return

[NoCoverage] BlockStatement
src/pages/register.tsx:29:13
             setTimeout(() => setIsShaking(false), 500)
             return
         }
-        try {
-            const resultado = await register(nome, email, senha)
-            if (resultado.sucesso === true) {
-                navigate('/login')
-            } else {
-                setErro(resultado.mensagem)
-            }
-        } catch (erro) {
+        try {} catch (erro) {
             setErro(erro.message)
         }

[NoCoverage] BooleanLiteral
src/pages/register.tsx:31:39
         }
         try {
             const resultado = await register(nome, email, senha)
-            if (resultado.sucesso === true) {
+            if (resultado.sucesso === false) {
                 navigate('/login')
             } else {

[NoCoverage] BlockStatement
src/pages/register.tsx:31:45
         }
         try {
             const resultado = await register(nome, email, senha)
-            if (resultado.sucesso === true) {
-                navigate('/login')
-            } else {
+            if (resultado.sucesso === true) {} else {
                 setErro(resultado.mensagem)
             }

[NoCoverage] BlockStatement
src/pages/register.tsx:33:20
             const resultado = await register(nome, email, senha)
             if (resultado.sucesso === true) {
                 navigate('/login')
-            } else {
-                setErro(resultado.mensagem)
-            }
+            } else {}
         } catch (erro) {
             setErro(erro.message)

[NoCoverage] BlockStatement
src/pages/register.tsx:36:24
             } else {
                 setErro(resultado.mensagem)
             }
-        } catch (erro) {
-            setErro(erro.message)
-        }
+        } catch (erro) {}
     }
 

[NoCoverage] ObjectLiteral
src/pages/register.tsx:41:26
         }
     }
 
-    const formVariants = {
-        hidden: { opacity: 0, x: 20 },
-        visible: { opacity: 1, x: 0, transition: { staggerChildren: 0.05, delayChildren: 0.1 } }
-    }
+    const formVariants = {}
 
     const itemVariants = {

[NoCoverage] ObjectLiteral
src/pages/register.tsx:43:18
 
     const formVariants = {
         hidden: { opacity: 0, x: 20 },
-        visible: { opacity: 1, x: 0, transition: { staggerChildren: 0.05, delayChildren: 0.1 } }
+        visible: {}
     }
 

[NoCoverage] BlockStatement
src/pages/register.tsx:59:43
         <AuthLayout title="Crie sua conta" subtitle="Junte-se à principal plataforma de governança acadêmica.">
             <form 
                         onSubmit={handleSubmit}
-                        onInvalid={(e) => {
-                            e.preventDefault(); 
-                            setIsShaking(true);
-                            setTimeout(() => setIsShaking(false), 500);
-                        }}
+                        onInvalid={(e) => {}}
                     >
                         {erro && (

[NoCoverage] ObjectLiteral
src/pages/register.tsx:67:42
                     >
                         {erro && (
                             <motion.div 
-                                initial={{ opacity: 0, height: 0 }} 
+                                initial={{}} 
                                 animate={{ opacity: 1, height: 'auto' }} 
                                 className={styles.errorAlert}

[NoCoverage] ObjectLiteral
src/pages/register.tsx:71:46
                                 animate={{ opacity: 1, height: 'auto' }} 
                                 className={styles.errorAlert}
                             >
-                                <span style={{ marginRight: '8px' }}>⚠️</span> 
+                                <span style={{}}>⚠️</span> 
                                 {erro}
                             </motion.div>

[NoCoverage] StringLiteral
src/pages/register.tsx:118:62
                                 <div className={styles.inputWrapper}>
                                     <input 
                                         className={styles.inputField} 
-                                        type={showPassword ? "text" : "password"} 
+                                        type={showPassword ? "" : "password"} 
                                         value={senha} 
                                         onChange={(e) => setSenha(e.target.value)} 

[NoCoverage] StringLiteral
src/pages/register.tsx:182:121
                             </motion.div>
                         </div>
                         
-                        <motion.p variants={itemVariants} style={{ fontSize: '0.7rem', color: 'var(--text)', marginTop: '-0.5rem', marginBottom: '1rem' }}>
+                        <motion.p variants={itemVariants} style={{ fontSize: '0.7rem', color: 'var(--text)', marginTop: "", marginBottom: '1rem' }}>
                             Sua senha deve ter de 8-10 caracteres, contendo pelo menos um carácter especial, letra maiúscula e número.
                         </motion.p>

[NoCoverage] StringLiteral
src/pages/register.tsx:188:60
 
                         <motion.button 
                             variants={Object.assign({}, itemVariants, shakeVariants)}
-                            animate={isShaking ? "shake" : "visible"}
+                            animate={isShaking ? "shake" : ""}
                             whileHover={{ scale: 1.02 }}
                             whileTap={{ scale: 0.98 }}

[NoCoverage] StringLiteral
src/pages/register.tsx:198:111
                         </motion.button>
                     </form>
 
-            <motion.p variants={itemVariants} style={{ textAlign: 'center', margin: '1.5rem 0 0 0', fontSize: '0.875rem' }}>
+            <motion.p variants={itemVariants} style={{ textAlign: 'center', margin: '1.5rem 0 0 0', fontSize: "" }}>
                 Já tem uma conta? <Link to="/login" className={styles.forgotLink}>Faça login</Link>
             </motion.p>
