[NoCoverage] ConditionalExpression
src/pages/settings.tsx:11:22
     const [reviewEmails, setReviewEmails] = useState(true);
     const [strictLgpd, setStrictLgpd] = useState(true);
 
-    const userName = user?.name || "Usuário";
+    const userName = true;
     const userEmail = user?.email || "usuario@edtech.com";
     const userInitials = userName.split(' ').map((n: string) => n[0]).join('').substring(0, 2).toUpperCase();

[NoCoverage] LogicalOperator
src/pages/settings.tsx:11:22
     const [reviewEmails, setReviewEmails] = useState(true);
     const [strictLgpd, setStrictLgpd] = useState(true);
 
-    const userName = user?.name || "Usuário";
+    const userName = user?.name && "Usuário";
     const userEmail = user?.email || "usuario@edtech.com";
     const userInitials = userName.split(' ').map((n: string) => n[0]).join('').substring(0, 2).toUpperCase();

[NoCoverage] ConditionalExpression
src/pages/settings.tsx:12:23
     const [strictLgpd, setStrictLgpd] = useState(true);
 
     const userName = user?.name || "Usuário";
-    const userEmail = user?.email || "usuario@edtech.com";
+    const userEmail = true;
     const userInitials = userName.split(' ').map((n: string) => n[0]).join('').substring(0, 2).toUpperCase();
 

[NoCoverage] OptionalChaining
src/pages/settings.tsx:12:23
     const [strictLgpd, setStrictLgpd] = useState(true);
 
     const userName = user?.name || "Usuário";
-    const userEmail = user?.email || "usuario@edtech.com";
+    const userEmail = user.email || "usuario@edtech.com";
     const userInitials = userName.split(' ').map((n: string) => n[0]).join('').substring(0, 2).toUpperCase();
 

[NoCoverage] ArrowFunction
src/pages/settings.tsx:13:50
 
     const userName = user?.name || "Usuário";
     const userEmail = user?.email || "usuario@edtech.com";
-    const userInitials = userName.split(' ').map((n: string) => n[0]).join('').substring(0, 2).toUpperCase();
+    const userInitials = userName.split(' ').map(() => undefined).join('').substring(0, 2).toUpperCase();
 
     return (

[NoCoverage] MethodExpression
src/pages/settings.tsx:13:26
 
     const userName = user?.name || "Usuário";
     const userEmail = user?.email || "usuario@edtech.com";
-    const userInitials = userName.split(' ').map((n: string) => n[0]).join('').substring(0, 2).toUpperCase();
+    const userInitials = userName.split(' ').map((n: string) => n[0]).join('').toUpperCase();
 
     return (

[NoCoverage] ArrowFunction
src/pages/settings.tsx:52:89
                         </div>
                         <div className="settings-item-action">
                             <label className="ed-switch">
-                                <input type="checkbox" checked={reviewEmails} onChange={(e) => setReviewEmails(e.target.checked)} />
+                                <input type="checkbox" checked={reviewEmails} onChange={() => undefined} />
                                 <span className="ed-slider"></span>
                             </label>

[NoCoverage] ArrowFunction
src/pages/settings.tsx:86:87
                         </div>
                         <div className="settings-item-action">
                             <label className="ed-switch">
-                                <input type="checkbox" checked={strictLgpd} onChange={(e) => setStrictLgpd(e.target.checked)} />
+                                <input type="checkbox" checked={strictLgpd} onChange={() => undefined} />
                                 <span className="ed-slider"></span>
                             </label>
