[NoCoverage] StringLiteral
src/pages/trail.tsx:7:64
 
 const ResearchTrail: React.FC = () => {
     // For demo purposes, we'll use local state to switch between "list mode" and "detail mode"
-    const [selectedDocId, setSelectedDocId] = useState<string>('1');
+    const [selectedDocId, setSelectedDocId] = useState<string>("");
 
     const documents = [

[NoCoverage] ArrayDeclaration
src/pages/trail.tsx:9:23
     // For demo purposes, we'll use local state to switch between "list mode" and "detail mode"
     const [selectedDocId, setSelectedDocId] = useState<string>('1');
 
-    const documents = [
-        { id: '1', title: 'Metodologia_Qualitativa_v3.pdf', project: 'Análise LGPD', status: 'Aprovado' },
-        { id: '2', title: 'Dataset_Experimento_A.csv', project: 'Sistemas de IA', status: 'Em revisão' },
-        { id: '3', title: 'Referencial_Teorico_v2.pdf', project: 'Análise LGPD', status: 'Submetido' }
-    ];
+    const documents = [];
 
     const getStatusBadgeClass = (status: string) => {

[NoCoverage] StringLiteral
src/pages/trail.tsx:10:70
     const [selectedDocId, setSelectedDocId] = useState<string>('1');
 
     const documents = [
-        { id: '1', title: 'Metodologia_Qualitativa_v3.pdf', project: 'Análise LGPD', status: 'Aprovado' },
+        { id: '1', title: 'Metodologia_Qualitativa_v3.pdf', project: "", status: 'Aprovado' },
         { id: '2', title: 'Dataset_Experimento_A.csv', project: 'Sistemas de IA', status: 'Em revisão' },
         { id: '3', title: 'Referencial_Teorico_v2.pdf', project: 'Análise LGPD', status: 'Submetido' }

[NoCoverage] ObjectLiteral
src/pages/trail.tsx:11:9
 
     const documents = [
         { id: '1', title: 'Metodologia_Qualitativa_v3.pdf', project: 'Análise LGPD', status: 'Aprovado' },
-        { id: '2', title: 'Dataset_Experimento_A.csv', project: 'Sistemas de IA', status: 'Em revisão' },
+        {},
         { id: '3', title: 'Referencial_Teorico_v2.pdf', project: 'Análise LGPD', status: 'Submetido' }
     ];

[NoCoverage] StringLiteral
src/pages/trail.tsx:11:91
 
     const documents = [
         { id: '1', title: 'Metodologia_Qualitativa_v3.pdf', project: 'Análise LGPD', status: 'Aprovado' },
-        { id: '2', title: 'Dataset_Experimento_A.csv', project: 'Sistemas de IA', status: 'Em revisão' },
+        { id: '2', title: 'Dataset_Experimento_A.csv', project: 'Sistemas de IA', status: "" },
         { id: '3', title: 'Referencial_Teorico_v2.pdf', project: 'Análise LGPD', status: 'Submetido' }
     ];

[NoCoverage] ObjectLiteral
src/pages/trail.tsx:12:9
     const documents = [
         { id: '1', title: 'Metodologia_Qualitativa_v3.pdf', project: 'Análise LGPD', status: 'Aprovado' },
         { id: '2', title: 'Dataset_Experimento_A.csv', project: 'Sistemas de IA', status: 'Em revisão' },
-        { id: '3', title: 'Referencial_Teorico_v2.pdf', project: 'Análise LGPD', status: 'Submetido' }
+        {}
     ];
 

[NoCoverage] BlockStatement
src/pages/trail.tsx:15:53
         { id: '3', title: 'Referencial_Teorico_v2.pdf', project: 'Análise LGPD', status: 'Submetido' }
     ];
 
-    const getStatusBadgeClass = (status: string) => {
-        switch(status) {
-            case 'Aprovado': return 'status-approved';
-            case 'Em revisão': return 'status-review';
-            case 'Submetido': return 'status-submitted';
-            default: return 'status-draft';
-        }
-    };
+    const getStatusBadgeClass = (status: string) => {};
 
     return (

[NoCoverage] ConditionalExpression
src/pages/trail.tsx:17:13
 
     const getStatusBadgeClass = (status: string) => {
         switch(status) {
-            case 'Aprovado': return 'status-approved';
+            case 'Aprovado':
             case 'Em revisão': return 'status-review';
             case 'Submetido': return 'status-submitted';

[NoCoverage] StringLiteral
src/pages/trail.tsx:17:37
 
     const getStatusBadgeClass = (status: string) => {
         switch(status) {
-            case 'Aprovado': return 'status-approved';
+            case 'Aprovado': return "";
             case 'Em revisão': return 'status-review';
             case 'Submetido': return 'status-submitted';

[NoCoverage] ConditionalExpression
src/pages/trail.tsx:18:13
     const getStatusBadgeClass = (status: string) => {
         switch(status) {
             case 'Aprovado': return 'status-approved';
-            case 'Em revisão': return 'status-review';
+            case 'Em revisão':
             case 'Submetido': return 'status-submitted';
             default: return 'status-draft';

[NoCoverage] StringLiteral
src/pages/trail.tsx:18:18
     const getStatusBadgeClass = (status: string) => {
         switch(status) {
             case 'Aprovado': return 'status-approved';
-            case 'Em revisão': return 'status-review';
+            case "": return 'status-review';
             case 'Submetido': return 'status-submitted';
             default: return 'status-draft';

[NoCoverage] ConditionalExpression
src/pages/trail.tsx:19:13
         switch(status) {
             case 'Aprovado': return 'status-approved';
             case 'Em revisão': return 'status-review';
-            case 'Submetido': return 'status-submitted';
+            case 'Submetido':
             default: return 'status-draft';
         }

[NoCoverage] StringLiteral
src/pages/trail.tsx:19:18
         switch(status) {
             case 'Aprovado': return 'status-approved';
             case 'Em revisão': return 'status-review';
-            case 'Submetido': return 'status-submitted';
+            case "": return 'status-submitted';
             default: return 'status-draft';
         }

[NoCoverage] ConditionalExpression
src/pages/trail.tsx:20:13
             case 'Aprovado': return 'status-approved';
             case 'Em revisão': return 'status-review';
             case 'Submetido': return 'status-submitted';
-            default: return 'status-draft';
+            default:
         }
     };

[NoCoverage] StringLiteral
src/pages/trail.tsx:36:65
             }
         >
             {/* GOVERNANCE ALERTS (Mixed in as requested) */}
-            <div style={{ display: 'grid', gridTemplateColumns: '1fr 1fr', gap: '24px', marginBottom: '32px' }}>
+            <div style={{ display: 'grid', gridTemplateColumns: "", gap: '24px', marginBottom: '32px' }}>
                 <div className="governance-alert" style={{ background: 'var(--ed-status-danger)', margin: 0 }}>
                     <div className="alert-content">

[NoCoverage] ArrowFunction
src/pages/trail.tsx:71:36
                 </div>
                 
                 <div>
-                    {documents.map(doc => (
-                        <div 
-                            key={doc.id} 
-                            className={`trail-doc-item ${selectedDocId === doc.id ? 'active' : ''}`}
-                            onClick={() => setSelectedDocId(doc.id)}
-                        >
-                            <div className="trail-doc-info">
-                                <div className={`trail-file-icon ${doc.title.endsWith('.pdf') ? 'type-pdf-bg type-pdf-text' : 'type-csv-bg type-csv-text'}`}>
-                                    <i className="bi bi-file-earmark-text"></i>
-                                </div>
-                                <div>
-                                    <span className="trail-doc-name">{doc.title}</span>
-                                    <span className="trail-doc-project">{doc.project}</span>
-                                </div>
-                            </div>
-                            <div>
-                                <span className={`doc-status ${getStatusBadgeClass(doc.status)}`}>{doc.status}</span>
-                            </div>
-                        </div>
-                    ))}
+                    {documents.map(() => undefined)}
                 </div>
             </div>

[NoCoverage] ConditionalExpression
src/pages/trail.tsx:74:58
                     {documents.map(doc => (
                         <div 
                             key={doc.id} 
-                            className={`trail-doc-item ${selectedDocId === doc.id ? 'active' : ''}`}
+                            className={`trail-doc-item ${true ? 'active' : ''}`}
                             onClick={() => setSelectedDocId(doc.id)}
                         >

[NoCoverage] MethodExpression
src/pages/trail.tsx:78:68
                             onClick={() => setSelectedDocId(doc.id)}
                         >
                             <div className="trail-doc-info">
-                                <div className={`trail-file-icon ${doc.title.endsWith('.pdf') ? 'type-pdf-bg type-pdf-text' : 'type-csv-bg type-csv-text'}`}>
+                                <div className={`trail-file-icon ${doc.title.startsWith('.pdf') ? 'type-pdf-bg type-pdf-text' : 'type-csv-bg type-csv-text'}`}>
                                     <i className="bi bi-file-earmark-text"></i>
                                 </div>

[NoCoverage] StringLiteral
src/pages/trail.tsx:78:127
                             onClick={() => setSelectedDocId(doc.id)}
                         >
                             <div className="trail-doc-info">
-                                <div className={`trail-file-icon ${doc.title.endsWith('.pdf') ? 'type-pdf-bg type-pdf-text' : 'type-csv-bg type-csv-text'}`}>
+                                <div className={`trail-file-icon ${doc.title.endsWith('.pdf') ? 'type-pdf-bg type-pdf-text' : ""}`}>
                                     <i className="bi bi-file-earmark-text"></i>
                                 </div>

[NoCoverage] StringLiteral
src/pages/trail.tsx:107:48
                                 <span className="trail-doc-project">Dra. Renata Silva - Análise LGPD - 7 eventos · 4 versões</span>
                             </div>
                         </div>
-                        <div style={{ display: 'flex', alignItems: 'center', gap: '16px' }}>
+                        <div style={{ display: "", alignItems: 'center', gap: '16px' }}>
                             <span className="doc-status status-approved"><i className="bi bi-check-circle me-1"></i> Aprovado</span>
                             <button className="btn-export-trail">

[NoCoverage] ObjectLiteral
src/pages/trail.tsx:216:93
                                             <span className="version-tag">v4</span>
                                             <span className="version-author">Hoje - R. Silva</span>
                                         </div>
-                                        <span className="doc-status status-approved" style={{ fontSize: '10px', padding: '2px 8px' }}>Aprovado</span>
+                                        <span className="doc-status status-approved" style={{}}>Aprovado</span>
                                     </div>
                                     <div className="version-item">

[NoCoverage] ObjectLiteral
src/pages/trail.tsx:223:90
                                             <span className="version-tag" style={{ color: 'var(--ed-text-muted)' }}>v3</span>
                                             <span className="version-author">10 Jun - R. Silva</span>
                                         </div>
-                                        <span className="doc-status status-draft" style={{ fontSize: '10px', padding: '2px 8px' }}>Substituído</span>
+                                        <span className="doc-status status-draft" style={{}}>Substituído</span>
                                     </div>
                                     <div className="version-item">

[NoCoverage] StringLiteral
src/pages/trail.tsx:223:119
                                             <span className="version-tag" style={{ color: 'var(--ed-text-muted)' }}>v3</span>
                                             <span className="version-author">10 Jun - R. Silva</span>
                                         </div>
-                                        <span className="doc-status status-draft" style={{ fontSize: '10px', padding: '2px 8px' }}>Substituído</span>
+                                        <span className="doc-status status-draft" style={{ fontSize: '10px', padding: "" }}>Substituído</span>
                                     </div>
                                     <div className="version-item">

[NoCoverage] ObjectLiteral
src/pages/trail.tsx:234:82
                                     </div>
                                     <div className="version-item">
                                         <div className="version-info">
-                                            <span className="version-tag" style={{ color: 'var(--ed-text-muted)' }}>v1</span>
+                                            <span className="version-tag" style={{}}>v1</span>
                                             <span className="version-author">20 Mai - R. Silva</span>
                                         </div>
