[NoCoverage] StringLiteral
src/pages/upload.tsx:17:52
     const { data: projects = [] } = useProjects();
     const { mutateAsync: uploadDoc } = useUploadDocument();
 
-    const [uploadTitle, setUploadTitle] = useState("");
+    const [uploadTitle, setUploadTitle] = useState("Stryker was here!");
     const [uploadProjectId, setUploadProjectId] = useState("");
     const [uploadTags, setUploadTags] = useState("");

[NoCoverage] EqualityOperator
src/pages/upload.tsx:46:31
     };
 
     const handleFileInput = (e: React.ChangeEvent<HTMLInputElement>) => {
-        if (e.target.files && e.target.files.length > 0) {
+        if (e.target.files && e.target.files.length >= 0) {
             setUploadFile(e.target.files[0]);
         }

[NoCoverage] ConditionalExpression
src/pages/upload.tsx:57:13
         setUploadSuccess("");
         setUploadProgress(0);
         
-        if (!uploadFile || !uploadTitle || !uploadProjectId) {
+        if (false || !uploadProjectId) {
             setUploadError("Por favor, preencha todos os campos obrigatórios (Título, Projeto e Arquivo).");
             return;

[NoCoverage] BlockStatement
src/pages/upload.tsx:62:13
             return;
         }
 
-        try {
-            await uploadDoc({
-                file: uploadFile, 
-                title: uploadTitle, 
-                projectId: uploadProjectId, 
-                onProgress: (progressEvent) => {
-                    const percentCompleted = Math.round((progressEvent.loaded * 100) / progressEvent.total);
-                    setUploadProgress(percentCompleted);
-                }
-            });
-
-            setUploadSuccess("Documento enviado com sucesso! Redirecionando para o Workspace...");
-            setTimeout(() => {
-                navigate('/documentos');
-            }, 2000);
-        } catch (error: any) {
+        try {} catch (error: any) {
             setUploadError(error.message);
             setUploadProgress(0);

[NoCoverage] ObjectLiteral
src/pages/upload.tsx:63:29
         }
 
         try {
-            await uploadDoc({
-                file: uploadFile, 
-                title: uploadTitle, 
-                projectId: uploadProjectId, 
-                onProgress: (progressEvent) => {
-                    const percentCompleted = Math.round((progressEvent.loaded * 100) / progressEvent.total);
-                    setUploadProgress(percentCompleted);
-                }
-            });
+            await uploadDoc({});
 
             setUploadSuccess("Documento enviado com sucesso! Redirecionando para o Workspace...");

[NoCoverage] BlockStatement
src/pages/upload.tsx:67:48
                 file: uploadFile, 
                 title: uploadTitle, 
                 projectId: uploadProjectId, 
-                onProgress: (progressEvent) => {
-                    const percentCompleted = Math.round((progressEvent.loaded * 100) / progressEvent.total);
-                    setUploadProgress(percentCompleted);
-                }
+                onProgress: (progressEvent) => {}
             });
 

[NoCoverage] StringLiteral
src/pages/upload.tsx:73:30
                 }
             });
 
-            setUploadSuccess("Documento enviado com sucesso! Redirecionando para o Workspace...");
+            setUploadSuccess("");
             setTimeout(() => {
                 navigate('/documentos');

[NoCoverage] BlockStatement
src/pages/upload.tsx:74:30
             });
 
             setUploadSuccess("Documento enviado com sucesso! Redirecionando para o Workspace...");
-            setTimeout(() => {
-                navigate('/documentos');
-            }, 2000);
+            setTimeout(() => {}, 2000);
         } catch (error: any) {
             setUploadError(error.message);

[NoCoverage] StringLiteral
src/pages/upload.tsx:87:27
         <DashboardLayout
             title={`Bom dia, ${firstName}`}
             subtitle="Adicione novos metadados e envie arquivos para os seus projetos"
-            breadcrumbs={['EdTech', 'Enviar Documento']}
+            breadcrumbs={["", 'Enviar Documento']}
         >
             <div className="dashboard-card" style={{ padding: '32px', backgroundColor: 'var(--bg)', border: '1px solid var(--border)' }}>

[NoCoverage] ObjectLiteral
src/pages/upload.tsx:89:52
             subtitle="Adicione novos metadados e envie arquivos para os seus projetos"
             breadcrumbs={['EdTech', 'Enviar Documento']}
         >
-            <div className="dashboard-card" style={{ padding: '32px', backgroundColor: 'var(--bg)', border: '1px solid var(--border)' }}>
+            <div className="dashboard-card" style={{}}>
                 {uploadError && (
                     <div className="governance-alert" style={{ background: 'var(--ed-status-danger)', marginBottom: '24px' }}>

[NoCoverage] ConditionalExpression
src/pages/upload.tsx:90:18
             breadcrumbs={['EdTech', 'Enviar Documento']}
         >
             <div className="dashboard-card" style={{ padding: '32px', backgroundColor: 'var(--bg)', border: '1px solid var(--border)' }}>
-                {uploadError && (
-                    <div className="governance-alert" style={{ background: 'var(--ed-status-danger)', marginBottom: '24px' }}>
-                        <div className="alert-content">
-                            <div className="alert-icon"><i className="bi bi-exclamation-triangle"></i></div>
-                            <div className="alert-text-container">
-                                <span className="alert-title">ERRO NO UPLOAD</span>
-                                <span className="alert-desc">{uploadError}</span>
-                            </div>
-                        </div>
-                    </div>
-                )}
+                {false}
 
                 {uploadSuccess && (

[NoCoverage] ConditionalExpression
src/pages/upload.tsx:90:18
             breadcrumbs={['EdTech', 'Enviar Documento']}
         >
             <div className="dashboard-card" style={{ padding: '32px', backgroundColor: 'var(--bg)', border: '1px solid var(--border)' }}>
-                {uploadError && (
-                    <div className="governance-alert" style={{ background: 'var(--ed-status-danger)', marginBottom: '24px' }}>
-                        <div className="alert-content">
-                            <div className="alert-icon"><i className="bi bi-exclamation-triangle"></i></div>
-                            <div className="alert-text-container">
-                                <span className="alert-title">ERRO NO UPLOAD</span>
-                                <span className="alert-desc">{uploadError}</span>
-                            </div>
-                        </div>
-                    </div>
-                )}
+                {true}
 
                 {uploadSuccess && (

[NoCoverage] StringLiteral
src/pages/upload.tsx:91:117
         >
             <div className="dashboard-card" style={{ padding: '32px', backgroundColor: 'var(--bg)', border: '1px solid var(--border)' }}>
                 {uploadError && (
-                    <div className="governance-alert" style={{ background: 'var(--ed-status-danger)', marginBottom: '24px' }}>
+                    <div className="governance-alert" style={{ background: 'var(--ed-status-danger)', marginBottom: "" }}>
                         <div className="alert-content">
                             <div className="alert-icon"><i className="bi bi-exclamation-triangle"></i></div>

[NoCoverage] ObjectLiteral
src/pages/upload.tsx:91:62
         >
             <div className="dashboard-card" style={{ padding: '32px', backgroundColor: 'var(--bg)', border: '1px solid var(--border)' }}>
                 {uploadError && (
-                    <div className="governance-alert" style={{ background: 'var(--ed-status-danger)', marginBottom: '24px' }}>
+                    <div className="governance-alert" style={{}}>
                         <div className="alert-content">
                             <div className="alert-icon"><i className="bi bi-exclamation-triangle"></i></div>

[NoCoverage] LogicalOperator
src/pages/upload.tsx:102:18
                     </div>
                 )}
 
-                {uploadSuccess && (
-                    <div className="governance-alert" style={{ background: 'var(--ed-status-success)', marginBottom: '24px' }}>
-                        <div className="alert-content">
-                            <div className="alert-icon"><i className="bi bi-check-circle"></i></div>
-                            <div className="alert-text-container">
-                                <span className="alert-title">SUCESSO</span>
-                                <span className="alert-desc">{uploadSuccess}</span>
-                            </div>
-                        </div>
-                    </div>
-                )}
+                {uploadSuccess || <div className="governance-alert" style={{
+  background: 'var(--ed-status-success)',
+  marginBottom: '24px'
+}}>
+                        <div className="alert-content">
+                            <div className="alert-icon"><i className="bi bi-check-circle"></i></div>
+                            <div className="alert-text-container">
+                                <span className="alert-title">SUCESSO</span>
+                                <span className="alert-desc">{uploadSuccess}</span>
+                            </div>
+                        </div>
+                    </div>}
 
                 <form onSubmit={handleUpload} className="upload-advanced-form">

[NoCoverage] ConditionalExpression
src/pages/upload.tsx:102:18
                     </div>
                 )}
 
-                {uploadSuccess && (
-                    <div className="governance-alert" style={{ background: 'var(--ed-status-success)', marginBottom: '24px' }}>
-                        <div className="alert-content">
-                            <div className="alert-icon"><i className="bi bi-check-circle"></i></div>
-                            <div className="alert-text-container">
-                                <span className="alert-title">SUCESSO</span>
-                                <span className="alert-desc">{uploadSuccess}</span>
-                            </div>
-                        </div>
-                    </div>
-                )}
+                {false}
 
                 <form onSubmit={handleUpload} className="upload-advanced-form">

[NoCoverage] StringLiteral
src/pages/upload.tsx:103:76
                 )}
 
                 {uploadSuccess && (
-                    <div className="governance-alert" style={{ background: 'var(--ed-status-success)', marginBottom: '24px' }}>
+                    <div className="governance-alert" style={{ background: "", marginBottom: '24px' }}>
                         <div className="alert-content">
                             <div className="alert-icon"><i className="bi bi-check-circle"></i></div>

[NoCoverage] StringLiteral
src/pages/upload.tsx:103:118
                 )}
 
                 {uploadSuccess && (
-                    <div className="governance-alert" style={{ background: 'var(--ed-status-success)', marginBottom: '24px' }}>
+                    <div className="governance-alert" style={{ background: 'var(--ed-status-success)', marginBottom: "" }}>
                         <div className="alert-content">
                             <div className="alert-icon"><i className="bi bi-check-circle"></i></div>

[NoCoverage] StringLiteral
src/pages/upload.tsx:117:86
                 <form onSubmit={handleUpload} className="upload-advanced-form">
                     <div className="upload-grid">
                         {/* Coluna 1: Metadados */}
-                        <div style={{ display: 'flex', flexDirection: 'column', gap: '24px' }}>
+                        <div style={{ display: 'flex', flexDirection: 'column', gap: "" }}>
                             <h4 style={{ fontSize: '15px', fontWeight: 600, color: 'var(--ed-purple-light)', opacity: 0.9, marginBottom: '4px' }}>1. Metadados do Documento</h4>
                             

[NoCoverage] StringLiteral
src/pages/upload.tsx:118:84
                     <div className="upload-grid">
                         {/* Coluna 1: Metadados */}
                         <div style={{ display: 'flex', flexDirection: 'column', gap: '24px' }}>
-                            <h4 style={{ fontSize: '15px', fontWeight: 600, color: 'var(--ed-purple-light)', opacity: 0.9, marginBottom: '4px' }}>1. Metadados do Documento</h4>
+                            <h4 style={{ fontSize: '15px', fontWeight: 600, color: "", opacity: 0.9, marginBottom: '4px' }}>1. Metadados do Documento</h4>
                             
                             <div className="form-group">

[NoCoverage] ObjectLiteral
src/pages/upload.tsx:121:47
                             <h4 style={{ fontSize: '15px', fontWeight: 600, color: 'var(--ed-purple-light)', opacity: 0.9, marginBottom: '4px' }}>1. Metadados do Documento</h4>
                             
                             <div className="form-group">
-                                <label style={{ display: 'block', fontSize: '13px', fontWeight: 600, marginBottom: '8px', color: 'var(--ed-text-dark)' }}>Título do Documento *</label>
+                                <label style={{}}>Título do Documento *</label>
                                 <input 
                                     type="text" 

[NoCoverage] StringLiteral
src/pages/upload.tsx:121:58
                             <h4 style={{ fontSize: '15px', fontWeight: 600, color: 'var(--ed-purple-light)', opacity: 0.9, marginBottom: '4px' }}>1. Metadados do Documento</h4>
                             
                             <div className="form-group">
-                                <label style={{ display: 'block', fontSize: '13px', fontWeight: 600, marginBottom: '8px', color: 'var(--ed-text-dark)' }}>Título do Documento *</label>
+                                <label style={{ display: "", fontSize: '13px', fontWeight: 600, marginBottom: '8px', color: 'var(--ed-text-dark)' }}>Título do Documento *</label>
                                 <input 
                                     type="text" 

[NoCoverage] StringLiteral
src/pages/upload.tsx:132:130
                             </div>
 
                             <div className="form-group">
-                                <label style={{ display: 'block', fontSize: '13px', fontWeight: 600, marginBottom: '8px', color: 'var(--ed-text-dark)' }}>Projeto de Pesquisa *</label>
+                                <label style={{ display: 'block', fontSize: '13px', fontWeight: 600, marginBottom: '8px', color: "" }}>Projeto de Pesquisa *</label>
                                 <select 
                                     value={uploadProjectId}

[NoCoverage] ArrowFunction
src/pages/upload.tsx:139:51
                                 >
                                     <option value="">Selecione o Projeto...</option>
-                                    {projects.map((p: Project) => (
-                                        <option key={p.id} value={p.id}>{p.name}</option>
-                                    ))}
+                                    {projects.map(() => undefined)}
                                 </select>
                             </div>

[NoCoverage] StringLiteral
src/pages/upload.tsx:146:116
                             </div>
 
                             <div className="form-group">
-                                <label style={{ display: 'block', fontSize: '13px', fontWeight: 600, marginBottom: '8px', color: 'var(--ed-text-dark)' }}>Categoria</label>
+                                <label style={{ display: 'block', fontSize: '13px', fontWeight: 600, marginBottom: "", color: 'var(--ed-text-dark)' }}>Categoria</label>
                                 <select 
                                     value={uploadCategory}

[NoCoverage] ObjectLiteral
src/pages/upload.tsx:146:47
                             </div>
 
                             <div className="form-group">
-                                <label style={{ display: 'block', fontSize: '13px', fontWeight: 600, marginBottom: '8px', color: 'var(--ed-text-dark)' }}>Categoria</label>
+                                <label style={{}}>Categoria</label>
                                 <select 
                                     value={uploadCategory}

[NoCoverage] StringLiteral
src/pages/upload.tsx:162:116
                             </div>
 
                             <div className="form-group">
-                                <label style={{ display: 'block', fontSize: '13px', fontWeight: 600, marginBottom: '8px', color: 'var(--ed-text-dark)' }}>Tags (separadas por vírgula)</label>
+                                <label style={{ display: 'block', fontSize: '13px', fontWeight: 600, marginBottom: "", color: 'var(--ed-text-dark)' }}>Tags (separadas por vírgula)</label>
                                 <input 
                                     type="text" 

[NoCoverage] ObjectLiteral
src/pages/upload.tsx:162:47
                             </div>
 
                             <div className="form-group">
-                                <label style={{ display: 'block', fontSize: '13px', fontWeight: 600, marginBottom: '8px', color: 'var(--ed-text-dark)' }}>Tags (separadas por vírgula)</label>
+                                <label style={{}}>Tags (separadas por vírgula)</label>
                                 <input 
                                     type="text" 

[NoCoverage] StringLiteral
src/pages/upload.tsx:174:48
                         </div>
 
                         {/* Coluna 2: Arquivo */}
-                        <div style={{ display: 'flex', flexDirection: 'column', gap: '24px' }}>
+                        <div style={{ display: "", flexDirection: 'column', gap: '24px' }}>
                             <h4 style={{ fontSize: '15px', fontWeight: 600, color: 'var(--ed-purple-light)', opacity: 0.9, marginBottom: '4px' }}>2. Arquivo do Documento</h4>
                             

[NoCoverage] ObjectLiteral
src/pages/upload.tsx:175:40
 
                         {/* Coluna 2: Arquivo */}
                         <div style={{ display: 'flex', flexDirection: 'column', gap: '24px' }}>
-                            <h4 style={{ fontSize: '15px', fontWeight: 600, color: 'var(--ed-purple-light)', opacity: 0.9, marginBottom: '4px' }}>2. Arquivo do Documento</h4>
+                            <h4 style={{}}>2. Arquivo do Documento</h4>
                             
                             <div 

[NoCoverage] StringLiteral
src/pages/upload.tsx:184:57
                                 onClick={() => document.getElementById('advancedFileInput')?.click()}
                             >
-                                <div style={{ fontSize: '24px', color: 'var(--ed-text-dark)', marginBottom: '16px' }}>
+                                <div style={{ fontSize: "", color: 'var(--ed-text-dark)', marginBottom: '16px' }}>
                                     {uploadFile ? <i className="bi bi-file-earmark-check"></i> : <i className="bi bi-cloud-arrow-up"></i>}
                                 </div>

[NoCoverage] StringLiteral
src/pages/upload.tsx:184:109
                                 onClick={() => document.getElementById('advancedFileInput')?.click()}
                             >
-                                <div style={{ fontSize: '24px', color: 'var(--ed-text-dark)', marginBottom: '16px' }}>
+                                <div style={{ fontSize: '24px', color: 'var(--ed-text-dark)', marginBottom: "" }}>
                                     {uploadFile ? <i className="bi bi-file-earmark-check"></i> : <i className="bi bi-cloud-arrow-up"></i>}
                                 </div>

[NoCoverage] ObjectLiteral
src/pages/upload.tsx:187:43
                                 <div style={{ fontSize: '24px', color: 'var(--ed-text-dark)', marginBottom: '16px' }}>
                                     {uploadFile ? <i className="bi bi-file-earmark-check"></i> : <i className="bi bi-cloud-arrow-up"></i>}
                                 </div>
-                                <p style={{ fontSize: '15px', color: 'var(--ed-text-dark)', fontWeight: 600, margin: '0 0 8px 0' }}>
+                                <p style={{}}>
                                     {uploadFile ? uploadFile.name : 'Arraste e solte seu arquivo aqui'}
                                 </p>

[NoCoverage] StringLiteral
src/pages/upload.tsx:187:55
                                 <div style={{ fontSize: '24px', color: 'var(--ed-text-dark)', marginBottom: '16px' }}>
                                     {uploadFile ? <i className="bi bi-file-earmark-check"></i> : <i className="bi bi-cloud-arrow-up"></i>}
                                 </div>
-                                <p style={{ fontSize: '15px', color: 'var(--ed-text-dark)', fontWeight: 600, margin: '0 0 8px 0' }}>
+                                <p style={{ fontSize: "", color: 'var(--ed-text-dark)', fontWeight: 600, margin: '0 0 8px 0' }}>
                                     {uploadFile ? uploadFile.name : 'Arraste e solte seu arquivo aqui'}
                                 </p>

[NoCoverage] ObjectLiteral
src/pages/upload.tsx:190:43
                                 <p style={{ fontSize: '15px', color: 'var(--ed-text-dark)', fontWeight: 600, margin: '0 0 8px 0' }}>
                                     {uploadFile ? uploadFile.name : 'Arraste e solte seu arquivo aqui'}
                                 </p>
-                                <p style={{ fontSize: '13px', color: 'var(--ed-text-muted)', margin: 0 }}>
+                                <p style={{}}>
                                     ou clique para procurar no seu computador
                                 </p>

[NoCoverage] StringLiteral
src/pages/upload.tsx:193:55
                                 <p style={{ fontSize: '13px', color: 'var(--ed-text-muted)', margin: 0 }}>
                                     ou clique para procurar no seu computador
                                 </p>
-                                <p style={{ fontSize: '12px', marginTop: '24px', color: 'var(--ed-text-muted)', margin: '24px 0 0 0' }}>
+                                <p style={{ fontSize: "", marginTop: '24px', color: 'var(--ed-text-muted)', margin: '24px 0 0 0' }}>
                                     Formatos suportados: .pdf, .csv, .json (Máx. 50MB)
                                 </p>

[NoCoverage] StringLiteral
src/pages/upload.tsx:193:121
                                 <p style={{ fontSize: '13px', color: 'var(--ed-text-muted)', margin: 0 }}>
                                     ou clique para procurar no seu computador
                                 </p>
-                                <p style={{ fontSize: '12px', marginTop: '24px', color: 'var(--ed-text-muted)', margin: '24px 0 0 0' }}>
+                                <p style={{ fontSize: '12px', marginTop: '24px', color: 'var(--ed-text-muted)', margin: "" }}>
                                     Formatos suportados: .pdf, .csv, .json (Máx. 50MB)
                                 </p>

[NoCoverage] ConditionalExpression
src/pages/upload.tsx:205:30
                                 />
                             </div>
                             
-                            {uploadProgress > 0 && (
-                                <div className="progress-item mt-2">
-                                    <div className="progress-header">
-                                        <span>Enviando {uploadFile?.name}...</span>
-                                        <span>{uploadProgress}%</span>
-                                    </div>
-                                    <div className="progress-bar-bg">
-                                        <div className="progress-bar-fill fill-purple" style={{ width: `${uploadProgress}%`, transition: 'width 0.3s' }}></div>
-                                    </div>
-                                </div>
-                            )}
+                            {true}
                         </div>
                     </div>

[NoCoverage] ObjectLiteral
src/pages/upload.tsx:212:95
                                         <span>{uploadProgress}%</span>
                                     </div>
                                     <div className="progress-bar-bg">
-                                        <div className="progress-bar-fill fill-purple" style={{ width: `${uploadProgress}%`, transition: 'width 0.3s' }}></div>
+                                        <div className="progress-bar-fill fill-purple" style={{}}></div>
                                     </div>
                                 </div>

[NoCoverage] StringLiteral
src/pages/upload.tsx:219:68
                         </div>
                     </div>
 
-                    <div style={{ display: 'flex', justifyContent: 'flex-end', gap: '16px', marginTop: '48px', paddingTop: '32px', borderTop: '1px solid var(--border)' }}>
+                    <div style={{ display: 'flex', justifyContent: "", gap: '16px', marginTop: '48px', paddingTop: '32px', borderTop: '1px solid var(--border)' }}>
                             Cancelar

[NoCoverage] StringLiteral
src/pages/upload.tsx:219:104
                         </div>
                     </div>
 
-                    <div style={{ display: 'flex', justifyContent: 'flex-end', gap: '16px', marginTop: '48px', paddingTop: '32px', borderTop: '1px solid var(--border)' }}>
+                    <div style={{ display: 'flex', justifyContent: 'flex-end', gap: '16px', marginTop: "", paddingTop: '32px', borderTop: '1px solid var(--border)' }}>
                             Cancelar

[NoCoverage] EqualityOperator
src/pages/upload.tsx:224:30
                             Cancelar
                         </button>
-                            {uploadProgress > 0 && uploadProgress < 100 ? 'Enviando...' : 'Confirmar Envio'}
+                            {uploadProgress <= 0 && uploadProgress < 100 ? 'Enviando...' : 'Confirmar Envio'}
                         </button>
                     </div>

[NoCoverage] ConditionalExpression
src/pages/upload.tsx:224:30
                             Cancelar
                         </button>
-                            {uploadProgress > 0 && uploadProgress < 100 ? 'Enviando...' : 'Confirmar Envio'}
+                            {true ? 'Enviando...' : 'Confirmar Envio'}
                         </button>
                     </div>
