[Killed] BlockStatement
src/hooks/useDocuments.ts:4:90
 import { useQuery, useMutation, useQueryClient } from '@tanstack/react-query';
 import { getDocuments, uploadDocument, getDownloadUrl, toggleStar, getComments, addComment } from '../services/api';
 
-export const useDocuments = (projectId?: string, title?: string, page = 0, size = 20) => {
-  return useQuery({
-    queryKey: ['documents', projectId, title, page, size],
-    queryFn: async () => {
-      const res = await getDocuments(projectId, title, undefined, page, size);
-      if (!res.sucesso) throw new Error(res.mensagem);
-      return res.dados?.content || res.dados || [];
-    },
-  });
-};
+export const useDocuments = (projectId?: string, title?: string, page = 0, size = 20) => {};
 
 export const useUploadDocument = () => {
killedBy: useDocuments hooks useDocuments should successfully fetch documents with content
statusReason: Cannot read properties of undefined (reading 'isSuccess')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ObjectLiteral
src/hooks/useDocuments.ts:5:19
 import { getDocuments, uploadDocument, getDownloadUrl, toggleStar, getComments, addComment } from '../services/api';
 
 export const useDocuments = (projectId?: string, title?: string, page = 0, size = 20) => {
-  return useQuery({
-    queryKey: ['documents', projectId, title, page, size],
-    queryFn: async () => {
-      const res = await getDocuments(projectId, title, undefined, page, size);
-      if (!res.sucesso) throw new Error(res.mensagem);
-      return res.dados?.content || res.dados || [];
-    },
-  });
+  return useQuery({});
 };
 
killedBy: useDocuments hooks useDocuments should successfully fetch documents with content
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/hooks/useDocuments.ts:7:26
 export const useDocuments = (projectId?: string, title?: string, page = 0, size = 20) => {
   return useQuery({
     queryKey: ['documents', projectId, title, page, size],
-    queryFn: async () => {
-      const res = await getDocuments(projectId, title, undefined, page, size);
-      if (!res.sucesso) throw new Error(res.mensagem);
-      return res.dados?.content || res.dados || [];
-    },
+    queryFn: async () => {},
   });
 };
killedBy: useDocuments hooks useDocuments should successfully fetch documents with content
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/hooks/useDocuments.ts:9:11
     queryKey: ['documents', projectId, title, page, size],
     queryFn: async () => {
       const res = await getDocuments(projectId, title, undefined, page, size);
-      if (!res.sucesso) throw new Error(res.mensagem);
+      if (false) throw new Error(res.mensagem);
       return res.dados?.content || res.dados || [];
     },
killedBy: useDocuments hooks useDocuments should throw error when fetching fails
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
src/hooks/useDocuments.ts:9:11
     queryKey: ['documents', projectId, title, page, size],
     queryFn: async () => {
       const res = await getDocuments(projectId, title, undefined, page, size);
-      if (!res.sucesso) throw new Error(res.mensagem);
+      if (res.sucesso) throw new Error(res.mensagem);
       return res.dados?.content || res.dados || [];
     },
killedBy: useDocuments hooks useDocuments should successfully fetch documents with content
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] LogicalOperator
src/hooks/useDocuments.ts:10:14
     queryFn: async () => {
       const res = await getDocuments(projectId, title, undefined, page, size);
       if (!res.sucesso) throw new Error(res.mensagem);
-      return res.dados?.content || res.dados || [];
+      return (res.dados?.content || res.dados) && [];
     },
   });
killedBy: useDocuments hooks useDocuments should successfully fetch documents with content
statusReason: expected [] to deeply equal [ 'doc1' ]

[Killed] ConditionalExpression
src/hooks/useDocuments.ts:10:14
     queryFn: async () => {
       const res = await getDocuments(projectId, title, undefined, page, size);
       if (!res.sucesso) throw new Error(res.mensagem);
-      return res.dados?.content || res.dados || [];
+      return true;
     },
   });
killedBy: useDocuments hooks useDocuments should successfully fetch documents with content
statusReason: expected true to deeply equal [ 'doc1' ]

[Killed] BlockStatement
src/hooks/useDocuments.ts:15:40
   });
 };
 
-export const useUploadDocument = () => {
-  const queryClient = useQueryClient();
-
-  return useMutation({
-    mutationFn: async ({
-      file,
-      title,
-      projectId,
-      onProgress,
-    }: {
-      file: File;
-      title: string;
-      projectId: string;
-      onProgress?: (p: any) => void;
-    }) => {
-      const res = await uploadDocument(file, title, projectId, onProgress);
-      if (!res.sucesso) throw new Error(res.mensagem);
-      return res.dados;
-    },
-    onSuccess: () => {
-      queryClient.invalidateQueries({ queryKey: ['documents'] });
-    },
-  });
-};
+export const useUploadDocument = () => {};
 
 export const useDownloadUrl = () => {
killedBy: useDocuments hooks useUploadDocument should successfully upload document
statusReason: Cannot read properties of undefined (reading 'mutate')

[Killed] BlockStatement
src/hooks/useDocuments.ts:29:11
       title: string;
       projectId: string;
       onProgress?: (p: any) => void;
-    }) => {
-      const res = await uploadDocument(file, title, projectId, onProgress);
-      if (!res.sucesso) throw new Error(res.mensagem);
-      return res.dados;
-    },
+    }) => {},
     onSuccess: () => {
       queryClient.invalidateQueries({ queryKey: ['documents'] });
killedBy: useDocuments hooks useUploadDocument should successfully upload document
statusReason: expected undefined to be '1' // Object.is equality

[Killed] BooleanLiteral
src/hooks/useDocuments.ts:31:11
       onProgress?: (p: any) => void;
     }) => {
       const res = await uploadDocument(file, title, projectId, onProgress);
-      if (!res.sucesso) throw new Error(res.mensagem);
+      if (res.sucesso) throw new Error(res.mensagem);
       return res.dados;
     },
killedBy: useDocuments hooks useUploadDocument should successfully upload document
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/hooks/useDocuments.ts:31:11
       onProgress?: (p: any) => void;
     }) => {
       const res = await uploadDocument(file, title, projectId, onProgress);
-      if (!res.sucesso) throw new Error(res.mensagem);
+      if (false) throw new Error(res.mensagem);
       return res.dados;
     },
killedBy: useDocuments hooks useUploadDocument should throw error when upload fails
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Survived] BlockStatement
src/hooks/useDocuments.ts:34:22
       if (!res.sucesso) throw new Error(res.mensagem);
       return res.dados;
     },
-    onSuccess: () => {
-      queryClient.invalidateQueries({ queryKey: ['documents'] });
-    },
+    onSuccess: () => {},
   });
 };

[Survived] ArrayDeclaration
src/hooks/useDocuments.ts:35:49
       return res.dados;
     },
     onSuccess: () => {
-      queryClient.invalidateQueries({ queryKey: ['documents'] });
+      queryClient.invalidateQueries({ queryKey: [] });
     },
   });

[Survived] ObjectLiteral
src/hooks/useDocuments.ts:35:37
       return res.dados;
     },
     onSuccess: () => {
-      queryClient.invalidateQueries({ queryKey: ['documents'] });
+      queryClient.invalidateQueries({});
     },
   });

[Killed] BlockStatement
src/hooks/useDocuments.ts:40:37
   });
 };
 
-export const useDownloadUrl = () => {
-  return useMutation({
-    mutationFn: async (documentId: string) => {
-      const res = await getDownloadUrl(documentId);
-      if (!res.sucesso) throw new Error(res.mensagem);
-      return typeof res.dados === 'string'
-        ? res.dados
-        : res.dados?.url || res.dados?.downloadUrl || res.dados?.fileUrl;
-    },
-  });
-};
+export const useDownloadUrl = () => {};
 
 export const useToggleStar = () => {
killedBy: useDocuments hooks useDownloadUrl should successfully get string url
statusReason: Cannot read properties of undefined (reading 'mutate')

[Killed] ObjectLiteral
src/hooks/useDocuments.ts:41:22
 };
 
 export const useDownloadUrl = () => {
-  return useMutation({
-    mutationFn: async (documentId: string) => {
-      const res = await getDownloadUrl(documentId);
-      if (!res.sucesso) throw new Error(res.mensagem);
-      return typeof res.dados === 'string'
-        ? res.dados
-        : res.dados?.url || res.dados?.downloadUrl || res.dados?.fileUrl;
-    },
-  });
+  return useMutation({});
 };
 
killedBy: useDocuments hooks useDownloadUrl should successfully get string url
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/hooks/useDocuments.ts:42:47
 
 export const useDownloadUrl = () => {
   return useMutation({
-    mutationFn: async (documentId: string) => {
-      const res = await getDownloadUrl(documentId);
-      if (!res.sucesso) throw new Error(res.mensagem);
-      return typeof res.dados === 'string'
-        ? res.dados
-        : res.dados?.url || res.dados?.downloadUrl || res.dados?.fileUrl;
-    },
+    mutationFn: async (documentId: string) => {},
   });
 };
killedBy: useDocuments hooks useDownloadUrl should successfully get string url
statusReason: expected undefined to be 'http://test.com' // Object.is equality

[Killed] BooleanLiteral
src/hooks/useDocuments.ts:44:11
   return useMutation({
     mutationFn: async (documentId: string) => {
       const res = await getDownloadUrl(documentId);
-      if (!res.sucesso) throw new Error(res.mensagem);
+      if (res.sucesso) throw new Error(res.mensagem);
       return typeof res.dados === 'string'
         ? res.dados
killedBy: useDocuments hooks useDownloadUrl should successfully get string url
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/hooks/useDocuments.ts:44:11
   return useMutation({
     mutationFn: async (documentId: string) => {
       const res = await getDownloadUrl(documentId);
-      if (!res.sucesso) throw new Error(res.mensagem);
+      if (true) throw new Error(res.mensagem);
       return typeof res.dados === 'string'
         ? res.dados
killedBy: useDocuments hooks useDownloadUrl should successfully get string url
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/hooks/useDocuments.ts:45:14
     mutationFn: async (documentId: string) => {
       const res = await getDownloadUrl(documentId);
       if (!res.sucesso) throw new Error(res.mensagem);
-      return typeof res.dados === 'string'
+      return true
         ? res.dados
         : res.dados?.url || res.dados?.downloadUrl || res.dados?.fileUrl;
killedBy: useDocuments hooks useDownloadUrl should successfully get url from object (url property)
statusReason: expected { url: 'http://test2.com' } to be 'http://test2.com' // Object.is equality

[Killed] ConditionalExpression
src/hooks/useDocuments.ts:45:14
     mutationFn: async (documentId: string) => {
       const res = await getDownloadUrl(documentId);
       if (!res.sucesso) throw new Error(res.mensagem);
-      return typeof res.dados === 'string'
+      return false
         ? res.dados
         : res.dados?.url || res.dados?.downloadUrl || res.dados?.fileUrl;
killedBy: useDocuments hooks useDownloadUrl should successfully get string url
statusReason: expected undefined to be 'http://test.com' // Object.is equality

[Killed] LogicalOperator
src/hooks/useDocuments.ts:47:11
       if (!res.sucesso) throw new Error(res.mensagem);
       return typeof res.dados === 'string'
         ? res.dados
-        : res.dados?.url || res.dados?.downloadUrl || res.dados?.fileUrl;
+        : (res.dados?.url || res.dados?.downloadUrl) && res.dados?.fileUrl;
     },
   });
killedBy: useDocuments hooks useDownloadUrl should successfully get url from object (url property)
statusReason: expected undefined to be 'http://test2.com' // Object.is equality

[Killed] ConditionalExpression
src/hooks/useDocuments.ts:47:11
       if (!res.sucesso) throw new Error(res.mensagem);
       return typeof res.dados === 'string'
         ? res.dados
-        : res.dados?.url || res.dados?.downloadUrl || res.dados?.fileUrl;
+        : false;
     },
   });
killedBy: useDocuments hooks useDownloadUrl should successfully get url from object (url property)
statusReason: expected false to be 'http://test2.com' // Object.is equality

[Killed] BlockStatement
src/hooks/useDocuments.ts:56:47
   const queryClient = useQueryClient();
 
   return useMutation({
-    mutationFn: async (documentId: string) => {
-      const res = await toggleStar(documentId);
-      if (!res.sucesso) throw new Error(res.mensagem);
-      return res.dados;
-    },
+    mutationFn: async (documentId: string) => {},
     // Optimistic UI Update
     onMutate: async (documentId) => {
killedBy: useDocuments hooks useToggleStar should successfully toggle star
statusReason: expected undefined to be 'ok' // Object.is equality

[Killed] ConditionalExpression
src/hooks/useDocuments.ts:58:11
   return useMutation({
     mutationFn: async (documentId: string) => {
       const res = await toggleStar(documentId);
-      if (!res.sucesso) throw new Error(res.mensagem);
+      if (false) throw new Error(res.mensagem);
       return res.dados;
     },
killedBy: useDocuments hooks useToggleStar should throw error when toggle fails
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/hooks/useDocuments.ts:58:11
   return useMutation({
     mutationFn: async (documentId: string) => {
       const res = await toggleStar(documentId);
-      if (!res.sucesso) throw new Error(res.mensagem);
+      if (true) throw new Error(res.mensagem);
       return res.dados;
     },
killedBy: useDocuments hooks useToggleStar should successfully toggle star
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/hooks/useDocuments.ts:62:37
       return res.dados;
     },
     // Optimistic UI Update
-    onMutate: async (documentId) => {
-      await queryClient.cancelQueries({ queryKey: ['documents'] });
-      const previousQueries = queryClient.getQueriesData({ queryKey: ['documents'] });
-      
-      queryClient.setQueriesData({ queryKey: ['documents'] }, (oldData: any) => {
-        if (!oldData) return oldData;
-        return oldData.map((doc: any) => 
-          doc.id === documentId ? { ...doc, starred: !doc.starred } : doc
-        );
-      });
-      return { previousQueries };
-    },
+    onMutate: async (documentId) => {},
     onError: (err, documentId, context) => {
       if (context?.previousQueries) {
killedBy: useDocuments hooks useToggleStar should update queryData correctly onMutate and handle unmatching doc ids
statusReason: expected false to be true // Object.is equality

[Survived] ObjectLiteral
src/hooks/useDocuments.ts:64:58
     // Optimistic UI Update
     onMutate: async (documentId) => {
       await queryClient.cancelQueries({ queryKey: ['documents'] });
-      const previousQueries = queryClient.getQueriesData({ queryKey: ['documents'] });
+      const previousQueries = queryClient.getQueriesData({});
       
       queryClient.setQueriesData({ queryKey: ['documents'] }, (oldData: any) => {

[Killed] BlockStatement
src/hooks/useDocuments.ts:66:81
       await queryClient.cancelQueries({ queryKey: ['documents'] });
       const previousQueries = queryClient.getQueriesData({ queryKey: ['documents'] });
       
-      queryClient.setQueriesData({ queryKey: ['documents'] }, (oldData: any) => {
-        if (!oldData) return oldData;
-        return oldData.map((doc: any) => 
-          doc.id === documentId ? { ...doc, starred: !doc.starred } : doc
-        );
-      });
+      queryClient.setQueriesData({ queryKey: ['documents'] }, (oldData: any) => {});
       return { previousQueries };
     },
killedBy: useDocuments hooks useToggleStar should update queryData correctly onMutate and handle unmatching doc ids
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/hooks/useDocuments.ts:67:13
       const previousQueries = queryClient.getQueriesData({ queryKey: ['documents'] });
       
       queryClient.setQueriesData({ queryKey: ['documents'] }, (oldData: any) => {
-        if (!oldData) return oldData;
+        if (oldData) return oldData;
         return oldData.map((doc: any) => 
           doc.id === documentId ? { ...doc, starred: !doc.starred } : doc
killedBy: useDocuments hooks useToggleStar should update queryData correctly onMutate and handle unmatching doc ids
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/hooks/useDocuments.ts:67:13
       const previousQueries = queryClient.getQueriesData({ queryKey: ['documents'] });
       
       queryClient.setQueriesData({ queryKey: ['documents'] }, (oldData: any) => {
-        if (!oldData) return oldData;
+        if (true) return oldData;
         return oldData.map((doc: any) => 
           doc.id === documentId ? { ...doc, starred: !doc.starred } : doc
killedBy: useDocuments hooks useToggleStar should update queryData correctly onMutate and handle unmatching doc ids
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/hooks/useDocuments.ts:68:28
       
       queryClient.setQueriesData({ queryKey: ['documents'] }, (oldData: any) => {
         if (!oldData) return oldData;
-        return oldData.map((doc: any) => 
-          doc.id === documentId ? { ...doc, starred: !doc.starred } : doc
+        return oldData.map(() => undefined
         );
       });
killedBy: useDocuments hooks useToggleStar should update queryData correctly onMutate and handle unmatching doc ids
statusReason: Cannot read properties of undefined (reading 'starred')

[Killed] BooleanLiteral
src/hooks/useDocuments.ts:69:54
       queryClient.setQueriesData({ queryKey: ['documents'] }, (oldData: any) => {
         if (!oldData) return oldData;
         return oldData.map((doc: any) => 
-          doc.id === documentId ? { ...doc, starred: !doc.starred } : doc
+          doc.id === documentId ? { ...doc, starred: doc.starred } : doc
         );
       });
killedBy: useDocuments hooks useToggleStar should update queryData correctly onMutate and handle unmatching doc ids
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/hooks/useDocuments.ts:69:11
       queryClient.setQueriesData({ queryKey: ['documents'] }, (oldData: any) => {
         if (!oldData) return oldData;
         return oldData.map((doc: any) => 
-          doc.id === documentId ? { ...doc, starred: !doc.starred } : doc
+          doc.id !== documentId ? { ...doc, starred: !doc.starred } : doc
         );
       });
killedBy: useDocuments hooks useToggleStar should update queryData correctly onMutate and handle unmatching doc ids
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/hooks/useDocuments.ts:74:44
       });
       return { previousQueries };
     },
-    onError: (err, documentId, context) => {
-      if (context?.previousQueries) {
-        context.previousQueries.forEach(([queryKey, data]) => {
-          queryClient.setQueryData(queryKey, data);
-        });
-      }
-    },
+    onError: (err, documentId, context) => {},
     onSettled: () => {
       queryClient.invalidateQueries({ queryKey: ['documents'] });
killedBy: useDocuments hooks useToggleStar should handle optimistic update error rollback correctly
statusReason: expected [ { id: 'doc1', starred: true } ] to deeply equal [ { id: 'doc1', starred: false } ]

[Killed] BlockStatement
src/hooks/useDocuments.ts:75:37
       return { previousQueries };
     },
     onError: (err, documentId, context) => {
-      if (context?.previousQueries) {
-        context.previousQueries.forEach(([queryKey, data]) => {
-          queryClient.setQueryData(queryKey, data);
-        });
-      }
+      if (context?.previousQueries) {}
     },
     onSettled: () => {
killedBy: useDocuments hooks useToggleStar should handle optimistic update error rollback correctly
statusReason: expected [ { id: 'doc1', starred: true } ] to deeply equal [ { id: 'doc1', starred: false } ]

[Killed] ConditionalExpression
src/hooks/useDocuments.ts:75:11
       return { previousQueries };
     },
     onError: (err, documentId, context) => {
-      if (context?.previousQueries) {
+      if (false) {
         context.previousQueries.forEach(([queryKey, data]) => {
           queryClient.setQueryData(queryKey, data);
killedBy: useDocuments hooks useToggleStar should handle optimistic update error rollback correctly
statusReason: expected [ { id: 'doc1', starred: true } ] to deeply equal [ { id: 'doc1', starred: false } ]

[Killed] BlockStatement
src/hooks/useDocuments.ts:76:63
     },
     onError: (err, documentId, context) => {
       if (context?.previousQueries) {
-        context.previousQueries.forEach(([queryKey, data]) => {
-          queryClient.setQueryData(queryKey, data);
-        });
+        context.previousQueries.forEach(([queryKey, data]) => {});
       }
     },
killedBy: useDocuments hooks useToggleStar should handle optimistic update error rollback correctly
statusReason: expected [ { id: 'doc1', starred: true } ] to deeply equal [ { id: 'doc1', starred: false } ]

[Survived] BlockStatement
src/hooks/useDocuments.ts:81:22
         });
       }
     },
-    onSettled: () => {
-      queryClient.invalidateQueries({ queryKey: ['documents'] });
-    },
+    onSettled: () => {},
   });
 };

[Killed] BlockStatement
src/hooks/useDocuments.ts:87:53
   });
 };
 
-export const useComments = (documentId?: string) => {
-  return useQuery({
-    queryKey: ['comments', documentId],
-    queryFn: async () => {
-      if (!documentId) return [];
-      const res = await getComments(documentId);
-      if (!res.sucesso) throw new Error(res.mensagem);
-      return res.dados;
-    },
-    enabled: !!documentId,
-  });
-};
+export const useComments = (documentId?: string) => {};
 
 export const useAddComment = (documentId: string) => {
killedBy: useDocuments hooks useComments should successfully get comments when documentId provided
statusReason: Cannot read properties of undefined (reading 'isSuccess')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Survived] ArrayDeclaration
src/hooks/useDocuments.ts:89:15
 
 export const useComments = (documentId?: string) => {
   return useQuery({
-    queryKey: ['comments', documentId],
+    queryKey: [],
     queryFn: async () => {
       if (!documentId) return [];

[Killed] BlockStatement
src/hooks/useDocuments.ts:90:26
 export const useComments = (documentId?: string) => {
   return useQuery({
     queryKey: ['comments', documentId],
-    queryFn: async () => {
-      if (!documentId) return [];
-      const res = await getComments(documentId);
-      if (!res.sucesso) throw new Error(res.mensagem);
-      return res.dados;
-    },
+    queryFn: async () => {},
     enabled: !!documentId,
   });
killedBy: useDocuments hooks useComments should successfully get comments when documentId provided
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/hooks/useDocuments.ts:91:11
   return useQuery({
     queryKey: ['comments', documentId],
     queryFn: async () => {
-      if (!documentId) return [];
+      if (true) return [];
       const res = await getComments(documentId);
       if (!res.sucesso) throw new Error(res.mensagem);
killedBy: useDocuments hooks useComments should successfully get comments when documentId provided
statusReason: expected [] to deeply equal [ 'comm1' ]

[Killed] ConditionalExpression
src/hooks/useDocuments.ts:91:11
   return useQuery({
     queryKey: ['comments', documentId],
     queryFn: async () => {
-      if (!documentId) return [];
+      if (false) return [];
       const res = await getComments(documentId);
       if (!res.sucesso) throw new Error(res.mensagem);
killedBy: useDocuments hooks useComments should return empty array if documentId not provided (though disabled)
statusReason: expected undefined to deeply equal []

[Killed] BooleanLiteral
src/hooks/useDocuments.ts:93:11
     queryFn: async () => {
       if (!documentId) return [];
       const res = await getComments(documentId);
-      if (!res.sucesso) throw new Error(res.mensagem);
+      if (res.sucesso) throw new Error(res.mensagem);
       return res.dados;
     },
killedBy: useDocuments hooks useComments should successfully get comments when documentId provided
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/hooks/useDocuments.ts:93:11
     queryFn: async () => {
       if (!documentId) return [];
       const res = await getComments(documentId);
-      if (!res.sucesso) throw new Error(res.mensagem);
+      if (false) throw new Error(res.mensagem);
       return res.dados;
     },
killedBy: useDocuments hooks useComments should throw error when get comments fails
statusReason: expected '["comments","doc1"] data is undefined' to be 'Error' // Object.is equality

[Killed] BooleanLiteral
src/hooks/useDocuments.ts:96:15
       if (!res.sucesso) throw new Error(res.mensagem);
       return res.dados;
     },
-    enabled: !!documentId,
+    enabled: !documentId,
   });
 };
killedBy: useDocuments hooks useComments should successfully get comments when documentId provided
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/hooks/useDocuments.ts:104:44
   const queryClient = useQueryClient();
 
   return useMutation({
-    mutationFn: async (content: string) => {
-      const res = await addComment(documentId, content);
-      if (!res.sucesso) throw new Error(res.mensagem);
-      return res.dados;
-    },
+    mutationFn: async (content: string) => {},
     onMutate: async (newContent) => {
       await queryClient.cancelQueries({ queryKey: ['comments', documentId] });
killedBy: useDocuments hooks useAddComment should successfully add comment
statusReason: expected undefined to be 'ok' // Object.is equality

[Killed] ConditionalExpression
src/hooks/useDocuments.ts:106:11
   return useMutation({
     mutationFn: async (content: string) => {
       const res = await addComment(documentId, content);
-      if (!res.sucesso) throw new Error(res.mensagem);
+      if (false) throw new Error(res.mensagem);
       return res.dados;
     },
killedBy: useDocuments hooks useAddComment should throw error when add comment fails
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
src/hooks/useDocuments.ts:106:11
   return useMutation({
     mutationFn: async (content: string) => {
       const res = await addComment(documentId, content);
-      if (!res.sucesso) throw new Error(res.mensagem);
+      if (res.sucesso) throw new Error(res.mensagem);
       return res.dados;
     },
killedBy: useDocuments hooks useAddComment should successfully add comment
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/hooks/useDocuments.ts:109:37
       if (!res.sucesso) throw new Error(res.mensagem);
       return res.dados;
     },
-    onMutate: async (newContent) => {
-      await queryClient.cancelQueries({ queryKey: ['comments', documentId] });
-      const previousComments = queryClient.getQueryData(['comments', documentId]);
-
-      queryClient.setQueryData(['comments', documentId], (old: any) => [
-        ...(old || []),
-        {
-          id: Math.random().toString(), // fake id for optimistic UI
-          content: newContent,
-          createdAt: new Date().toISOString(),
-          authorName: 'Você', // optimistically assumed
-        },
-      ]);
-      return { previousComments };
-    },
+    onMutate: async (newContent) => {},
     onError: (err, newContent, context) => {
       if (context?.previousComments) {
killedBy: useDocuments hooks useAddComment should handle optimistic update rollback correctly without previous data
statusReason: Target cannot be null or undefined.
