[Survived] ObjectLiteral
src/hooks/useDocuments.ts:110:39
       return res.dados;
     },
     onMutate: async (newContent) => {
-      await queryClient.cancelQueries({ queryKey: ['comments', documentId] });
+      await queryClient.cancelQueries({});
       const previousComments = queryClient.getQueryData(['comments', documentId]);
 

[Killed] ArrowFunction
src/hooks/useDocuments.ts:113:58
       await queryClient.cancelQueries({ queryKey: ['comments', documentId] });
       const previousComments = queryClient.getQueryData(['comments', documentId]);
 
-      queryClient.setQueryData(['comments', documentId], (old: any) => [
-        ...(old || []),
-        {
-          id: Math.random().toString(), // fake id for optimistic UI
-          content: newContent,
-          createdAt: new Date().toISOString(),
-          authorName: 'Você', // optimistically assumed
-        },
-      ]);
+      queryClient.setQueryData(['comments', documentId], () => undefined);
       return { previousComments };
     },
killedBy: useDocuments hooks useAddComment should handle optimistic update rollback correctly without previous data
statusReason: Target cannot be null or undefined.

[Killed] ArrayDeclaration
src/hooks/useDocuments.ts:113:72
       await queryClient.cancelQueries({ queryKey: ['comments', documentId] });
       const previousComments = queryClient.getQueryData(['comments', documentId]);
 
-      queryClient.setQueryData(['comments', documentId], (old: any) => [
-        ...(old || []),
-        {
-          id: Math.random().toString(), // fake id for optimistic UI
-          content: newContent,
-          createdAt: new Date().toISOString(),
-          authorName: 'Você', // optimistically assumed
-        },
-      ]);
+      queryClient.setQueryData(['comments', documentId], (old: any) => []);
       return { previousComments };
     },
killedBy: useDocuments hooks useAddComment should handle optimistic update rollback correctly without previous data
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/hooks/useDocuments.ts:114:13
       const previousComments = queryClient.getQueryData(['comments', documentId]);
 
       queryClient.setQueryData(['comments', documentId], (old: any) => [
-        ...(old || []),
+        ...(true),
         {
           id: Math.random().toString(), // fake id for optimistic UI
killedBy: useDocuments hooks useAddComment should successfully add comment
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/hooks/useDocuments.ts:114:13
       const previousComments = queryClient.getQueryData(['comments', documentId]);
 
       queryClient.setQueryData(['comments', documentId], (old: any) => [
-        ...(old || []),
+        ...(false),
         {
           id: Math.random().toString(), // fake id for optimistic UI
killedBy: useDocuments hooks useAddComment should successfully add comment
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ObjectLiteral
src/hooks/useDocuments.ts:122:14
           authorName: 'Você', // optimistically assumed
         },
       ]);
-      return { previousComments };
+      return {};
     },
     onError: (err, newContent, context) => {
killedBy: useDocuments hooks useAddComment should handle optimistic update error rollback correctly
statusReason: expected [ { id: '1', content: 'c' }, …(1) ] to deeply equal [ { id: '1', content: 'c' } ]

[Killed] BlockStatement
src/hooks/useDocuments.ts:124:44
       ]);
       return { previousComments };
     },
-    onError: (err, newContent, context) => {
-      if (context?.previousComments) {
-        queryClient.setQueryData(['comments', documentId], context.previousComments);
-      }
-    },
+    onError: (err, newContent, context) => {},
     onSettled: () => {
       queryClient.invalidateQueries({ queryKey: ['comments', documentId] });
killedBy: useDocuments hooks useAddComment should handle optimistic update error rollback correctly
statusReason: expected [ { id: '1', content: 'c' }, { …(4) } ] to deeply equal [ { id: '1', content: 'c' } ]

[Killed] BlockStatement
src/hooks/useDocuments.ts:125:38
       return { previousComments };
     },
     onError: (err, newContent, context) => {
-      if (context?.previousComments) {
-        queryClient.setQueryData(['comments', documentId], context.previousComments);
-      }
+      if (context?.previousComments) {}
     },
     onSettled: () => {
killedBy: useDocuments hooks useAddComment should handle optimistic update error rollback correctly
statusReason: expected [ { id: '1', content: 'c' }, …(1) ] to deeply equal [ { id: '1', content: 'c' } ]

[Killed] ConditionalExpression
src/hooks/useDocuments.ts:125:11
       return { previousComments };
     },
     onError: (err, newContent, context) => {
-      if (context?.previousComments) {
+      if (false) {
         queryClient.setQueryData(['comments', documentId], context.previousComments);
       }
killedBy: useDocuments hooks useAddComment should handle optimistic update error rollback correctly
statusReason: expected [ { id: '1', content: 'c' }, …(1) ] to deeply equal [ { id: '1', content: 'c' } ]

[Survived] BlockStatement
src/hooks/useDocuments.ts:129:22
         queryClient.setQueryData(['comments', documentId], context.previousComments);
       }
     },
-    onSettled: () => {
-      queryClient.invalidateQueries({ queryKey: ['comments', documentId] });
-    },
+    onSettled: () => {},
   });
 };

[Survived] ArrayDeclaration
src/hooks/useDocuments.ts:130:49
       }
     },
     onSettled: () => {
-      queryClient.invalidateQueries({ queryKey: ['comments', documentId] });
+      queryClient.invalidateQueries({ queryKey: [] });
     },
   });
