[Killed] BlockStatement
src/hooks/useProjects.ts:4:34
 import { useQuery } from '@tanstack/react-query';
 import { getProjects } from '../services/api';
 
-export const useProjects = () => {
-  return useQuery({
-    queryKey: ['projects'],
-    queryFn: async () => {
-      const res = await getProjects();
-      if (!res.sucesso) throw new Error(res.mensagem);
-      return res.dados || [];
-    },
-    staleTime: 5 * 60 * 1000, // 5 minutos
-  });
-};
+export const useProjects = () => {};
 
killedBy: useProjects hook should successfully fetch projects
statusReason: Cannot read properties of undefined (reading 'isSuccess')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Survived] ArrayDeclaration
src/hooks/useProjects.ts:6:15
 
 export const useProjects = () => {
   return useQuery({
-    queryKey: ['projects'],
+    queryKey: [],
     queryFn: async () => {
       const res = await getProjects();

[Killed] BlockStatement
src/hooks/useProjects.ts:7:26
 export const useProjects = () => {
   return useQuery({
     queryKey: ['projects'],
-    queryFn: async () => {
-      const res = await getProjects();
-      if (!res.sucesso) throw new Error(res.mensagem);
-      return res.dados || [];
-    },
+    queryFn: async () => {},
     staleTime: 5 * 60 * 1000, // 5 minutos
   });
killedBy: useProjects hook should successfully fetch projects
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
src/hooks/useProjects.ts:9:11
     queryKey: ['projects'],
     queryFn: async () => {
       const res = await getProjects();
-      if (!res.sucesso) throw new Error(res.mensagem);
+      if (res.sucesso) throw new Error(res.mensagem);
       return res.dados || [];
     },
killedBy: useProjects hook should successfully fetch projects
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/hooks/useProjects.ts:9:11
     queryKey: ['projects'],
     queryFn: async () => {
       const res = await getProjects();
-      if (!res.sucesso) throw new Error(res.mensagem);
+      if (false) throw new Error(res.mensagem);
       return res.dados || [];
     },
killedBy: useProjects hook should throw error when fetching fails
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] LogicalOperator
src/hooks/useProjects.ts:10:14
     queryFn: async () => {
       const res = await getProjects();
       if (!res.sucesso) throw new Error(res.mensagem);
-      return res.dados || [];
+      return res.dados && [];
     },
     staleTime: 5 * 60 * 1000, // 5 minutos
killedBy: useProjects hook should successfully fetch projects
statusReason: expected [] to deeply equal [ { id: '1', name: 'Proj', …(1) } ]

[Killed] ConditionalExpression
src/hooks/useProjects.ts:10:14
     queryFn: async () => {
       const res = await getProjects();
       if (!res.sucesso) throw new Error(res.mensagem);
-      return res.dados || [];
+      return false;
     },
     staleTime: 5 * 60 * 1000, // 5 minutos
killedBy: useProjects hook should successfully fetch projects
statusReason: expected false to deeply equal [ { id: '1', name: 'Proj', …(1) } ]

[Survived] ArithmeticOperator
src/hooks/useProjects.ts:12:16
       if (!res.sucesso) throw new Error(res.mensagem);
       return res.dados || [];
     },
-    staleTime: 5 * 60 * 1000, // 5 minutos
+    staleTime: 5 * 60 / 1000, // 5 minutos
   });
 };

[Survived] ArithmeticOperator
src/hooks/useProjects.ts:12:16
       if (!res.sucesso) throw new Error(res.mensagem);
       return res.dados || [];
     },
-    staleTime: 5 * 60 * 1000, // 5 minutos
+    staleTime: 5 / 60 * 1000, // 5 minutos
   });
 };
