[Killed] BooleanLiteral
src/components/DatasetPreview.tsx:10:42
 
 const DatasetPreview: React.FC<DatasetPreviewProps> = ({ url, type }) => {
   const [content, setContent] = useState<string | null>(null);
-  const [loading, setLoading] = useState(true);
+  const [loading, setLoading] = useState(false);
   const [error, setError] = useState<string | null>(null);
 
killedBy: DatasetPreview does nothing if url is empty
statusReason: Unable to find an element with the text: Carregando dados do dataset.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="padding: 2rem; text-align: center; color: rgb(220, 53, 69); display: flex; flex-direc

[Killed] BooleanLiteral
src/components/DatasetPreview.tsx:14:21
   const [error, setError] = useState<string | null>(null);
 
   useEffect(() => {
-    let isMounted = true;
+    let isMounted = false;
     
     const fetchContent = async () => {
killedBy: DatasetPreview renders CSV data correctly
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  style="padding: 2rem; text-align: center; color: rgb(100, 116, 139); display: flex; align-items: center; justify-content: center; height: 100%;"
>
  Carregando dados do dataset...
</div> instead

[Killed] BlockStatement
src/components/DatasetPreview.tsx:16:38
   useEffect(() => {
     let isMounted = true;
     
-    const fetchContent = async () => {
-      try {
-        setLoading(true);
-        setError(null);
-        const response = await fetch(url);
-        
-        if (!response.ok) {
-          throw new Error(`Falha no download (Status: ${response.status})`);
-        }
-        
-        const text = await response.text();
-        if (isMounted) {
-          setContent(text);
-        }
-      } catch (err: any) {
-        if (isMounted) {
-          setError(err.message || 'Erro ao processar o dataset.');
-        }
-      } finally {
-        if (isMounted) {
-          setLoading(false);
-        }
-      }
-    };
+    const fetchContent = async () => {};
 
     if (url) {
killedBy: DatasetPreview renders CSV data correctly
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  style="padding: 2rem; text-align: center; color: rgb(100, 116, 139); display: flex; align-items: center; justify-content: center; height: 100%;"
>
  Carregando dados do dataset...
</div> instead

[Killed] BlockStatement
src/components/DatasetPreview.tsx:17:11
     let isMounted = true;
     
     const fetchContent = async () => {
-      try {
-        setLoading(true);
-        setError(null);
-        const response = await fetch(url);
-        
-        if (!response.ok) {
-          throw new Error(`Falha no download (Status: ${response.status})`);
-        }
-        
-        const text = await response.text();
-        if (isMounted) {
-          setContent(text);
-        }
-      } catch (err: any) {
+      try {} catch (err: any) {
         if (isMounted) {
           setError(err.message || 'Erro ao processar o dataset.');
killedBy: DatasetPreview shows loading state initially
statusReason: Unable to find an element with the text: Carregando dados do dataset.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="padding: 2rem; text-align: center; color: rgb(220, 53, 69); display: flex; align-item

[Killed] BooleanLiteral
src/components/DatasetPreview.tsx:18:20
     
     const fetchContent = async () => {
       try {
-        setLoading(true);
+        setLoading(false);
         setError(null);
         const response = await fetch(url);
killedBy: DatasetPreview shows loading state initially
statusReason: Unable to find an element with the text: Carregando dados do dataset.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="padding: 2rem; text-align: center; color: rgb(220, 53, 69); display: flex; align-item

[Killed] BlockStatement
src/components/DatasetPreview.tsx:22:27
         setError(null);
         const response = await fetch(url);
         
-        if (!response.ok) {
-          throw new Error(`Falha no download (Status: ${response.status})`);
-        }
+        if (!response.ok) {}
         
         const text = await response.text();
killedBy: DatasetPreview handles fetch errors
statusReason: Unable to find an element with the text: Falha no download (Status: 404). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="padding: 2rem; text-align: center; color: rgb(220, 53, 69); display: flex; align-ite

[Killed] BooleanLiteral
src/components/DatasetPreview.tsx:22:13
         setError(null);
         const response = await fetch(url);
         
-        if (!response.ok) {
+        if (response.ok) {
           throw new Error(`Falha no download (Status: ${response.status})`);
         }
killedBy: DatasetPreview renders CSV data correctly
statusReason: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="padding: 2rem; text-align: center; color: rgb(220, 53, 69); display: flex; align-items: center; justify-content:

[Killed] ConditionalExpression
src/components/DatasetPreview.tsx:27:13
         }
         
         const text = await response.text();
-        if (isMounted) {
+        if (false) {
           setContent(text);
         }
killedBy: DatasetPreview renders CSV data correctly
statusReason: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="padding: 2rem; text-align: center; color: rgb(220, 53, 69); display: flex; align-items: center; justify-content:

[Killed] BlockStatement
src/components/DatasetPreview.tsx:27:24
         }
         
         const text = await response.text();
-        if (isMounted) {
-          setContent(text);
-        }
+        if (isMounted) {}
       } catch (err: any) {
         if (isMounted) {
killedBy: DatasetPreview renders CSV data correctly
statusReason: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="padding: 2rem; text-align: center; color: rgb(220, 53, 69); display: flex; align-items: center; justify-content:

[Killed] BlockStatement
src/components/DatasetPreview.tsx:30:26
         if (isMounted) {
           setContent(text);
         }
-      } catch (err: any) {
-        if (isMounted) {
-          setError(err.message || 'Erro ao processar o dataset.');
-        }
-      } finally {
+      } catch (err: any) {} finally {
         if (isMounted) {
           setLoading(false);
killedBy: DatasetPreview handles fetch errors
statusReason: Unable to find an element with the text: Falha no download (Status: 404). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="padding: 2rem; text-align: center; color: rgb(220, 53, 69); display: flex; align-ite

[Killed] BlockStatement
src/components/DatasetPreview.tsx:31:24
           setContent(text);
         }
       } catch (err: any) {
-        if (isMounted) {
-          setError(err.message || 'Erro ao processar o dataset.');
-        }
+        if (isMounted) {}
       } finally {
         if (isMounted) {
killedBy: DatasetPreview handles fetch errors
statusReason: Unable to find an element with the text: Falha no download (Status: 404). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="padding: 2rem; text-align: center; color: rgb(220, 53, 69); display: flex; align-ite

[Killed] ConditionalExpression
src/components/DatasetPreview.tsx:31:13
           setContent(text);
         }
       } catch (err: any) {
-        if (isMounted) {
+        if (false) {
           setError(err.message || 'Erro ao processar o dataset.');
         }
killedBy: DatasetPreview handles fetch errors
statusReason: Unable to find an element with the text: Falha no download (Status: 404). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="padding: 2rem; text-align: center; color: rgb(220, 53, 69); display: flex; align-ite

[Killed] ConditionalExpression
src/components/DatasetPreview.tsx:32:20
         }
       } catch (err: any) {
         if (isMounted) {
-          setError(err.message || 'Erro ao processar o dataset.');
+          setError(true);
         }
       } finally {
killedBy: DatasetPreview handles fetch errors
statusReason: Unable to find an element with the text: Falha no download (Status: 404). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="padding: 2rem; text-align: center; color: rgb(220, 53, 69); display: flex; align-ite

[Killed] ConditionalExpression
src/components/DatasetPreview.tsx:32:20
         }
       } catch (err: any) {
         if (isMounted) {
-          setError(err.message || 'Erro ao processar o dataset.');
+          setError(false);
         }
       } finally {
killedBy: DatasetPreview handles fetch errors
statusReason: Unable to find an element with the text: Falha no download (Status: 404). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="padding: 2rem; text-align: center; color: rgb(220, 53, 69); display: flex; align-ite

[Killed] BlockStatement
src/components/DatasetPreview.tsx:34:17
         if (isMounted) {
           setError(err.message || 'Erro ao processar o dataset.');
         }
-      } finally {
-        if (isMounted) {
-          setLoading(false);
-        }
-      }
+      } finally {}
     };
 
killedBy: DatasetPreview renders CSV data correctly
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  style="padding: 2rem; text-align: center; color: rgb(100, 116, 139); display: flex; align-items: center; justify-content: center; height: 100%;"
>
  Carregando dados do dataset...
</div> instead

[Killed] BlockStatement
src/components/DatasetPreview.tsx:35:24
           setError(err.message || 'Erro ao processar o dataset.');
         }
       } finally {
-        if (isMounted) {
-          setLoading(false);
-        }
+        if (isMounted) {}
       }
     };
killedBy: DatasetPreview renders CSV data correctly
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  style="padding: 2rem; text-align: center; color: rgb(100, 116, 139); display: flex; align-items: center; justify-content: center; height: 100%;"
>
  Carregando dados do dataset...
</div> instead

[Killed] ConditionalExpression
src/components/DatasetPreview.tsx:35:13
           setError(err.message || 'Erro ao processar o dataset.');
         }
       } finally {
-        if (isMounted) {
+        if (false) {
           setLoading(false);
         }
killedBy: DatasetPreview renders CSV data correctly
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  style="padding: 2rem; text-align: center; color: rgb(100, 116, 139); display: flex; align-items: center; justify-content: center; height: 100%;"
>
  Carregando dados do dataset...
</div> instead

[Killed] BooleanLiteral
src/components/DatasetPreview.tsx:36:22
         }
       } finally {
         if (isMounted) {
-          setLoading(false);
+          setLoading(true);
         }
       }
killedBy: DatasetPreview renders CSV data correctly
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  style="padding: 2rem; text-align: center; color: rgb(100, 116, 139); display: flex; align-items: center; justify-content: center; height: 100%;"
>
  Carregando dados do dataset...
</div> instead

[Killed] ConditionalExpression
src/components/DatasetPreview.tsx:41:9
       }
     };
 
-    if (url) {
+    if (true) {
       fetchContent();
     }
killedBy: DatasetPreview does nothing if url is empty
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "",

[Killed] BlockStatement
src/components/DatasetPreview.tsx:41:14
       }
     };
 
-    if (url) {
-      fetchContent();
-    }
+    if (url) {}
 
     return () => {
killedBy: DatasetPreview renders CSV data correctly
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  style="padding: 2rem; text-align: center; color: rgb(100, 116, 139); display: flex; align-items: center; justify-content: center; height: 100%;"
>
  Carregando dados do dataset...
</div> instead

[Survived] BlockStatement
src/components/DatasetPreview.tsx:45:18
       fetchContent();
     }
 
-    return () => {
-      isMounted = false;
-    };
+    return () => {};
   }, [url]);
 

[Survived] BooleanLiteral
src/components/DatasetPreview.tsx:46:19
     }
 
     return () => {
-      isMounted = false;
+      isMounted = true;
     };
   }, [url]);

[Killed] BlockStatement
src/components/DatasetPreview.tsx:50:16
     };
   }, [url]);
 
-  if (loading) {
-    return (
-      <div style={{ padding: '2rem', textAlign: 'center', color: '#64748B', display: 'flex', alignItems: 'center', justifyContent: 'center', height: '100%' }}>
-        Carregando dados do dataset...
-      </div>
-    );
-  }
+  if (loading) {}
 
   if (error || !content) {
killedBy: DatasetPreview shows loading state initially
statusReason: Unable to find an element with the text: Carregando dados do dataset.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="padding: 2rem; text-align: center; color: rgb(220, 53, 69); display: flex; flex-direc

[Survived] StringLiteral
src/components/DatasetPreview.tsx:52:86
 
   if (loading) {
     return (
-      <div style={{ padding: '2rem', textAlign: 'center', color: '#64748B', display: 'flex', alignItems: 'center', justifyContent: 'center', height: '100%' }}>
+      <div style={{ padding: '2rem', textAlign: 'center', color: '#64748B', display: "", alignItems: 'center', justifyContent: 'center', height: '100%' }}>
         Carregando dados do dataset...
       </div>

[Survived] ObjectLiteral
src/components/DatasetPreview.tsx:52:19
 
   if (loading) {
     return (
-      <div style={{ padding: '2rem', textAlign: 'center', color: '#64748B', display: 'flex', alignItems: 'center', justifyContent: 'center', height: '100%' }}>
+      <div style={{}}>
         Carregando dados do dataset...
       </div>

[Killed] ConditionalExpression
src/components/DatasetPreview.tsx:58:7
     );
   }
 
-  if (error || !content) {
+  if (true) {
     return (
       <div style={{ padding: '2rem', textAlign: 'center', color: '#dc3545', display: 'flex', flexDirection: 'column', alignItems: 'center', justifyContent: 'center', height: '100%' }}>
killedBy: DatasetPreview renders CSV data correctly
statusReason: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="padding: 2rem; text-align: center; color: rgb(220, 53, 69); display: flex; align-items: center; justify-content:

[Killed] ConditionalExpression
src/components/DatasetPreview.tsx:58:7
     );
   }
 
-  if (error || !content) {
+  if (false) {
     return (
       <div style={{ padding: '2rem', textAlign: 'center', color: '#dc3545', display: 'flex', flexDirection: 'column', alignItems: 'center', justifyContent: 'center', height: '100%' }}>
killedBy: DatasetPreview handles fetch errors
statusReason: Unable to find an element with the text: Falha no download (Status: 404). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Survived] StringLiteral
src/components/DatasetPreview.tsx:60:175
 
   if (error || !content) {
     return (
-      <div style={{ padding: '2rem', textAlign: 'center', color: '#dc3545', display: 'flex', flexDirection: 'column', alignItems: 'center', justifyContent: 'center', height: '100%' }}>
+      <div style={{ padding: '2rem', textAlign: 'center', color: '#dc3545', display: 'flex', flexDirection: 'column', alignItems: 'center', justifyContent: 'center', height: "" }}>
         <i className="bi bi-exclamation-triangle" style={{ fontSize: '2rem', marginBottom: '1rem' }}></i>
         <p>{error || 'Conteúdo vazio'}</p>

[Survived] StringLiteral
src/components/DatasetPreview.tsx:60:49
 
   if (error || !content) {
     return (
-      <div style={{ padding: '2rem', textAlign: 'center', color: '#dc3545', display: 'flex', flexDirection: 'column', alignItems: 'center', justifyContent: 'center', height: '100%' }}>
+      <div style={{ padding: '2rem', textAlign: "", color: '#dc3545', display: 'flex', flexDirection: 'column', alignItems: 'center', justifyContent: 'center', height: '100%' }}>
         <i className="bi bi-exclamation-triangle" style={{ fontSize: '2rem', marginBottom: '1rem' }}></i>
         <p>{error || 'Conteúdo vazio'}</p>

[Survived] StringLiteral
src/components/DatasetPreview.tsx:61:70
   if (error || !content) {
     return (
       <div style={{ padding: '2rem', textAlign: 'center', color: '#dc3545', display: 'flex', flexDirection: 'column', alignItems: 'center', justifyContent: 'center', height: '100%' }}>
-        <i className="bi bi-exclamation-triangle" style={{ fontSize: '2rem', marginBottom: '1rem' }}></i>
+        <i className="bi bi-exclamation-triangle" style={{ fontSize: "", marginBottom: '1rem' }}></i>
         <p>{error || 'Conteúdo vazio'}</p>
         <a href={url} target="_blank" rel="noopener noreferrer" style={{ marginTop: '1rem', color: 'var(--ed-purple)' }}>

[Survived] ObjectLiteral
src/components/DatasetPreview.tsx:61:58
   if (error || !content) {
     return (
       <div style={{ padding: '2rem', textAlign: 'center', color: '#dc3545', display: 'flex', flexDirection: 'column', alignItems: 'center', justifyContent: 'center', height: '100%' }}>
-        <i className="bi bi-exclamation-triangle" style={{ fontSize: '2rem', marginBottom: '1rem' }}></i>
+        <i className="bi bi-exclamation-triangle" style={{}}></i>
         <p>{error || 'Conteúdo vazio'}</p>
         <a href={url} target="_blank" rel="noopener noreferrer" style={{ marginTop: '1rem', color: 'var(--ed-purple)' }}>

[Killed] LogicalOperator
src/components/DatasetPreview.tsx:62:13
     return (
       <div style={{ padding: '2rem', textAlign: 'center', color: '#dc3545', display: 'flex', flexDirection: 'column', alignItems: 'center', justifyContent: 'center', height: '100%' }}>
         <i className="bi bi-exclamation-triangle" style={{ fontSize: '2rem', marginBottom: '1rem' }}></i>
-        <p>{error || 'Conteúdo vazio'}</p>
+        <p>{error && 'Conteúdo vazio'}</p>
         <a href={url} target="_blank" rel="noopener noreferrer" style={{ marginTop: '1rem', color: 'var(--ed-purple)' }}>
           Baixar Arquivo Diretamente
killedBy: DatasetPreview handles fetch errors
statusReason: Unable to find an element with the text: Falha no download (Status: 404). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="padding: 2rem; text-align: center; color: rgb(220, 53, 69); display: flex; align-ite

[Killed] ConditionalExpression
src/components/DatasetPreview.tsx:62:13
     return (
       <div style={{ padding: '2rem', textAlign: 'center', color: '#dc3545', display: 'flex', flexDirection: 'column', alignItems: 'center', justifyContent: 'center', height: '100%' }}>
         <i className="bi bi-exclamation-triangle" style={{ fontSize: '2rem', marginBottom: '1rem' }}></i>
-        <p>{error || 'Conteúdo vazio'}</p>
+        <p>{true}</p>
         <a href={url} target="_blank" rel="noopener noreferrer" style={{ marginTop: '1rem', color: 'var(--ed-purple)' }}>
           Baixar Arquivo Diretamente
killedBy: DatasetPreview handles fetch errors
statusReason: Unable to find an element with the text: Falha no download (Status: 404). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="padding: 2rem; text-align: center; color: rgb(220, 53, 69); display: flex; align-ite

[Survived] ObjectLiteral
src/components/DatasetPreview.tsx:63:72
       <div style={{ padding: '2rem', textAlign: 'center', color: '#dc3545', display: 'flex', flexDirection: 'column', alignItems: 'center', justifyContent: 'center', height: '100%' }}>
         <i className="bi bi-exclamation-triangle" style={{ fontSize: '2rem', marginBottom: '1rem' }}></i>
         <p>{error || 'Conteúdo vazio'}</p>
-        <a href={url} target="_blank" rel="noopener noreferrer" style={{ marginTop: '1rem', color: 'var(--ed-purple)' }}>
+        <a href={url} target="_blank" rel="noopener noreferrer" style={{}}>
           Baixar Arquivo Diretamente
         </a>

[Survived] StringLiteral
src/components/DatasetPreview.tsx:63:85
       <div style={{ padding: '2rem', textAlign: 'center', color: '#dc3545', display: 'flex', flexDirection: 'column', alignItems: 'center', justifyContent: 'center', height: '100%' }}>
         <i className="bi bi-exclamation-triangle" style={{ fontSize: '2rem', marginBottom: '1rem' }}></i>
         <p>{error || 'Conteúdo vazio'}</p>
-        <a href={url} target="_blank" rel="noopener noreferrer" style={{ marginTop: '1rem', color: 'var(--ed-purple)' }}>
+        <a href={url} target="_blank" rel="noopener noreferrer" style={{ marginTop: "", color: 'var(--ed-purple)' }}>
           Baixar Arquivo Diretamente
         </a>

[Killed] EqualityOperator
src/components/DatasetPreview.tsx:72:54
 
   const renderCsv = () => {
     // Simple CSV parser for MVP. Splits by newline, then by comma.
-    const lines = content.split('\n').filter(line => line.trim().length > 0);
+    const lines = content.split('\n').filter(line => line.trim().length >= 0);
     
     if (lines.length === 0) {
killedBy: DatasetPreview renders CSV data correctly
statusReason: Unable to find an element with the text: Exibindo 2 de 2 linhas.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="display: flex; height: 100%; width: 100%; flex-direction: column;"
    >

[Killed] EqualityOperator
src/components/DatasetPreview.tsx:72:54
 
   const renderCsv = () => {
     // Simple CSV parser for MVP. Splits by newline, then by comma.
-    const lines = content.split('\n').filter(line => line.trim().length > 0);
+    const lines = content.split('\n').filter(line => line.trim().length <= 0);
     
     if (lines.length === 0) {
killedBy: DatasetPreview renders CSV data correctly
statusReason: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="display: flex; height: 100%; width: 100%; flex-direction: column;"
    >

[Killed] ConditionalExpression
src/components/DatasetPreview.tsx:74:9
     // Simple CSV parser for MVP. Splits by newline, then by comma.
     const lines = content.split('\n').filter(line => line.trim().length > 0);
     
-    if (lines.length === 0) {
+    if (false) {
       return <div>Dataset CSV vazio.</div>;
     }
killedBy: DatasetPreview handles empty CSV
statusReason: Unable to find an element with the text: Dataset CSV vazio.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] EqualityOperator
src/components/DatasetPreview.tsx:74:9
     // Simple CSV parser for MVP. Splits by newline, then by comma.
     const lines = content.split('\n').filter(line => line.trim().length > 0);
     
-    if (lines.length === 0) {
+    if (lines.length !== 0) {
       return <div>Dataset CSV vazio.</div>;
     }
killedBy: DatasetPreview renders CSV data correctly
statusReason: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="display: flex; height: 100%; width: 100%; flex-direction: column;"
    >

[Killed] MethodExpression
src/components/DatasetPreview.tsx:79:18
     }
 
     const headers = lines[0].split(',');
-    const rows = lines.slice(1).map(line => line.split(','));
+    const rows = lines.map(line => line.split(','));
 
     // Limit to 100 rows to prevent extreme lag on huge files
killedBy: DatasetPreview renders CSV data correctly
statusReason: Found multiple elements with the text: id

Here are the matching elements:

Ignored nodes: comments, script, style
<th>
  id
</th>

[Killed] ArrowFunction
src/components/DatasetPreview.tsx:79:37
     }
 
     const headers = lines[0].split(',');
-    const rows = lines.slice(1).map(line => line.split(','));
+    const rows = lines.slice(1).map(() => undefined);
 
     // Limit to 100 rows to prevent extreme lag on huge files
killedBy: DatasetPreview renders CSV data correctly
statusReason: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] MethodExpression
src/components/DatasetPreview.tsx:83:25
 
     // Limit to 100 rows to prevent extreme lag on huge files
     const maxRows = 100;
-    const displayRows = rows.slice(0, maxRows);
+    const displayRows = rows;
 
     return (

[Survived] StringLiteral
src/components/DatasetPreview.tsx:86:84
     const displayRows = rows.slice(0, maxRows);
 
     return (
-      <div style={{ height: '100%', overflow: 'auto', padding: '1rem', background: '#fff' }}>
+      <div style={{ height: '100%', overflow: 'auto', padding: '1rem', background: "" }}>
         <p style={{ fontSize: '0.85rem', color: '#64748B', marginBottom: '1rem' }}>
           Exibindo {displayRows.length} de {rows.length} linhas...

[Survived] ObjectLiteral
src/components/DatasetPreview.tsx:86:19
     const displayRows = rows.slice(0, maxRows);
 
     return (
-      <div style={{ height: '100%', overflow: 'auto', padding: '1rem', background: '#fff' }}>
+      <div style={{}}>
         <p style={{ fontSize: '0.85rem', color: '#64748B', marginBottom: '1rem' }}>
           Exibindo {displayRows.length} de {rows.length} linhas...

[Survived] ObjectLiteral
src/components/DatasetPreview.tsx:87:19
 
     return (
       <div style={{ height: '100%', overflow: 'auto', padding: '1rem', background: '#fff' }}>
-        <p style={{ fontSize: '0.85rem', color: '#64748B', marginBottom: '1rem' }}>
+        <p style={{}}>
           Exibindo {displayRows.length} de {rows.length} linhas...
         </p>
