[Survived] StringLiteral
src/components/DatasetPreview.tsx:87:49
 
     return (
       <div style={{ height: '100%', overflow: 'auto', padding: '1rem', background: '#fff' }}>
-        <p style={{ fontSize: '0.85rem', color: '#64748B', marginBottom: '1rem' }}>
+        <p style={{ fontSize: '0.85rem', color: "", marginBottom: '1rem' }}>
           Exibindo {displayRows.length} de {rows.length} linhas...
         </p>

[Survived] StringLiteral
src/components/DatasetPreview.tsx:90:91
         <p style={{ fontSize: '0.85rem', color: '#64748B', marginBottom: '1rem' }}>
           Exibindo {displayRows.length} de {rows.length} linhas...
         </p>
-        <table className="table table-sm table-bordered table-striped" style={{ fontSize: '0.9rem', width: 'max-content', minWidth: '100%' }}>
+        <table className="table table-sm table-bordered table-striped" style={{ fontSize: "", width: 'max-content', minWidth: '100%' }}>
           <thead style={{ position: 'sticky', top: 0, background: '#f8fafc', zIndex: 1 }}>
             <tr>

[Survived] ObjectLiteral
src/components/DatasetPreview.tsx:91:25
           Exibindo {displayRows.length} de {rows.length} linhas...
         </p>
         <table className="table table-sm table-bordered table-striped" style={{ fontSize: '0.9rem', width: 'max-content', minWidth: '100%' }}>
-          <thead style={{ position: 'sticky', top: 0, background: '#f8fafc', zIndex: 1 }}>
+          <thead style={{}}>
             <tr>
               <th style={{ width: '40px', textAlign: 'center' }}>#</th>

[Survived] StringLiteral
src/components/DatasetPreview.tsx:93:54
         <table className="table table-sm table-bordered table-striped" style={{ fontSize: '0.9rem', width: 'max-content', minWidth: '100%' }}>
           <thead style={{ position: 'sticky', top: 0, background: '#f8fafc', zIndex: 1 }}>
             <tr>
-              <th style={{ width: '40px', textAlign: 'center' }}>#</th>
+              <th style={{ width: '40px', textAlign: "" }}>#</th>
               {headers.map((header, idx) => (
                 <th key={idx}>{header.trim()}</th>

[Killed] ArrowFunction
src/components/DatasetPreview.tsx:94:28
           <thead style={{ position: 'sticky', top: 0, background: '#f8fafc', zIndex: 1 }}>
             <tr>
               <th style={{ width: '40px', textAlign: 'center' }}>#</th>
-              {headers.map((header, idx) => (
-                <th key={idx}>{header.trim()}</th>
-              ))}
+              {headers.map(() => undefined)}
             </tr>
           </thead>
killedBy: DatasetPreview renders CSV data correctly
statusReason: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="display: flex; height: 100%; width: 100%; flex-direction: column;"
    >

[Survived] MethodExpression
src/components/DatasetPreview.tsx:95:32
             <tr>
               <th style={{ width: '40px', textAlign: 'center' }}>#</th>
               {headers.map((header, idx) => (
-                <th key={idx}>{header.trim()}</th>
+                <th key={idx}>{header}</th>
               ))}
             </tr>

[Killed] ArrowFunction
src/components/DatasetPreview.tsx:100:30
             </tr>
           </thead>
           <tbody>
-            {displayRows.map((row, rowIdx) => (
-              <tr key={rowIdx}>
-                <td style={{ color: '#94a3b8', textAlign: 'center' }}>{rowIdx + 1}</td>
-                {row.map((cell, cellIdx) => (
-                  <td key={cellIdx}>{cell.trim()}</td>
-                ))}
-              </tr>
-            ))}
+            {displayRows.map(() => undefined)}
           </tbody>
         </table>
killedBy: DatasetPreview renders CSV data correctly
statusReason: Unable to find an element with the text: Alice. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="display: flex; height: 100%; width: 100%; flex-direction: column;"
    >

[Survived] ArithmeticOperator
src/components/DatasetPreview.tsx:102:72
           <tbody>
             {displayRows.map((row, rowIdx) => (
               <tr key={rowIdx}>
-                <td style={{ color: '#94a3b8', textAlign: 'center' }}>{rowIdx + 1}</td>
+                <td style={{ color: '#94a3b8', textAlign: 'center' }}>{rowIdx - 1}</td>
                 {row.map((cell, cellIdx) => (
                   <td key={cellIdx}>{cell.trim()}</td>

[Killed] ArrowFunction
src/components/DatasetPreview.tsx:103:26
             {displayRows.map((row, rowIdx) => (
               <tr key={rowIdx}>
                 <td style={{ color: '#94a3b8', textAlign: 'center' }}>{rowIdx + 1}</td>
-                {row.map((cell, cellIdx) => (
-                  <td key={cellIdx}>{cell.trim()}</td>
-                ))}
+                {row.map(() => undefined)}
               </tr>
             ))}
killedBy: DatasetPreview renders CSV data correctly
statusReason: Unable to find an element with the text: Alice. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="display: flex; height: 100%; width: 100%; flex-direction: column;"
    >

[Survived] MethodExpression
src/components/DatasetPreview.tsx:104:38
               <tr key={rowIdx}>
                 <td style={{ color: '#94a3b8', textAlign: 'center' }}>{rowIdx + 1}</td>
                 {row.map((cell, cellIdx) => (
-                  <td key={cellIdx}>{cell.trim()}</td>
+                  <td key={cellIdx}>{cell}</td>
                 ))}
               </tr>

[Killed] BlockStatement
src/components/DatasetPreview.tsx:114:28
     );
   };
 
-  const renderJson = () => {
-    let parsedObj;
-    try {
-      parsedObj = JSON.parse(content);
-    } catch {
-      // If invalid JSON, just show as text
-      return (
-        <div style={{ height: '100%', overflow: 'auto', padding: '1rem', background: '#1e293b', color: '#f8fafc' }}>
-          <p style={{ color: '#ef4444' }}>Aviso: O arquivo não é um JSON válido.</p>
-          <pre style={{ margin: 0 }}>{content}</pre>
-        </div>
-      );
-    }
-
-    return (
-      <div style={{ height: '100%', overflow: 'auto', padding: '1rem', background: '#1e293b', color: '#f8fafc' }}>
-        <pre style={{ margin: 0, fontSize: '0.9rem', fontFamily: 'monospace' }}>
-          {JSON.stringify(parsedObj, null, 2)}
-        </pre>
-      </div>
-    );
-  };
+  const renderJson = () => {};
 
   const renderTextFallback = () => (
killedBy: DatasetPreview renders JSON data correctly
statusReason: Unable to find an element with the text: /"message": "hello"/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="display: flex; height: 100%; width: 100%; flex-direction: column;"
    />

[Killed] BlockStatement
src/components/DatasetPreview.tsx:116:9
 
   const renderJson = () => {
     let parsedObj;
-    try {
-      parsedObj = JSON.parse(content);
-    } catch {
+    try {} catch {
       // If invalid JSON, just show as text
       return (
killedBy: DatasetPreview renders JSON data correctly
statusReason: Unable to find an element with the text: /"message": "hello"/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="display: flex; height: 100%; width: 100%; flex-direction: column;"
    >

[Killed] BlockStatement
src/components/DatasetPreview.tsx:118:13
     let parsedObj;
     try {
       parsedObj = JSON.parse(content);
-    } catch {
-      // If invalid JSON, just show as text
-      return (
-        <div style={{ height: '100%', overflow: 'auto', padding: '1rem', background: '#1e293b', color: '#f8fafc' }}>
-          <p style={{ color: '#ef4444' }}>Aviso: O arquivo não é um JSON válido.</p>
-          <pre style={{ margin: 0 }}>{content}</pre>
-        </div>
-      );
-    }
+    } catch {}
 
     return (
killedBy: DatasetPreview renders JSON fallback on invalid JSON
statusReason: Unable to find an element with the text: Aviso: O arquivo não é um JSON válido.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="display: flex; height: 100%; width: 100%; flex-direction: column;"
    >

[Survived] StringLiteral
src/components/DatasetPreview.tsx:121:49
     } catch {
       // If invalid JSON, just show as text
       return (
-        <div style={{ height: '100%', overflow: 'auto', padding: '1rem', background: '#1e293b', color: '#f8fafc' }}>
+        <div style={{ height: '100%', overflow: "", padding: '1rem', background: '#1e293b', color: '#f8fafc' }}>
           <p style={{ color: '#ef4444' }}>Aviso: O arquivo não é um JSON válido.</p>
           <pre style={{ margin: 0 }}>{content}</pre>

[Survived] StringLiteral
src/components/DatasetPreview.tsx:121:104
     } catch {
       // If invalid JSON, just show as text
       return (
-        <div style={{ height: '100%', overflow: 'auto', padding: '1rem', background: '#1e293b', color: '#f8fafc' }}>
+        <div style={{ height: '100%', overflow: 'auto', padding: '1rem', background: '#1e293b', color: "" }}>
           <p style={{ color: '#ef4444' }}>Aviso: O arquivo não é um JSON válido.</p>
           <pre style={{ margin: 0 }}>{content}</pre>

[Survived] StringLiteral
src/components/DatasetPreview.tsx:129:84
     }
 
     return (
-      <div style={{ height: '100%', overflow: 'auto', padding: '1rem', background: '#1e293b', color: '#f8fafc' }}>
+      <div style={{ height: '100%', overflow: 'auto', padding: '1rem', background: "", color: '#f8fafc' }}>
         <pre style={{ margin: 0, fontSize: '0.9rem', fontFamily: 'monospace' }}>
           {JSON.stringify(parsedObj, null, 2)}

[Killed] ArrowFunction
src/components/DatasetPreview.tsx:137:30
     );
   };
 
-  const renderTextFallback = () => (
-    <div style={{ height: '100%', overflow: 'auto', padding: '1rem', background: '#fff' }}>
-      <pre style={{ margin: 0, fontSize: '0.9rem', fontFamily: 'monospace', whiteSpace: 'pre-wrap' }}>
-        {content}
-      </pre>
-    </div>
-  );
+  const renderTextFallback = () => undefined;
 
   return (
killedBy: DatasetPreview renders fallback for unknown type
statusReason: Unable to find an element with the text: Some text content. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="display: flex; height: 100%; width: 100%; flex-direction: column;"
    />

[Survived] StringLiteral
src/components/DatasetPreview.tsx:146:59
   );
 
   return (
-    <div style={{ height: '100%', width: '100%', display: 'flex', flexDirection: 'column' }}>
+    <div style={{ height: '100%', width: '100%', display: "", flexDirection: 'column' }}>
       {type === 'CSV' ? renderCsv() : type === 'JSON' ? renderJson() : renderTextFallback()}
     </div>

[Killed] ConditionalExpression
src/components/DatasetPreview.tsx:147:8
 
   return (
     <div style={{ height: '100%', width: '100%', display: 'flex', flexDirection: 'column' }}>
-      {type === 'CSV' ? renderCsv() : type === 'JSON' ? renderJson() : renderTextFallback()}
+      {true ? renderCsv() : type === 'JSON' ? renderJson() : renderTextFallback()}
     </div>
   );
killedBy: DatasetPreview renders JSON data correctly
statusReason: Unable to find an element with the text: /"message": "hello"/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="display: flex; height: 100%; width: 100%; flex-direction: column;"
    >

[Killed] ConditionalExpression
src/components/DatasetPreview.tsx:147:39
 
   return (
     <div style={{ height: '100%', width: '100%', display: 'flex', flexDirection: 'column' }}>
-      {type === 'CSV' ? renderCsv() : type === 'JSON' ? renderJson() : renderTextFallback()}
+      {type === 'CSV' ? renderCsv() : false ? renderJson() : renderTextFallback()}
     </div>
   );
killedBy: DatasetPreview renders JSON data correctly
statusReason: Unable to find an element with the text: /"message": "hello"/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="display: flex; height: 100%; width: 100%; flex-direction: column;"
    >
