[Survived] StringLiteral
src/components/DocumentComments.tsx:9:42
 }
 
 const DocumentComments: React.FC<DocumentCommentsProps> = ({ documentId }) => {
-  const [content, setContent] = useState('');
+  const [content, setContent] = useState("Stryker was here!");
   const { data: comments = [], isLoading } = useComments(documentId);
   const { mutateAsync: addComment, isPending } = useAddComment(documentId);

[Survived] BlockStatement
src/components/DocumentComments.tsx:14:19
   const { mutateAsync: addComment, isPending } = useAddComment(documentId);
   const messagesEndRef = useRef<HTMLDivElement>(null);
 
-  useEffect(() => {
-    messagesEndRef.current?.scrollIntoView({ behavior: 'smooth' });
-  }, [comments]);
+  useEffect(() => {}, [comments]);
 
   const handleSubmit = async (e: React.FormEvent) => {

[Survived] OptionalChaining
src/components/DocumentComments.tsx:15:5
   const messagesEndRef = useRef<HTMLDivElement>(null);
 
   useEffect(() => {
-    messagesEndRef.current?.scrollIntoView({ behavior: 'smooth' });
+    messagesEndRef.current.scrollIntoView({ behavior: 'smooth' });
   }, [comments]);
 

[Survived] StringLiteral
src/components/DocumentComments.tsx:15:56
   const messagesEndRef = useRef<HTMLDivElement>(null);
 
   useEffect(() => {
-    messagesEndRef.current?.scrollIntoView({ behavior: 'smooth' });
+    messagesEndRef.current?.scrollIntoView({ behavior: "" });
   }, [comments]);
 

[Killed] BlockStatement
src/components/DocumentComments.tsx:18:54
     messagesEndRef.current?.scrollIntoView({ behavior: 'smooth' });
   }, [comments]);
 
-  const handleSubmit = async (e: React.FormEvent) => {
-    e.preventDefault();
-    if (!content.trim()) return;
-    try {
-      await addComment(content);
-      setContent('');
-    } catch (err) {
-      console.error('Failed to post comment', err);
-    }
-  };
+  const handleSubmit = async (e: React.FormEvent) => {};
 
   return (
killedBy: DocumentComments submits a new comment
statusReason: expected "vi.fn()" to be called with arguments: [ 'New comment' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
src/components/DocumentComments.tsx:20:9
 
   const handleSubmit = async (e: React.FormEvent) => {
     e.preventDefault();
-    if (!content.trim()) return;
+    if (true) return;
     try {
       await addComment(content);
killedBy: DocumentComments submits a new comment
statusReason: expected "vi.fn()" to be called with arguments: [ 'New comment' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BooleanLiteral
src/components/DocumentComments.tsx:20:9
 
   const handleSubmit = async (e: React.FormEvent) => {
     e.preventDefault();
-    if (!content.trim()) return;
+    if (content.trim()) return;
     try {
       await addComment(content);
killedBy: DocumentComments submits a new comment
statusReason: expected "vi.fn()" to be called with arguments: [ 'New comment' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
src/components/DocumentComments.tsx:21:9
   const handleSubmit = async (e: React.FormEvent) => {
     e.preventDefault();
     if (!content.trim()) return;
-    try {
-      await addComment(content);
-      setContent('');
-    } catch (err) {
+    try {} catch (err) {
       console.error('Failed to post comment', err);
     }
killedBy: DocumentComments submits a new comment
statusReason: expected "vi.fn()" to be called with arguments: [ 'New comment' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
src/components/DocumentComments.tsx:23:18
     if (!content.trim()) return;
     try {
       await addComment(content);
-      setContent('');
+      setContent("Stryker was here!");
     } catch (err) {
       console.error('Failed to post comment', err);
killedBy: DocumentComments submits a new comment
statusReason: expect(element).toHaveValue()

Expected the element to have value:

Received:
  Stryker was here!

[Killed] BlockStatement
src/components/DocumentComments.tsx:24:19
     try {
       await addComment(content);
       setContent('');
-    } catch (err) {
-      console.error('Failed to post comment', err);
-    }
+    } catch (err) {}
   };
 
killedBy: DocumentComments handles submission error gracefully
statusReason: expected "error" to be called with arguments: [ Array(2) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
src/components/DocumentComments.tsx:25:21
       await addComment(content);
       setContent('');
     } catch (err) {
-      console.error('Failed to post comment', err);
+      console.error("", err);
     }
   };
killedBy: DocumentComments handles submission error gracefully
statusReason: expected "error" to be called with arguments: [ Array(2) ]

Received:

  1st error call:

  [
-   "Failed to post comment",

[Survived] StringLiteral
src/components/DocumentComments.tsx:30:28
   };
 
   return (
-    <div style={{ display: 'flex', flexDirection: 'column', height: '100%', background: '#f8fafc', borderLeft: '1px solid #e2e8f0' }}>
+    <div style={{ display: "", flexDirection: 'column', height: '100%', background: '#f8fafc', borderLeft: '1px solid #e2e8f0' }}>
       <div style={{ padding: '16px', borderBottom: '1px solid #e2e8f0', background: 'white' }}>
         <h4 style={{ margin: 0, fontSize: '15px', fontWeight: 600, color: '#1e293b' }}>

[Survived] StringLiteral
src/components/DocumentComments.tsx:30:112
   };
 
   return (
-    <div style={{ display: 'flex', flexDirection: 'column', height: '100%', background: '#f8fafc', borderLeft: '1px solid #e2e8f0' }}>
+    <div style={{ display: 'flex', flexDirection: 'column', height: '100%', background: '#f8fafc', borderLeft: "" }}>
       <div style={{ padding: '16px', borderBottom: '1px solid #e2e8f0', background: 'white' }}>
         <h4 style={{ margin: 0, fontSize: '15px', fontWeight: 600, color: '#1e293b' }}>

[Survived] ObjectLiteral
src/components/DocumentComments.tsx:32:20
   return (
     <div style={{ display: 'flex', flexDirection: 'column', height: '100%', background: '#f8fafc', borderLeft: '1px solid #e2e8f0' }}>
       <div style={{ padding: '16px', borderBottom: '1px solid #e2e8f0', background: 'white' }}>
-        <h4 style={{ margin: 0, fontSize: '15px', fontWeight: 600, color: '#1e293b' }}>
+        <h4 style={{}}>
           <i className="bi bi-chat-dots me-2"></i> Discussão
         </h4>

[Survived] StringLiteral
src/components/DocumentComments.tsx:37:98
         </h4>
       </div>
 
-      <div style={{ flex: 1, overflowY: 'auto', padding: '16px', display: 'flex', flexDirection: 'column', gap: '16px' }}>
+      <div style={{ flex: 1, overflowY: 'auto', padding: '16px', display: 'flex', flexDirection: "", gap: '16px' }}>
         {isLoading ? (
           <div style={{ textAlign: 'center', color: '#64748B', fontSize: '13px' }}>Carregando...</div>

[Survived] StringLiteral
src/components/DocumentComments.tsx:37:41
         </h4>
       </div>
 
-      <div style={{ flex: 1, overflowY: 'auto', padding: '16px', display: 'flex', flexDirection: 'column', gap: '16px' }}>
+      <div style={{ flex: 1, overflowY: "", padding: '16px', display: 'flex', flexDirection: 'column', gap: '16px' }}>
         {isLoading ? (
           <div style={{ textAlign: 'center', color: '#64748B', fontSize: '13px' }}>Carregando...</div>

[Killed] ConditionalExpression
src/components/DocumentComments.tsx:40:13
       <div style={{ flex: 1, overflowY: 'auto', padding: '16px', display: 'flex', flexDirection: 'column', gap: '16px' }}>
         {isLoading ? (
           <div style={{ textAlign: 'center', color: '#64748B', fontSize: '13px' }}>Carregando...</div>
-        ) : comments.length === 0 ? (
+        ) : true ? (
           <div style={{ textAlign: 'center', color: '#64748B', fontSize: '13px', marginTop: '20px' }}>
             Nenhum comentário ainda. Inicie a conversa!
killedBy: DocumentComments renders comments
statusReason: Unable to find an element with the text: User One. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="display: flex; flex-direction: column; height: 100%; background: rgb(248, 250, 252); border-left: 1px solid

[Killed] ConditionalExpression
src/components/DocumentComments.tsx:40:13
       <div style={{ flex: 1, overflowY: 'auto', padding: '16px', display: 'flex', flexDirection: 'column', gap: '16px' }}>
         {isLoading ? (
           <div style={{ textAlign: 'center', color: '#64748B', fontSize: '13px' }}>Carregando...</div>
-        ) : comments.length === 0 ? (
+        ) : false ? (
           <div style={{ textAlign: 'center', color: '#64748B', fontSize: '13px', marginTop: '20px' }}>
             Nenhum comentário ainda. Inicie a conversa!
killedBy: DocumentComments renders empty state when no comments
statusReason: Unable to find an element with the text: Nenhum comentário ainda. Inicie a conversa!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="display: flex; flex-direction: column; height: 100%; background: rgb(248

[Survived] ObjectLiteral
src/components/DocumentComments.tsx:41:23
         {isLoading ? (
           <div style={{ textAlign: 'center', color: '#64748B', fontSize: '13px' }}>Carregando...</div>
         ) : comments.length === 0 ? (
-          <div style={{ textAlign: 'center', color: '#64748B', fontSize: '13px', marginTop: '20px' }}>
+          <div style={{}}>
             Nenhum comentário ainda. Inicie a conversa!
           </div>

[Survived] StringLiteral
src/components/DocumentComments.tsx:41:36
         {isLoading ? (
           <div style={{ textAlign: 'center', color: '#64748B', fontSize: '13px' }}>Carregando...</div>
         ) : comments.length === 0 ? (
-          <div style={{ textAlign: 'center', color: '#64748B', fontSize: '13px', marginTop: '20px' }}>
+          <div style={{ textAlign: "", color: '#64748B', fontSize: '13px', marginTop: '20px' }}>
             Nenhum comentário ainda. Inicie a conversa!
           </div>

[Survived] StringLiteral
src/components/DocumentComments.tsx:46:76
           </div>
         ) : (
           comments.map((comment: any) => (
-            <div key={comment.id} style={{ display: 'flex', flexDirection: 'column', gap: '4px' }}>
+            <div key={comment.id} style={{ display: 'flex', flexDirection: "", gap: '4px' }}>
               <div style={{ display: 'flex', alignItems: 'center', justifyContent: 'space-between' }}>
                 <span style={{ fontWeight: 600, fontSize: '13px', color: '#334155' }}>{comment.authorName}</span>

[Survived] StringLiteral
src/components/DocumentComments.tsx:48:59
           comments.map((comment: any) => (
             <div key={comment.id} style={{ display: 'flex', flexDirection: 'column', gap: '4px' }}>
               <div style={{ display: 'flex', alignItems: 'center', justifyContent: 'space-between' }}>
-                <span style={{ fontWeight: 600, fontSize: '13px', color: '#334155' }}>{comment.authorName}</span>
+                <span style={{ fontWeight: 600, fontSize: "", color: '#334155' }}>{comment.authorName}</span>
                 <span style={{ fontSize: '11px', color: '#94a3b8' }}>
                   {new Date(comment.createdAt).toLocaleDateString()} {new Date(comment.createdAt).toLocaleTimeString([], { hour: '2-digit', minute: '2-digit' })}

[Survived] StringLiteral
src/components/DocumentComments.tsx:49:57
             <div key={comment.id} style={{ display: 'flex', flexDirection: 'column', gap: '4px' }}>
               <div style={{ display: 'flex', alignItems: 'center', justifyContent: 'space-between' }}>
                 <span style={{ fontWeight: 600, fontSize: '13px', color: '#334155' }}>{comment.authorName}</span>
-                <span style={{ fontSize: '11px', color: '#94a3b8' }}>
+                <span style={{ fontSize: '11px', color: "" }}>
                   {new Date(comment.createdAt).toLocaleDateString()} {new Date(comment.createdAt).toLocaleTimeString([], { hour: '2-digit', minute: '2-digit' })}
                 </span>

[Killed] StringLiteral
src/components/DocumentComments.tsx:50:149
               <div style={{ display: 'flex', alignItems: 'center', justifyContent: 'space-between' }}>
                 <span style={{ fontWeight: 600, fontSize: '13px', color: '#334155' }}>{comment.authorName}</span>
                 <span style={{ fontSize: '11px', color: '#94a3b8' }}>
-                  {new Date(comment.createdAt).toLocaleDateString()} {new Date(comment.createdAt).toLocaleTimeString([], { hour: '2-digit', minute: '2-digit' })}
+                  {new Date(comment.createdAt).toLocaleDateString()} {new Date(comment.createdAt).toLocaleTimeString([], { hour: '2-digit', minute: "" })}
                 </span>
               </div>
killedBy: DocumentComments renders comments
statusReason: Value  out of range for Date.prototype.toLocaleTimeString options property minute

[Survived] ObjectLiteral
src/components/DocumentComments.tsx:50:122
               <div style={{ display: 'flex', alignItems: 'center', justifyContent: 'space-between' }}>
                 <span style={{ fontWeight: 600, fontSize: '13px', color: '#334155' }}>{comment.authorName}</span>
                 <span style={{ fontSize: '11px', color: '#94a3b8' }}>
-                  {new Date(comment.createdAt).toLocaleDateString()} {new Date(comment.createdAt).toLocaleTimeString([], { hour: '2-digit', minute: '2-digit' })}
+                  {new Date(comment.createdAt).toLocaleDateString()} {new Date(comment.createdAt).toLocaleTimeString([], {})}
                 </span>
               </div>

[Killed] ArrowFunction
src/components/DocumentComments.tsx:67:23
           <input
             type="text"
             value={content}
-            onChange={(e) => setContent(e.target.value)}
+            onChange={() => undefined}
             placeholder="Adicionar comentário..."
             style={{ flex: 1, padding: '8px 12px', border: '1px solid #cbd5e1', borderRadius: '6px', fontSize: '13px', outline: 'none' }}
killedBy: DocumentComments submits a new comment
statusReason: expect(element).toHaveValue(New comment)

Expected the element to have value:
  New comment
Received:

[Survived] StringLiteral
src/components/DocumentComments.tsx:69:112
             value={content}
             onChange={(e) => setContent(e.target.value)}
             placeholder="Adicionar comentário..."
-            style={{ flex: 1, padding: '8px 12px', border: '1px solid #cbd5e1', borderRadius: '6px', fontSize: '13px', outline: 'none' }}
+            style={{ flex: 1, padding: '8px 12px', border: '1px solid #cbd5e1', borderRadius: '6px', fontSize: "", outline: 'none' }}
             disabled={isPending}
           />

[Killed] ConditionalExpression
src/components/DocumentComments.tsx:74:23
           />
           <button 
             type="submit" 
-            disabled={!content.trim() || isPending}
+            disabled={true}
           >
killedBy: DocumentComments submits a new comment
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <button
  disabled=""
  style="background: var(--ed-purple); color: white; border: medium; border-radius: 6px; padding: 0px 16px; cursor: pointer; opacity: 1;"
  type="submit"
/>

[Killed] ConditionalExpression
src/components/DocumentComments.tsx:74:23
           />
           <button 
             type="submit" 
-            disabled={!content.trim() || isPending}
+            disabled={false}
           >
killedBy: DocumentComments prevents submission when input is empty or pending
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  style="background: var(--ed-purple); color: white; border: medium; border-radius: 6px; padding: 0px 16px; cursor: not-allowed; opacity: 0.6;"
  type="submit"
/>
