[Killed] BooleanLiteral
src/components/GlobalLoader.tsx:8:66
   forceShow?: boolean;
 }
 
-const GlobalLoader: React.FC<GlobalLoaderProps> = ({ forceShow = false }) => {
+const GlobalLoader: React.FC<GlobalLoaderProps> = ({ forceShow = true }) => {
   const [isLoading, setIsLoading] = useState(false);
 
killedBy: GlobalLoader does not render initially
statusReason: expected <div class="global-loader-overlay">…(1)</div> to be null

[Killed] BooleanLiteral
src/components/GlobalLoader.tsx:9:46
 }
 
 const GlobalLoader: React.FC<GlobalLoaderProps> = ({ forceShow = false }) => {
-  const [isLoading, setIsLoading] = useState(false);
+  const [isLoading, setIsLoading] = useState(true);
 
   useEffect(() => {
killedBy: GlobalLoader does not render initially
statusReason: expected <div class="global-loader-overlay">…(1)</div> to be null

[Killed] BlockStatement
src/components/GlobalLoader.tsx:11:19
 const GlobalLoader: React.FC<GlobalLoaderProps> = ({ forceShow = false }) => {
   const [isLoading, setIsLoading] = useState(false);
 
-  useEffect(() => {
-    const handleShow = () => setIsLoading(true);
-    const handleHide = () => setIsLoading(false);
-
-    window.addEventListener('showLoader', handleShow);
-    window.addEventListener('hideLoader', handleHide);
-
-    return () => {
-      window.removeEventListener('showLoader', handleShow);
-      window.removeEventListener('hideLoader', handleHide);
-    };
-  }, []);
+  useEffect(() => {}, []);
 
   if (!isLoading && !forceShow) return null;
killedBy: GlobalLoader renders when showLoader event is dispatched
statusReason: Unable to find an element with the text: Processando. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrowFunction
src/components/GlobalLoader.tsx:12:24
   const [isLoading, setIsLoading] = useState(false);
 
   useEffect(() => {
-    const handleShow = () => setIsLoading(true);
+    const handleShow = () => undefined;
     const handleHide = () => setIsLoading(false);
 
killedBy: GlobalLoader renders when showLoader event is dispatched
statusReason: Unable to find an element with the text: Processando. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BooleanLiteral
src/components/GlobalLoader.tsx:12:43
   const [isLoading, setIsLoading] = useState(false);
 
   useEffect(() => {
-    const handleShow = () => setIsLoading(true);
+    const handleShow = () => setIsLoading(false);
     const handleHide = () => setIsLoading(false);
 
killedBy: GlobalLoader renders when showLoader event is dispatched
statusReason: Unable to find an element with the text: Processando. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BooleanLiteral
src/components/GlobalLoader.tsx:13:43
 
   useEffect(() => {
     const handleShow = () => setIsLoading(true);
-    const handleHide = () => setIsLoading(false);
+    const handleHide = () => setIsLoading(true);
 
     window.addEventListener('showLoader', handleShow);
killedBy: GlobalLoader hides when hideLoader event is dispatched
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <span
  class="loading-text"
  data-name="Processando"
>
  Processando
</span> instead

[Killed] ArrowFunction
src/components/GlobalLoader.tsx:13:24
 
   useEffect(() => {
     const handleShow = () => setIsLoading(true);
-    const handleHide = () => setIsLoading(false);
+    const handleHide = () => undefined;
 
     window.addEventListener('showLoader', handleShow);
killedBy: GlobalLoader hides when hideLoader event is dispatched
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <span
  class="loading-text"
  data-name="Processando"
>
  Processando
</span> instead

[Killed] StringLiteral
src/components/GlobalLoader.tsx:15:29
     const handleShow = () => setIsLoading(true);
     const handleHide = () => setIsLoading(false);
 
-    window.addEventListener('showLoader', handleShow);
+    window.addEventListener("", handleShow);
     window.addEventListener('hideLoader', handleHide);
 
killedBy: GlobalLoader renders when showLoader event is dispatched
statusReason: Unable to find an element with the text: Processando. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] StringLiteral
src/components/GlobalLoader.tsx:16:29
     const handleHide = () => setIsLoading(false);
 
     window.addEventListener('showLoader', handleShow);
-    window.addEventListener('hideLoader', handleHide);
+    window.addEventListener("", handleHide);
 
     return () => {
killedBy: GlobalLoader hides when hideLoader event is dispatched
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <span
  class="loading-text"
  data-name="Processando"
>
  Processando
</span> instead

[Survived] BlockStatement
src/components/GlobalLoader.tsx:18:18
     window.addEventListener('showLoader', handleShow);
     window.addEventListener('hideLoader', handleHide);
 
-    return () => {
-      window.removeEventListener('showLoader', handleShow);
-      window.removeEventListener('hideLoader', handleHide);
-    };
+    return () => {};
   }, []);
 

[Killed] BooleanLiteral
src/components/GlobalLoader.tsx:24:7
     };
   }, []);
 
-  if (!isLoading && !forceShow) return null;
+  if (isLoading && !forceShow) return null;
 
   return (
killedBy: GlobalLoader does not render initially
statusReason: expected <div class="global-loader-overlay">…(1)</div> to be null

[Killed] BooleanLiteral
src/components/GlobalLoader.tsx:24:21
     };
   }, []);
 
-  if (!isLoading && !forceShow) return null;
+  if (!isLoading && forceShow) return null;
 
   return (
killedBy: GlobalLoader does not render initially
statusReason: expected <div class="global-loader-overlay">…(1)</div> to be null
