[NoCoverage] StringLiteral
src/components/SkeletonLoader.tsx:15:15
   width = '100%', 
   height = '20px', 
   borderRadius = '4px',
-  className = '',
+  className = "Stryker was here!",
   style
 }) => {
