[NoCoverage] BlockStatement
src/components/layout/DashboardLayout.tsx:20:7
   subtitle,
   breadcrumbs,
   customTopbarElement,
-}) => {
-  return (
-    <div className="dashboard-layout">
-      <Sidebar />
-      <div className="main-content-wrapper">
-        <Topbar
-          title={title}
-          subtitle={subtitle}
-          breadcrumbs={breadcrumbs}
-          customTopbarElement={customTopbarElement}
-        />
-        <main className="main-content">{children}</main>
-      </div>
-    </div>
-  );
-};
+}) => {};
 
 export default DashboardLayout;
