[NoCoverage] BooleanLiteral
src/components/layout/Sidebar.tsx:11:52
   const { user, handleLogout } = useAuth();
   const [clickCount, setClickCount] = useState(0);
   // Estado para controlar a abertura do menu no mobile
-  const [isMobileOpen, setIsMobileOpen] = useState(false);
+  const [isMobileOpen, setIsMobileOpen] = useState(true);
 
   const handleLogoClick = () => {

[NoCoverage] BlockStatement
src/components/layout/Sidebar.tsx:13:33
   // Estado para controlar a abertura do menu no mobile
   const [isMobileOpen, setIsMobileOpen] = useState(false);
 
-  const handleLogoClick = () => {
-    const newCount = clickCount + 1;
-    setClickCount(newCount);
-    if (newCount === 7) {
-      alert('🎉 Easter Egg Encontrado! Bem-vindo ao laboratório secreto da EdTech AILAB Makers!');
-      setClickCount(0);
-    }
-  };
+  const handleLogoClick = () => {};
 
   // Função auxiliar para fechar a barra ao clicar em uma rota (experiência Mobile fluida)

[NoCoverage] ArithmeticOperator
src/components/layout/Sidebar.tsx:14:22
   const [isMobileOpen, setIsMobileOpen] = useState(false);
 
   const handleLogoClick = () => {
-    const newCount = clickCount + 1;
+    const newCount = clickCount - 1;
     setClickCount(newCount);
     if (newCount === 7) {

[NoCoverage] BlockStatement
src/components/layout/Sidebar.tsx:16:25
   const handleLogoClick = () => {
     const newCount = clickCount + 1;
     setClickCount(newCount);
-    if (newCount === 7) {
-      alert('🎉 Easter Egg Encontrado! Bem-vindo ao laboratório secreto da EdTech AILAB Makers!');
-      setClickCount(0);
-    }
+    if (newCount === 7) {}
   };
 

[NoCoverage] EqualityOperator
src/components/layout/Sidebar.tsx:16:9
   const handleLogoClick = () => {
     const newCount = clickCount + 1;
     setClickCount(newCount);
-    if (newCount === 7) {
+    if (newCount !== 7) {
       alert('🎉 Easter Egg Encontrado! Bem-vindo ao laboratório secreto da EdTech AILAB Makers!');
       setClickCount(0);

[NoCoverage] BlockStatement
src/components/layout/Sidebar.tsx:23:36
   };
 
   // Função auxiliar para fechar a barra ao clicar em uma rota (experiência Mobile fluida)
-  const closeMobileSidebar = () => {
-    setIsMobileOpen(false);
-  };
+  const closeMobileSidebar = () => {};
 
   return (

[NoCoverage] BooleanLiteral
src/components/layout/Sidebar.tsx:24:21
 
   // Função auxiliar para fechar a barra ao clicar em uma rota (experiência Mobile fluida)
   const closeMobileSidebar = () => {
-    setIsMobileOpen(false);
+    setIsMobileOpen(true);
   };
 

[NoCoverage] ArrowFunction
src/components/layout/Sidebar.tsx:32:18
       {/* Botão Hambúrguer flutuante: Visível APENAS em telas menores (Mobile/Tablet) */}
       <button 
         className={`sidebar-mobile-toggle d-md-none ${isMobileOpen ? 'open' : ''}`}
-        onClick={() => setIsMobileOpen(!isMobileOpen)}
+        onClick={() => undefined}
         aria-label="Toggle Navigation"
       >

[NoCoverage] BooleanLiteral
src/components/layout/Sidebar.tsx:32:40
       {/* Botão Hambúrguer flutuante: Visível APENAS em telas menores (Mobile/Tablet) */}
       <button 
         className={`sidebar-mobile-toggle d-md-none ${isMobileOpen ? 'open' : ''}`}
-        onClick={() => setIsMobileOpen(!isMobileOpen)}
+        onClick={() => setIsMobileOpen(isMobileOpen)}
         aria-label="Toggle Navigation"
       >

[NoCoverage] StringLiteral
src/components/layout/Sidebar.tsx:35:44
         onClick={() => setIsMobileOpen(!isMobileOpen)}
         aria-label="Toggle Navigation"
       >
-        <i className={`bi ${isMobileOpen ? 'bi-x-lg' : 'bi-list'}`}></i>
+        <i className={`bi ${isMobileOpen ? "" : 'bi-list'}`}></i>
       </button>
 

[NoCoverage] ConditionalExpression
src/components/layout/Sidebar.tsx:39:8
       </button>
 
       {/* Backdrop (Fundo escurecido) para fechar o menu ao clicar fora dele no mobile */}
-      {isMobileOpen && (
-        <div className="sidebar-backdrop d-md-none" onClick={closeMobileSidebar} />
-      )}
+      {false}
 
       {/* Aside com a classe condicional 'active-mobile' se o estado for true */}

[NoCoverage] LogicalOperator
src/components/layout/Sidebar.tsx:39:8
       </button>
 
       {/* Backdrop (Fundo escurecido) para fechar o menu ao clicar fora dele no mobile */}
-      {isMobileOpen && (
-        <div className="sidebar-backdrop d-md-none" onClick={closeMobileSidebar} />
-      )}
+      {isMobileOpen || <div className="sidebar-backdrop d-md-none" onClick={closeMobileSidebar} />}
 
       {/* Aside com a classe condicional 'active-mobile' se o estado for true */}

[NoCoverage] StringLiteral
src/components/layout/Sidebar.tsx:44:61
       )}
 
       {/* Aside com a classe condicional 'active-mobile' se o estado for true */}
-      <aside className={`sidebar-container ${isMobileOpen ? 'active-mobile' : ''}`}>
+      <aside className={`sidebar-container ${isMobileOpen ? "" : ''}`}>
         <div className="sidebar-header">
           <div className="logo-section" onClick={handleLogoClick} style={{ cursor: 'pointer' }}>

[NoCoverage] ConditionalExpression
src/components/layout/Sidebar.tsx:63:14
           </div>
           <div className="role-badge">
             <span className="badge-dot"></span>
-            {user?.role === 'ADVISOR' ? 'ORIENTADOR' : user?.role === 'AUDITOR' ? 'AUDITOR' : 'PESQUISADOR'}
+            {false ? 'ORIENTADOR' : user?.role === 'AUDITOR' ? 'AUDITOR' : 'PESQUISADOR'}
           </div>
         </div>

[NoCoverage] EqualityOperator
src/components/layout/Sidebar.tsx:63:56
           </div>
           <div className="role-badge">
             <span className="badge-dot"></span>
-            {user?.role === 'ADVISOR' ? 'ORIENTADOR' : user?.role === 'AUDITOR' ? 'AUDITOR' : 'PESQUISADOR'}
+            {user?.role === 'ADVISOR' ? 'ORIENTADOR' : user?.role !== 'AUDITOR' ? 'AUDITOR' : 'PESQUISADOR'}
           </div>
         </div>

[NoCoverage] ArrowFunction
src/components/layout/Sidebar.tsx:73:28
             <div className="nav-links">
               <NavLink
                 to="/dashboard"
-                className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}
+                className={() => undefined}
                 onClick={closeMobileSidebar}
               >

[NoCoverage] StringLiteral
src/components/layout/Sidebar.tsx:73:46
             <div className="nav-links">
               <NavLink
                 to="/dashboard"
-                className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}
+                className={({ isActive }) => ``}
                 onClick={closeMobileSidebar}
               >

[NoCoverage] LogicalOperator
src/components/layout/Sidebar.tsx:79:16
                 <i className="bi bi-grid-1x2"></i> Visão Geral
                 <i className="bi bi-chevron-right arrow-icon ms-auto"></i>
               </NavLink>
-              {user?.role === 'RESEARCHER' && (
-                <>
-                  <NavLink
-                    to="/documentos"
-                    className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}
-                    onClick={closeMobileSidebar}
-                  >
-                    <i className="bi bi-folder2-open"></i> Área de Pesquisa
-                    <i className="bi bi-chevron-right arrow-icon ms-auto"></i>
-                  </NavLink>
-                  <NavLink
-                    to="/projects"
-                    className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}
-                    onClick={closeMobileSidebar}
-                  >
-                    <i className="bi bi-briefcase"></i> Projetos
-                    <i className="bi bi-chevron-right arrow-icon ms-auto"></i>
-                  </NavLink>
-                </>
-              )}
+              {user?.role === 'RESEARCHER' || <>
+                  <NavLink to="/documentos" className={({
+    isActive
+  }) => `nav-link-item ${isActive ? 'active' : ''}`} onClick={closeMobileSidebar}>
+                    <i className="bi bi-folder2-open"></i> Área de Pesquisa
+                    <i className="bi bi-chevron-right arrow-icon ms-auto"></i>
+                  </NavLink>
+                  <NavLink to="/projects" className={({
+    isActive
+  }) => `nav-link-item ${isActive ? 'active' : ''}`} onClick={closeMobileSidebar}>
+                    <i className="bi bi-briefcase"></i> Projetos
+                    <i className="bi bi-chevron-right arrow-icon ms-auto"></i>
+                  </NavLink>
+                </>}
               {user?.role === 'ADVISOR' && (
                 <NavLink

[NoCoverage] EqualityOperator
src/components/layout/Sidebar.tsx:79:16
                 <i className="bi bi-grid-1x2"></i> Visão Geral
                 <i className="bi bi-chevron-right arrow-icon ms-auto"></i>
               </NavLink>
-              {user?.role === 'RESEARCHER' && (
+              {user?.role !== 'RESEARCHER' && (
                 <>
                   <NavLink

[NoCoverage] ArrowFunction
src/components/layout/Sidebar.tsx:83:32
                 <>
                   <NavLink
                     to="/documentos"
-                    className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}
+                    className={() => undefined}
                     onClick={closeMobileSidebar}
                   >

[NoCoverage] StringLiteral
src/components/layout/Sidebar.tsx:83:89
                 <>
                   <NavLink
                     to="/documentos"
-                    className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}
+                    className={({ isActive }) => `nav-link-item ${isActive ? 'active' : "Stryker was here!"}`}
                     onClick={closeMobileSidebar}
                   >

[NoCoverage] ArrowFunction
src/components/layout/Sidebar.tsx:91:32
                   </NavLink>
                   <NavLink
                     to="/projects"
-                    className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}
+                    className={() => undefined}
                     onClick={closeMobileSidebar}
                   >

[NoCoverage] EqualityOperator
src/components/layout/Sidebar.tsx:99:16
                   </NavLink>
                 </>
               )}
-              {user?.role === 'ADVISOR' && (
+              {user?.role !== 'ADVISOR' && (
                 <NavLink
                   to="/submissions"

[NoCoverage] ConditionalExpression
src/components/layout/Sidebar.tsx:99:16
                   </NavLink>
                 </>
               )}
-              {user?.role === 'ADVISOR' && (
-                <NavLink
-                  to="/submissions"
-                  className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}
-                  onClick={closeMobileSidebar}
-                >
-                  <i className="bi bi-play-circle"></i> Submissões
-                  <i className="bi bi-chevron-right arrow-icon ms-auto"></i>
-                </NavLink>
-              )}
+              {false}
             </div>
           </div>

[NoCoverage] ArrowFunction
src/components/layout/Sidebar.tsx:102:30
               {user?.role === 'ADVISOR' && (
                 <NavLink
                   to="/submissions"
-                  className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}
+                  className={() => undefined}
                   onClick={closeMobileSidebar}
                 >

[NoCoverage] StringLiteral
src/components/layout/Sidebar.tsx:102:76
               {user?.role === 'ADVISOR' && (
                 <NavLink
                   to="/submissions"
-                  className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}
+                  className={({ isActive }) => `nav-link-item ${isActive ? "" : ''}`}
                   onClick={closeMobileSidebar}
                 >

[NoCoverage] ConditionalExpression
src/components/layout/Sidebar.tsx:112:12
             </div>
           </div>
 
-          {user?.role !== 'AUDITOR' && (
-            <div className="nav-section">
-              <span className="nav-section-title">INTELIGÊNCIA</span>
-              <div className="nav-links">
-                <NavLink
-                  to="/trail"
-                  className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}
-                  onClick={closeMobileSidebar}
-                >
-                  <i className="bi bi-diagram-3"></i> Trilha de Pesquisa
-                  <i className="bi bi-chevron-right arrow-icon ms-auto"></i>
-                </NavLink>
-                {user?.role === 'ADVISOR' && (
-                  <NavLink
-                    to="/analytics"
-                    className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}
-                    onClick={closeMobileSidebar}
-                  >
-                    <i className="bi bi-graph-up-arrow"></i> Análises
-                    <i className="bi bi-chevron-right arrow-icon ms-auto"></i>
-                  </NavLink>
-                )}
-              </div>
-            </div>
-          )}
+          {false}
 
           <div className="nav-section">

[NoCoverage] EqualityOperator
src/components/layout/Sidebar.tsx:112:12
             </div>
           </div>
 
-          {user?.role !== 'AUDITOR' && (
+          {user?.role === 'AUDITOR' && (
             <div className="nav-section">
               <span className="nav-section-title">INTELIGÊNCIA</span>

[NoCoverage] ArrowFunction
src/components/layout/Sidebar.tsx:118:30
               <div className="nav-links">
                 <NavLink
                   to="/trail"
-                  className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}
+                  className={() => undefined}
                   onClick={closeMobileSidebar}
                 >

[NoCoverage] StringLiteral
src/components/layout/Sidebar.tsx:118:87
               <div className="nav-links">
                 <NavLink
                   to="/trail"
-                  className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}
+                  className={({ isActive }) => `nav-link-item ${isActive ? 'active' : "Stryker was here!"}`}
                   onClick={closeMobileSidebar}
                 >

[NoCoverage] OptionalChaining
src/components/layout/Sidebar.tsx:124:18
                   <i className="bi bi-diagram-3"></i> Trilha de Pesquisa
                   <i className="bi bi-chevron-right arrow-icon ms-auto"></i>
                 </NavLink>
-                {user?.role === 'ADVISOR' && (
+                {user.role === 'ADVISOR' && (
                   <NavLink
                     to="/analytics"

[NoCoverage] ConditionalExpression
src/components/layout/Sidebar.tsx:124:18
                   <i className="bi bi-diagram-3"></i> Trilha de Pesquisa
                   <i className="bi bi-chevron-right arrow-icon ms-auto"></i>
                 </NavLink>
-                {user?.role === 'ADVISOR' && (
-                  <NavLink
-                    to="/analytics"
-                    className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}
-                    onClick={closeMobileSidebar}
-                  >
-                    <i className="bi bi-graph-up-arrow"></i> Análises
-                    <i className="bi bi-chevron-right arrow-icon ms-auto"></i>
-                  </NavLink>
-                )}
+                {true}
               </div>
             </div>

[NoCoverage] ArrowFunction
src/components/layout/Sidebar.tsx:127:32
                 {user?.role === 'ADVISOR' && (
                   <NavLink
                     to="/analytics"
-                    className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}
+                    className={() => undefined}
                     onClick={closeMobileSidebar}
                   >

[NoCoverage] StringLiteral
src/components/layout/Sidebar.tsx:127:50
                 {user?.role === 'ADVISOR' && (
                   <NavLink
                     to="/analytics"
-                    className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}
+                    className={({ isActive }) => ``}
                     onClick={closeMobileSidebar}
                   >

[NoCoverage] ConditionalExpression
src/components/layout/Sidebar.tsx:141:16
           <div className="nav-section">
             <span className="nav-section-title">GOVERNANÇA</span>
             <div className="nav-links">
-              {user?.role === 'AUDITOR' && (
-                <>
-                  <NavLink
-                    to="/compliance-center"
-                    className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}
-                    onClick={closeMobileSidebar}
-                  >
-                    <i className="bi bi-shield-check"></i> Centro de Conformidade
-                    <i className="bi bi-chevron-right arrow-icon ms-auto"></i>
-                  </NavLink>
-                  <NavLink
-                    to="/audit-logs"
-                    className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}
-                    onClick={closeMobileSidebar}
-                  >
-                    <i className="bi bi-journal-text"></i> Logs de Auditoria
-                    <i className="bi bi-chevron-right arrow-icon ms-auto"></i>
-                  </NavLink>
-                </>
-              )}
+              {false}
               <NavLink
                 to="/settings"

[NoCoverage] ConditionalExpression
src/components/layout/Sidebar.tsx:141:16
           <div className="nav-section">
             <span className="nav-section-title">GOVERNANÇA</span>
             <div className="nav-links">
-              {user?.role === 'AUDITOR' && (
-                <>
-                  <NavLink
-                    to="/compliance-center"
-                    className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}
-                    onClick={closeMobileSidebar}
-                  >
-                    <i className="bi bi-shield-check"></i> Centro de Conformidade
-                    <i className="bi bi-chevron-right arrow-icon ms-auto"></i>
-                  </NavLink>
-                  <NavLink
-                    to="/audit-logs"
-                    className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}
-                    onClick={closeMobileSidebar}
-                  >
-                    <i className="bi bi-journal-text"></i> Logs de Auditoria
-                    <i className="bi bi-chevron-right arrow-icon ms-auto"></i>
-                  </NavLink>
-                </>
-              )}
+              {true}
               <NavLink
                 to="/settings"

[NoCoverage] ArrowFunction
src/components/layout/Sidebar.tsx:145:32
                 <>
                   <NavLink
                     to="/compliance-center"
-                    className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}
+                    className={() => undefined}
                     onClick={closeMobileSidebar}
                   >

[NoCoverage] StringLiteral
src/components/layout/Sidebar.tsx:145:89
                 <>
                   <NavLink
                     to="/compliance-center"
-                    className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}
+                    className={({ isActive }) => `nav-link-item ${isActive ? 'active' : "Stryker was here!"}`}
                     onClick={closeMobileSidebar}
                   >

[NoCoverage] ArrowFunction
src/components/layout/Sidebar.tsx:153:32
                   </NavLink>
                   <NavLink
                     to="/audit-logs"
-                    className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}
+                    className={() => undefined}
                     onClick={closeMobileSidebar}
                   >

[NoCoverage] StringLiteral
src/components/layout/Sidebar.tsx:153:89
                   </NavLink>
                   <NavLink
                     to="/audit-logs"
-                    className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}
+                    className={({ isActive }) => `nav-link-item ${isActive ? 'active' : "Stryker was here!"}`}
                     onClick={closeMobileSidebar}
                   >

[NoCoverage] ArrowFunction
src/components/layout/Sidebar.tsx:163:28
               )}
               <NavLink
                 to="/settings"
-                className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}
+                className={() => undefined}
                 onClick={closeMobileSidebar}
               >

[NoCoverage] StringLiteral
src/components/layout/Sidebar.tsx:163:46
               )}
               <NavLink
                 to="/settings"
-                className={({ isActive }) => `nav-link-item ${isActive ? 'active' : ''}`}
+                className={({ isActive }) => ``}
                 onClick={closeMobileSidebar}
               >

[NoCoverage] MethodExpression
src/components/layout/Sidebar.tsx:174:38
 
         <div className="sidebar-footer">
           <div className="user-profile">
-            <div className="avatar">{user?.name?.substring(0, 2).toUpperCase() || 'RS'}</div>
+            <div className="avatar">{user?.name?.substring(0, 2).toLowerCase() || 'RS'}</div>
             <div className="user-info">
               <span className="user-name">{user?.name || 'Dra. Renata Silva'}</span>

[NoCoverage] MethodExpression
src/components/layout/Sidebar.tsx:174:38
 
         <div className="sidebar-footer">
           <div className="user-profile">
-            <div className="avatar">{user?.name?.substring(0, 2).toUpperCase() || 'RS'}</div>
+            <div className="avatar">{user?.name.toUpperCase() || 'RS'}</div>
             <div className="user-info">
               <span className="user-name">{user?.name || 'Dra. Renata Silva'}</span>

[NoCoverage] ConditionalExpression
src/components/layout/Sidebar.tsx:176:44
           <div className="user-profile">
             <div className="avatar">{user?.name?.substring(0, 2).toUpperCase() || 'RS'}</div>
             <div className="user-info">
-              <span className="user-name">{user?.name || 'Dra. Renata Silva'}</span>
+              <span className="user-name">{true}</span>
               <span className="user-email">{user?.email || 'renata.silva@usp.br'}</span>
             </div>

[NoCoverage] LogicalOperator
src/components/layout/Sidebar.tsx:176:44
           <div className="user-profile">
             <div className="avatar">{user?.name?.substring(0, 2).toUpperCase() || 'RS'}</div>
             <div className="user-info">
-              <span className="user-name">{user?.name || 'Dra. Renata Silva'}</span>
+              <span className="user-name">{user?.name && 'Dra. Renata Silva'}</span>
               <span className="user-email">{user?.email || 'renata.silva@usp.br'}</span>
             </div>

[NoCoverage] LogicalOperator
src/components/layout/Sidebar.tsx:177:45
             <div className="avatar">{user?.name?.substring(0, 2).toUpperCase() || 'RS'}</div>
             <div className="user-info">
               <span className="user-name">{user?.name || 'Dra. Renata Silva'}</span>
-              <span className="user-email">{user?.email || 'renata.silva@usp.br'}</span>
+              <span className="user-email">{user?.email && 'renata.silva@usp.br'}</span>
             </div>
             <button className="logout-btn" onClick={handleLogout} title="Sair">

[NoCoverage] ConditionalExpression
src/components/layout/Sidebar.tsx:177:45
             <div className="avatar">{user?.name?.substring(0, 2).toUpperCase() || 'RS'}</div>
             <div className="user-info">
               <span className="user-name">{user?.name || 'Dra. Renata Silva'}</span>
-              <span className="user-email">{user?.email || 'renata.silva@usp.br'}</span>
+              <span className="user-email">{true}</span>
             </div>
             <button className="logout-btn" onClick={handleLogout} title="Sair">
