[NoCoverage] BlockStatement
src/components/privateRoute.tsx:6:101
 import { Navigate } from 'react-router-dom';
 import GlobalLoader from './GlobalLoader';
 
-function PrivateRoute({ children, allowedRoles }: { children: ReactNode; allowedRoles?: string[] }) {
-  const { user, isAuthenticated, isLoading } = useAuth();
-  if (isLoading == true) {
-    return <GlobalLoader forceShow />;
-  }
-  if (!isAuthenticated) {
-    return <Navigate to="/login" />;
-  }
-  if (allowedRoles && user && !allowedRoles.includes(user.role)) {
-    return <Navigate to="/dashboard" />;
-  }
-  return children;
-}
+function PrivateRoute({ children, allowedRoles }: { children: ReactNode; allowedRoles?: string[] }) {}
 export default PrivateRoute;
 

[NoCoverage] BlockStatement
src/components/privateRoute.tsx:8:26
 
 function PrivateRoute({ children, allowedRoles }: { children: ReactNode; allowedRoles?: string[] }) {
   const { user, isAuthenticated, isLoading } = useAuth();
-  if (isLoading == true) {
-    return <GlobalLoader forceShow />;
-  }
+  if (isLoading == true) {}
   if (!isAuthenticated) {
     return <Navigate to="/login" />;

[NoCoverage] BooleanLiteral
src/components/privateRoute.tsx:8:20
 
 function PrivateRoute({ children, allowedRoles }: { children: ReactNode; allowedRoles?: string[] }) {
   const { user, isAuthenticated, isLoading } = useAuth();
-  if (isLoading == true) {
+  if (isLoading == false) {
     return <GlobalLoader forceShow />;
   }

[NoCoverage] BlockStatement
src/components/privateRoute.tsx:11:25
   if (isLoading == true) {
     return <GlobalLoader forceShow />;
   }
-  if (!isAuthenticated) {
-    return <Navigate to="/login" />;
-  }
+  if (!isAuthenticated) {}
   if (allowedRoles && user && !allowedRoles.includes(user.role)) {
     return <Navigate to="/dashboard" />;

[NoCoverage] ConditionalExpression
src/components/privateRoute.tsx:11:7
   if (isLoading == true) {
     return <GlobalLoader forceShow />;
   }
-  if (!isAuthenticated) {
+  if (false) {
     return <Navigate to="/login" />;
   }

[NoCoverage] ConditionalExpression
src/components/privateRoute.tsx:14:7
   if (!isAuthenticated) {
     return <Navigate to="/login" />;
   }
-  if (allowedRoles && user && !allowedRoles.includes(user.role)) {
+  if (true) {
     return <Navigate to="/dashboard" />;
   }

[NoCoverage] ConditionalExpression
src/components/privateRoute.tsx:14:7
   if (!isAuthenticated) {
     return <Navigate to="/login" />;
   }
-  if (allowedRoles && user && !allowedRoles.includes(user.role)) {
+  if (true && !allowedRoles.includes(user.role)) {
     return <Navigate to="/dashboard" />;
   }
