[Killed] BlockStatement
src/components/themeToggle.tsx:4:24
 import useTheme from '../hooks/useTheme';
 import styles from './themeToggle.module.css';
 
-function ThemeToggle() {
-  const { tema, toggleTheme } = useTheme();
-  return (
-    <button
-      onClick={toggleTheme}
-      className={styles.toggleBtn}
-      aria-label="Alternar Tema"
-      title="Alternar Tema"
-    >
-      {tema === 'dark' ? (
-        <i className="bi bi-sun-fill" style={{ fontSize: '1.25rem' }}></i>
-      ) : (
-        <i className="bi bi-moon-stars-fill" style={{ fontSize: '1.25rem' }}></i>
-      )}
-    </button>
-  );
-}
+function ThemeToggle() {}
 
 export default ThemeToggle;
killedBy: ThemeToggle renders correctly in light theme
statusReason: Unable to find an accessible element with the role "button" and name `/Alternar Tema/i`

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
src/components/themeToggle.tsx:13:8
       aria-label="Alternar Tema"
       title="Alternar Tema"
     >
-      {tema === 'dark' ? (
+      {false ? (
         <i className="bi bi-sun-fill" style={{ fontSize: '1.25rem' }}></i>
       ) : (
killedBy: ThemeToggle renders correctly in dark theme
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Killed] EqualityOperator
src/components/themeToggle.tsx:13:8
       aria-label="Alternar Tema"
       title="Alternar Tema"
     >
-      {tema === 'dark' ? (
+      {tema !== 'dark' ? (
         <i className="bi bi-sun-fill" style={{ fontSize: '1.25rem' }}></i>
       ) : (
killedBy: ThemeToggle renders correctly in light theme
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Survived] StringLiteral
src/components/themeToggle.tsx:14:58
       title="Alternar Tema"
     >
       {tema === 'dark' ? (
-        <i className="bi bi-sun-fill" style={{ fontSize: '1.25rem' }}></i>
+        <i className="bi bi-sun-fill" style={{ fontSize: "" }}></i>
       ) : (
         <i className="bi bi-moon-stars-fill" style={{ fontSize: '1.25rem' }}></i>
