[Survived] StringLiteral
src/pages/Recovery.tsx:10:38
 
 function Recovery() {
   const [step, setStep] = useState(1);
-  const [email, setEmail] = useState('');
+  const [email, setEmail] = useState("Stryker was here!");
   const [code, setCode] = useState('');
   const [senha, setSenha] = useState('');

[Survived] StringLiteral
src/pages/Recovery.tsx:12:38
   const [step, setStep] = useState(1);
   const [email, setEmail] = useState('');
   const [code, setCode] = useState('');
-  const [senha, setSenha] = useState('');
+  const [senha, setSenha] = useState("Stryker was here!");
   const [confirmarSenha, setConfirmarSenha] = useState('');
 

[Killed] BooleanLiteral
src/pages/Recovery.tsx:15:52
   const [senha, setSenha] = useState('');
   const [confirmarSenha, setConfirmarSenha] = useState('');
 
-  const [showPassword, setShowPassword] = useState(false);
+  const [showPassword, setShowPassword] = useState(true);
   const [showConfirmPassword, setShowConfirmPassword] = useState(false);
 
killedBy: Recovery Component - Unit Tests Passo 3: Alterna visibilidade das senhas
statusReason: expect(element).toHaveAttribute("type", "password") // element.getAttribute("type") === "password"

Expected the element to have attribute:
  type="password"
Received:
  type="text"

[Killed] BooleanLiteral
src/pages/Recovery.tsx:16:66
   const [confirmarSenha, setConfirmarSenha] = useState('');
 
   const [showPassword, setShowPassword] = useState(false);
-  const [showConfirmPassword, setShowConfirmPassword] = useState(false);
+  const [showConfirmPassword, setShowConfirmPassword] = useState(true);
 
   const [erro, setErro] = useState('');
killedBy: Recovery Component - Unit Tests Passo 3: Alterna visibilidade das senhas
statusReason: expect(element).toHaveAttribute("type", "password") // element.getAttribute("type") === "password"

Expected the element to have attribute:
  type="password"
Received:
  type="text"

[Killed] BooleanLiteral
src/pages/Recovery.tsx:20:42
 
   const [erro, setErro] = useState('');
   const [sucesso, setSucesso] = useState('');
-  const [loading, setLoading] = useState(false);
+  const [loading, setLoading] = useState(true);
   const [isShaking, setIsShaking] = useState(false);
 
killedBy: Recovery Component - Unit Tests Submete e-mail e avança para Passo 2 com sucesso
statusReason: Unable to find an accessible element with the role "button" and name `/Continuar/i`

Here are the accessible roles:

  heading:

  Name "Governança de Pesquisa Acadêmica":
  <h1

[Survived] BooleanLiteral
src/pages/Recovery.tsx:21:46
   const [erro, setErro] = useState('');
   const [sucesso, setSucesso] = useState('');
   const [loading, setLoading] = useState(false);
-  const [isShaking, setIsShaking] = useState(false);
+  const [isShaking, setIsShaking] = useState(true);
 
   const navigate = useNavigate();

[Survived] BlockStatement
src/pages/Recovery.tsx:24:30
   const [isShaking, setIsShaking] = useState(false);
 
   const navigate = useNavigate();
-  const triggerShake = () => {
-    setIsShaking(true);
-    setTimeout(() => setIsShaking(false), 500);
-  };
+  const triggerShake = () => {};
 
   const handleRequestCode = async (e: React.FormEvent) => {

[Survived] BooleanLiteral
src/pages/Recovery.tsx:25:18
 
   const navigate = useNavigate();
   const triggerShake = () => {
-    setIsShaking(true);
+    setIsShaking(false);
     setTimeout(() => setIsShaking(false), 500);
   };

[Survived] ArrowFunction
src/pages/Recovery.tsx:26:16
   const navigate = useNavigate();
   const triggerShake = () => {
     setIsShaking(true);
-    setTimeout(() => setIsShaking(false), 500);
+    setTimeout(() => undefined, 500);
   };
 

[Survived] BooleanLiteral
src/pages/Recovery.tsx:26:35
   const navigate = useNavigate();
   const triggerShake = () => {
     setIsShaking(true);
-    setTimeout(() => setIsShaking(false), 500);
+    setTimeout(() => setIsShaking(true), 500);
   };
 

[Killed] BlockStatement
src/pages/Recovery.tsx:29:59
     setTimeout(() => setIsShaking(false), 500);
   };
 
-  const handleRequestCode = async (e: React.FormEvent) => {
-    if (e) e.preventDefault();
-    setErro('');
-    setLoading(true);
-
-    try {
-      const res = await requestPasswordRecovery(email);
-      if (res.sucesso) {
-        setSucesso(res.mensagem);
-        setStep(2);
-        setTimeout(() => setSucesso(''), 3000);
-      } else {
-        setErro(res.mensagem || 'Erro ao solicitar código');
-        triggerShake();
-      }
-    } catch {
-      setErro('Erro no servidor');
-      triggerShake();
-    } finally {
-      setLoading(false);
-    }
-  };
+  const handleRequestCode = async (e: React.FormEvent) => {};
 
   const handleVerifyCode = async (e: React.FormEvent) => {
killedBy: Recovery Component - Unit Tests Submete e-mail e avança para Passo 2 com sucesso
statusReason: expected "vi.fn()" to be called with arguments: [ 'teste@unb.br' ]

Number of calls: 0

[Survived] ConditionalExpression
src/pages/Recovery.tsx:30:9
   };
 
   const handleRequestCode = async (e: React.FormEvent) => {
-    if (e) e.preventDefault();
+    if (true) e.preventDefault();
     setErro('');
     setLoading(true);

[Survived] ConditionalExpression
src/pages/Recovery.tsx:30:9
   };
 
   const handleRequestCode = async (e: React.FormEvent) => {
-    if (e) e.preventDefault();
+    if (false) e.preventDefault();
     setErro('');
     setLoading(true);

[Survived] BooleanLiteral
src/pages/Recovery.tsx:32:16
   const handleRequestCode = async (e: React.FormEvent) => {
     if (e) e.preventDefault();
     setErro('');
-    setLoading(true);
+    setLoading(false);
 
     try {

[Killed] BlockStatement
src/pages/Recovery.tsx:34:9
     setErro('');
     setLoading(true);
 
-    try {
-      const res = await requestPasswordRecovery(email);
-      if (res.sucesso) {
-        setSucesso(res.mensagem);
-        setStep(2);
-        setTimeout(() => setSucesso(''), 3000);
-      } else {
-        setErro(res.mensagem || 'Erro ao solicitar código');
-        triggerShake();
-      }
-    } catch {
+    try {} catch {
       setErro('Erro no servidor');
       triggerShake();
killedBy: Recovery Component - Unit Tests Submete e-mail e avança para Passo 2 com sucesso
statusReason: expected "vi.fn()" to be called with arguments: [ 'teste@unb.br' ]

Number of calls: 0

[Killed] BlockStatement
src/pages/Recovery.tsx:36:24
 
     try {
       const res = await requestPasswordRecovery(email);
-      if (res.sucesso) {
-        setSucesso(res.mensagem);
-        setStep(2);
-        setTimeout(() => setSucesso(''), 3000);
-      } else {
+      if (res.sucesso) {} else {
         setErro(res.mensagem || 'Erro ao solicitar código');
         triggerShake();
killedBy: Recovery Component - Unit Tests Submete e-mail e avança para Passo 2 com sucesso
statusReason: Unable to find an element with the text: Verificação de Código. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Killed] ConditionalExpression
src/pages/Recovery.tsx:36:11
 
     try {
       const res = await requestPasswordRecovery(email);
-      if (res.sucesso) {
+      if (false) {
         setSucesso(res.mensagem);
         setStep(2);
killedBy: Recovery Component - Unit Tests Submete e-mail e avança para Passo 2 com sucesso
statusReason: Unable to find an element with the text: Verificação de Código. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Survived] ArrowFunction
src/pages/Recovery.tsx:39:20
       if (res.sucesso) {
         setSucesso(res.mensagem);
         setStep(2);
-        setTimeout(() => setSucesso(''), 3000);
+        setTimeout(() => undefined, 3000);
       } else {
         setErro(res.mensagem || 'Erro ao solicitar código');

[Killed] BlockStatement
src/pages/Recovery.tsx:40:14
         setSucesso(res.mensagem);
         setStep(2);
         setTimeout(() => setSucesso(''), 3000);
-      } else {
-        setErro(res.mensagem || 'Erro ao solicitar código');
-        triggerShake();
-      }
+      } else {}
     } catch {
       setErro('Erro no servidor');
killedBy: Recovery Component - Unit Tests Exibe erro se a API retornar falha no Passo 1
statusReason: Unable to find an element with the text: /E-mail não encontrado/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Killed] LogicalOperator
src/pages/Recovery.tsx:41:17
         setStep(2);
         setTimeout(() => setSucesso(''), 3000);
       } else {
-        setErro(res.mensagem || 'Erro ao solicitar código');
+        setErro(res.mensagem && 'Erro ao solicitar código');
         triggerShake();
       }
killedBy: Recovery Component - Unit Tests Exibe erro se a API retornar falha no Passo 1
statusReason: Unable to find an element with the text: /E-mail não encontrado/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Killed] ConditionalExpression
src/pages/Recovery.tsx:41:17
         setStep(2);
         setTimeout(() => setSucesso(''), 3000);
       } else {
-        setErro(res.mensagem || 'Erro ao solicitar código');
+        setErro(false);
         triggerShake();
       }
killedBy: Recovery Component - Unit Tests Exibe erro se a API retornar falha no Passo 1
statusReason: Unable to find an element with the text: /E-mail não encontrado/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[NoCoverage] BlockStatement
src/pages/Recovery.tsx:44:13
         setErro(res.mensagem || 'Erro ao solicitar código');
         triggerShake();
       }
-    } catch {
-      setErro('Erro no servidor');
-      triggerShake();
-    } finally {
+    } catch {} finally {
       setLoading(false);
     }

[NoCoverage] StringLiteral
src/pages/Recovery.tsx:45:15
         triggerShake();
       }
     } catch {
-      setErro('Erro no servidor');
+      setErro("");
       triggerShake();
     } finally {

[Killed] BlockStatement
src/pages/Recovery.tsx:47:15
     } catch {
       setErro('Erro no servidor');
       triggerShake();
-    } finally {
-      setLoading(false);
-    }
+    } finally {}
   };
 
killedBy: Recovery Component - Unit Tests Passo 2: Submete código OTP e avança para Passo 3
statusReason: Unable to find an accessible element with the role "button" and name `/Continuar/i`

Here are the accessible roles:

  heading:

  Name "Governança de Pesquisa Acadêmica":
  <h1

[Killed] BlockStatement
src/pages/Recovery.tsx:52:58
     }
   };
 
-  const handleVerifyCode = async (e: React.FormEvent) => {
-    if (e) e.preventDefault();
-    setErro('');
-    setLoading(true);
-
-    try {
-      const res = await verifyRecoveryCode(email, code);
-      if (res.sucesso) {
-        setSucesso(res.mensagem);
-        setStep(3);
-        setTimeout(() => setSucesso(''), 3000);
-      } else {
-        setErro(res.mensagem || 'Código inválido');
-        triggerShake();
-      }
-    } catch {
-      setErro('Erro no servidor');
-      triggerShake();
-    } finally {
-      setLoading(false);
-    }
-  };
+  const handleVerifyCode = async (e: React.FormEvent) => {};
 
   const handleResetPassword = async (e: React.FormEvent) => {
killedBy: Recovery Component - Unit Tests Passo 2: Submete código OTP e avança para Passo 3
statusReason: expected "vi.fn()" to be called with arguments: [ 'teste@unb.br', '000000' ]

Number of calls: 0

[Survived] ConditionalExpression
src/pages/Recovery.tsx:53:9
   };
 
   const handleVerifyCode = async (e: React.FormEvent) => {
-    if (e) e.preventDefault();
+    if (true) e.preventDefault();
     setErro('');
     setLoading(true);

[Survived] ConditionalExpression
src/pages/Recovery.tsx:53:9
   };
 
   const handleVerifyCode = async (e: React.FormEvent) => {
-    if (e) e.preventDefault();
+    if (false) e.preventDefault();
     setErro('');
     setLoading(true);

[Killed] BlockStatement
src/pages/Recovery.tsx:57:9
     setErro('');
     setLoading(true);
 
-    try {
-      const res = await verifyRecoveryCode(email, code);
-      if (res.sucesso) {
-        setSucesso(res.mensagem);
-        setStep(3);
-        setTimeout(() => setSucesso(''), 3000);
-      } else {
-        setErro(res.mensagem || 'Código inválido');
-        triggerShake();
-      }
-    } catch {
+    try {} catch {
       setErro('Erro no servidor');
       triggerShake();
killedBy: Recovery Component - Unit Tests Passo 2: Submete código OTP e avança para Passo 3
statusReason: expected "vi.fn()" to be called with arguments: [ 'teste@unb.br', '000000' ]

Number of calls: 0

[Killed] BlockStatement
src/pages/Recovery.tsx:59:24
 
     try {
       const res = await verifyRecoveryCode(email, code);
-      if (res.sucesso) {
-        setSucesso(res.mensagem);
-        setStep(3);
-        setTimeout(() => setSucesso(''), 3000);
-      } else {
+      if (res.sucesso) {} else {
         setErro(res.mensagem || 'Código inválido');
         triggerShake();
killedBy: Recovery Component - Unit Tests Passo 2: Submete código OTP e avança para Passo 3
statusReason: Unable to find role="heading" and name "Nova Senha"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Killed] ConditionalExpression
src/pages/Recovery.tsx:59:11
 
     try {
       const res = await verifyRecoveryCode(email, code);
-      if (res.sucesso) {
+      if (false) {
         setSucesso(res.mensagem);
         setStep(3);
killedBy: Recovery Component - Unit Tests Passo 2: Submete código OTP e avança para Passo 3
statusReason: Unable to find role="heading" and name "Nova Senha"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Survived] ArrowFunction
src/pages/Recovery.tsx:62:20
       if (res.sucesso) {
         setSucesso(res.mensagem);
         setStep(3);
-        setTimeout(() => setSucesso(''), 3000);
+        setTimeout(() => undefined, 3000);
       } else {
         setErro(res.mensagem || 'Código inválido');

[NoCoverage] StringLiteral
src/pages/Recovery.tsx:62:37
       if (res.sucesso) {
         setSucesso(res.mensagem);
         setStep(3);
-        setTimeout(() => setSucesso(''), 3000);
+        setTimeout(() => setSucesso("Stryker was here!"), 3000);
       } else {
         setErro(res.mensagem || 'Código inválido');

[Killed] BlockStatement
src/pages/Recovery.tsx:63:14
         setSucesso(res.mensagem);
         setStep(3);
         setTimeout(() => setSucesso(''), 3000);
-      } else {
-        setErro(res.mensagem || 'Código inválido');
-        triggerShake();
-      }
+      } else {}
     } catch {
       setErro('Erro no servidor');
killedBy: Recovery Component - Unit Tests Passo 2: Erro ao submeter OTP inválido
statusReason: Unable to find an element with the text: /Código inválido/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Killed] ConditionalExpression
src/pages/Recovery.tsx:64:17
         setStep(3);
         setTimeout(() => setSucesso(''), 3000);
       } else {
-        setErro(res.mensagem || 'Código inválido');
+        setErro(true);
         triggerShake();
       }
killedBy: Recovery Component - Unit Tests Passo 2: Erro ao submeter OTP inválido
statusReason: Unable to find an element with the text: /Código inválido/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Killed] ConditionalExpression
src/pages/Recovery.tsx:64:17
         setStep(3);
         setTimeout(() => setSucesso(''), 3000);
       } else {
-        setErro(res.mensagem || 'Código inválido');
+        setErro(false);
         triggerShake();
       }
killedBy: Recovery Component - Unit Tests Passo 2: Erro ao submeter OTP inválido
statusReason: Unable to find an element with the text: /Código inválido/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Survived] ConditionalExpression
src/pages/Recovery.tsx:76:9
   };
 
   const handleResetPassword = async (e: React.FormEvent) => {
-    if (e) e.preventDefault();
+    if (true) e.preventDefault();
     setErro('');
 

[Survived] ConditionalExpression
src/pages/Recovery.tsx:76:9
   };
 
   const handleResetPassword = async (e: React.FormEvent) => {
-    if (e) e.preventDefault();
+    if (false) e.preventDefault();
     setErro('');
 

[Survived] StringLiteral
src/pages/Recovery.tsx:77:13
 
   const handleResetPassword = async (e: React.FormEvent) => {
     if (e) e.preventDefault();
-    setErro('');
+    setErro("Stryker was here!");
 
     if (senha !== confirmarSenha) {

[Killed] ConditionalExpression
src/pages/Recovery.tsx:79:9
     if (e) e.preventDefault();
     setErro('');
 
-    if (senha !== confirmarSenha) {
+    if (false) {
       setErro('As senhas não coincidem.');
       triggerShake();
killedBy: Recovery Component - Unit Tests Passo 3: Erro de senhas que não coincidem
statusReason: Unable to find an element with the text: /As senhas não coincidem./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Killed] BlockStatement
src/pages/Recovery.tsx:79:35
     if (e) e.preventDefault();
     setErro('');
 
-    if (senha !== confirmarSenha) {
-      setErro('As senhas não coincidem.');
-      triggerShake();
-      return;
-    }
+    if (senha !== confirmarSenha) {}
 
     setLoading(true);
killedBy: Recovery Component - Unit Tests Passo 3: Erro de senhas que não coincidem
statusReason: Unable to find an element with the text: /As senhas não coincidem./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Killed] BlockStatement
src/pages/Recovery.tsx:86:9
     }
 
     setLoading(true);
-    try {
-      const res = await resetPassword(email, code, senha);
-      if (res.sucesso) {
-        setSucesso('Senha redefinida com sucesso! Redirecionando...');
-        setTimeout(() => navigate('/login'), 2000);
-      } else {
-        setErro(res.mensagem || 'Erro ao redefinir senha');
-        triggerShake();
-      }
-    } catch {
+    try {} catch {
       setErro('Erro no servidor');
       triggerShake();
killedBy: Recovery Component - Unit Tests Passo 3: Redefine senha com sucesso
statusReason: expected "vi.fn()" to be called with arguments: [ 'teste@unb.br', '000000', …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
src/pages/Recovery.tsx:88:11
     setLoading(true);
     try {
       const res = await resetPassword(email, code, senha);
-      if (res.sucesso) {
+      if (true) {
         setSucesso('Senha redefinida com sucesso! Redirecionando...');
         setTimeout(() => navigate('/login'), 2000);
killedBy: Recovery Component - Unit Tests Passo 3: Erro da API ao redefinir senha
statusReason: Unable to find an element with the text: /Token expirado/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Killed] ConditionalExpression
src/pages/Recovery.tsx:88:11
     setLoading(true);
     try {
       const res = await resetPassword(email, code, senha);
-      if (res.sucesso) {
+      if (false) {
         setSucesso('Senha redefinida com sucesso! Redirecionando...');
         setTimeout(() => navigate('/login'), 2000);
killedBy: Recovery Component - Unit Tests Passo 3: Redefine senha com sucesso
statusReason: Unable to find an element with the text: /Senha redefinida com sucesso!/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Killed] StringLiteral
src/pages/Recovery.tsx:89:20
     try {
       const res = await resetPassword(email, code, senha);
       if (res.sucesso) {
-        setSucesso('Senha redefinida com sucesso! Redirecionando...');
+        setSucesso("");
         setTimeout(() => navigate('/login'), 2000);
       } else {
killedBy: Recovery Component - Unit Tests Passo 3: Redefine senha com sucesso
statusReason: Unable to find an element with the text: /Senha redefinida com sucesso!/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Survived] ArrowFunction
src/pages/Recovery.tsx:90:20
       const res = await resetPassword(email, code, senha);
       if (res.sucesso) {
         setSucesso('Senha redefinida com sucesso! Redirecionando...');
-        setTimeout(() => navigate('/login'), 2000);
+        setTimeout(() => undefined, 2000);
       } else {
         setErro(res.mensagem || 'Erro ao redefinir senha');

[NoCoverage] StringLiteral
src/pages/Recovery.tsx:90:35
       const res = await resetPassword(email, code, senha);
       if (res.sucesso) {
         setSucesso('Senha redefinida com sucesso! Redirecionando...');
-        setTimeout(() => navigate('/login'), 2000);
+        setTimeout(() => navigate(""), 2000);
       } else {
         setErro(res.mensagem || 'Erro ao redefinir senha');

[Killed] BlockStatement
src/pages/Recovery.tsx:91:14
       if (res.sucesso) {
         setSucesso('Senha redefinida com sucesso! Redirecionando...');
         setTimeout(() => navigate('/login'), 2000);
-      } else {
-        setErro(res.mensagem || 'Erro ao redefinir senha');
-        triggerShake();
-      }
+      } else {}
     } catch {
       setErro('Erro no servidor');
killedBy: Recovery Component - Unit Tests Passo 3: Erro da API ao redefinir senha
statusReason: Unable to find an element with the text: /Token expirado/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Killed] ConditionalExpression
src/pages/Recovery.tsx:92:17
         setSucesso('Senha redefinida com sucesso! Redirecionando...');
         setTimeout(() => navigate('/login'), 2000);
       } else {
-        setErro(res.mensagem || 'Erro ao redefinir senha');
+        setErro(true);
         triggerShake();
       }
killedBy: Recovery Component - Unit Tests Passo 3: Erro da API ao redefinir senha
statusReason: Unable to find an element with the text: /Token expirado/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Killed] LogicalOperator
src/pages/Recovery.tsx:92:17
         setSucesso('Senha redefinida com sucesso! Redirecionando...');
         setTimeout(() => navigate('/login'), 2000);
       } else {
-        setErro(res.mensagem || 'Erro ao redefinir senha');
+        setErro(res.mensagem && 'Erro ao redefinir senha');
         triggerShake();
       }
killedBy: Recovery Component - Unit Tests Passo 3: Erro da API ao redefinir senha
statusReason: Unable to find an element with the text: /Token expirado/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Survived] UnaryOperator
src/pages/Recovery.tsx:111:36
   };
 
   const shakeVariants = {
-    shake: { x: [-10, 10, -10, 10, -5, 5, 0], transition: { duration: 0.4 } },
+    shake: { x: [-10, 10, -10, 10, +5, 5, 0], transition: { duration: 0.4 } },
   };
 

[Survived] UnaryOperator
src/pages/Recovery.tsx:111:27
   };
 
   const shakeVariants = {
-    shake: { x: [-10, 10, -10, 10, -5, 5, 0], transition: { duration: 0.4 } },
+    shake: { x: [-10, 10, +10, 10, -5, 5, 0], transition: { duration: 0.4 } },
   };
 

[Killed] EqualityOperator
src/pages/Recovery.tsx:115:5
   };
 
   const title =
-    step === 1 ? 'Esqueceu a senha?' : step === 2 ? 'Verificação de Código' : 'Nova Senha';
+    step !== 1 ? 'Esqueceu a senha?' : step === 2 ? 'Verificação de Código' : 'Nova Senha';
   const subtitle =
     step === 1
killedBy: Recovery Component - Unit Tests Renderiza o Passo 1 inicialmente e pede e-mail institucional
statusReason: Unable to find an element with the text: Esqueceu a senha?. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Killed] ConditionalExpression
src/pages/Recovery.tsx:115:40
   };
 
   const title =
-    step === 1 ? 'Esqueceu a senha?' : step === 2 ? 'Verificação de Código' : 'Nova Senha';
+    step === 1 ? 'Esqueceu a senha?' : false ? 'Verificação de Código' : 'Nova Senha';
   const subtitle =
     step === 1
killedBy: Recovery Component - Unit Tests Submete e-mail e avança para Passo 2 com sucesso
statusReason: Unable to find an element with the text: Verificação de Código. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Survived] ConditionalExpression
src/pages/Recovery.tsx:117:5
   const title =
     step === 1 ? 'Esqueceu a senha?' : step === 2 ? 'Verificação de Código' : 'Nova Senha';
   const subtitle =
-    step === 1
+    true
       ? 'Informe seu e-mail para receber um código de segurança.'
       : step === 2

[Survived] ConditionalExpression
src/pages/Recovery.tsx:117:5
   const title =
     step === 1 ? 'Esqueceu a senha?' : step === 2 ? 'Verificação de Código' : 'Nova Senha';
   const subtitle =
-    step === 1
+    false
       ? 'Informe seu e-mail para receber um código de segurança.'
       : step === 2

[Survived] StringLiteral
src/pages/Recovery.tsx:118:9
     step === 1 ? 'Esqueceu a senha?' : step === 2 ? 'Verificação de Código' : 'Nova Senha';
   const subtitle =
     step === 1
-      ? 'Informe seu e-mail para receber um código de segurança.'
+      ? ""
       : step === 2
         ? `Enviamos um código de 6 dígitos para ${email}`

[Survived] EqualityOperator
src/pages/Recovery.tsx:119:9
   const subtitle =
     step === 1
       ? 'Informe seu e-mail para receber um código de segurança.'
-      : step === 2
+      : step !== 2
         ? `Enviamos um código de 6 dígitos para ${email}`
         : 'Crie uma nova senha forte para sua conta.';

[Survived] ConditionalExpression
src/pages/Recovery.tsx:119:9
   const subtitle =
     step === 1
       ? 'Informe seu e-mail para receber um código de segurança.'
-      : step === 2
+      : false
         ? `Enviamos um código de 6 dígitos para ${email}`
         : 'Crie uma nova senha forte para sua conta.';

[Survived] StringLiteral
src/pages/Recovery.tsx:120:11
     step === 1
       ? 'Informe seu e-mail para receber um código de segurança.'
       : step === 2
-        ? `Enviamos um código de 6 dígitos para ${email}`
+        ? ``
         : 'Crie uma nova senha forte para sua conta.';
 

[Survived] StringLiteral
src/pages/Recovery.tsx:121:11
       ? 'Informe seu e-mail para receber um código de segurança.'
       : step === 2
         ? `Enviamos um código de 6 dígitos para ${email}`
-        : 'Crie uma nova senha forte para sua conta.';
+        : "";
 
   return (

[Survived] ObjectLiteral
src/pages/Recovery.tsx:125:19
 
   return (
     <AuthLayout title={title} subtitle={subtitle}>
-      <div style={{ width: '100%' }} key={step}>
+      <div style={{}} key={step}>
         <form
           onSubmit={
