[Killed] EqualityOperator
src/pages/Recovery.tsx:128:13
       <div style={{ width: '100%' }} key={step}>
         <form
           onSubmit={
-            step === 1 ? handleRequestCode : step === 2 ? handleVerifyCode : handleResetPassword
+            step !== 1 ? handleRequestCode : step === 2 ? handleVerifyCode : handleResetPassword
           }
           onInvalid={(e) => {
killedBy: Recovery Component - Unit Tests Submete e-mail e avança para Passo 2 com sucesso
statusReason: expected "vi.fn()" to be called with arguments: [ 'teste@unb.br' ]

Number of calls: 0

[Killed] ConditionalExpression
src/pages/Recovery.tsx:128:13
       <div style={{ width: '100%' }} key={step}>
         <form
           onSubmit={
-            step === 1 ? handleRequestCode : step === 2 ? handleVerifyCode : handleResetPassword
+            false ? handleRequestCode : step === 2 ? handleVerifyCode : handleResetPassword
           }
           onInvalid={(e) => {
killedBy: Recovery Component - Unit Tests Submete e-mail e avança para Passo 2 com sucesso
statusReason: expected "vi.fn()" to be called with arguments: [ 'teste@unb.br' ]

Number of calls: 0

[Survived] BlockStatement
src/pages/Recovery.tsx:130:29
           onSubmit={
             step === 1 ? handleRequestCode : step === 2 ? handleVerifyCode : handleResetPassword
           }
-          onInvalid={(e) => {
-            e.preventDefault();
-            triggerShake();
-          }}
+          onInvalid={(e) => {}}
         >
           {erro && (

[Killed] ConditionalExpression
src/pages/Recovery.tsx:135:12
             triggerShake();
           }}
         >
-          {erro && (
-            <motion.div
-              initial={{ opacity: 0, height: 0 }}
-              animate={{ opacity: 1, height: 'auto' }}
-              className={styles.errorAlert}
-            >
-              <span style={{ marginRight: '8px' }}>⚠️</span> {erro}
-            </motion.div>
-          )}
+          {true}
           {sucesso && (
             <motion.div
killedBy: Recovery Component - Unit Tests Exibe erro se a API retornar falha no Passo 1
statusReason: Unable to find an element with the text: /E-mail não encontrado/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Killed] ConditionalExpression
src/pages/Recovery.tsx:135:12
             triggerShake();
           }}
         >
-          {erro && (
-            <motion.div
-              initial={{ opacity: 0, height: 0 }}
-              animate={{ opacity: 1, height: 'auto' }}
-              className={styles.errorAlert}
-            >
-              <span style={{ marginRight: '8px' }}>⚠️</span> {erro}
-            </motion.div>
-          )}
+          {false}
           {sucesso && (
             <motion.div
killedBy: Recovery Component - Unit Tests Exibe erro se a API retornar falha no Passo 1
statusReason: Unable to find an element with the text: /E-mail não encontrado/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Survived] StringLiteral
src/pages/Recovery.tsx:138:46
           {erro && (
             <motion.div
               initial={{ opacity: 0, height: 0 }}
-              animate={{ opacity: 1, height: 'auto' }}
+              animate={{ opacity: 1, height: "" }}
               className={styles.errorAlert}
             >

[Survived] ObjectLiteral
src/pages/Recovery.tsx:141:28
               animate={{ opacity: 1, height: 'auto' }}
               className={styles.errorAlert}
             >
-              <span style={{ marginRight: '8px' }}>⚠️</span> {erro}
+              <span style={{}}>⚠️</span> {erro}
             </motion.div>
           )}

[Killed] ConditionalExpression
src/pages/Recovery.tsx:144:12
               <span style={{ marginRight: '8px' }}>⚠️</span> {erro}
             </motion.div>
           )}
-          {sucesso && (
-            <motion.div
-              initial={{ opacity: 0, height: 0 }}
-              animate={{ opacity: 1, height: 'auto' }}
-              className={styles.successAlert}
-              style={{
-                background: 'rgba(0,255,0,0.1)',
-                color: '#00cc00',
-                padding: '1rem',
-                borderRadius: '8px',
-                marginBottom: '1.5rem',
-                border: '1px solid rgba(0,255,0,0.2)',
-              }}
-            >
-              <span style={{ marginRight: '8px' }}>✅</span> {sucesso}
-            </motion.div>
-          )}
+          {false}
 
           {step === 1 && (
killedBy: Recovery Component - Unit Tests Passo 3: Redefine senha com sucesso
statusReason: Unable to find an element with the text: /Senha redefinida com sucesso!/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Killed] ConditionalExpression
src/pages/Recovery.tsx:144:12
               <span style={{ marginRight: '8px' }}>⚠️</span> {erro}
             </motion.div>
           )}
-          {sucesso && (
-            <motion.div
-              initial={{ opacity: 0, height: 0 }}
-              animate={{ opacity: 1, height: 'auto' }}
-              className={styles.successAlert}
-              style={{
-                background: 'rgba(0,255,0,0.1)',
-                color: '#00cc00',
-                padding: '1rem',
-                borderRadius: '8px',
-                marginBottom: '1.5rem',
-                border: '1px solid rgba(0,255,0,0.2)',
-              }}
-            >
-              <span style={{ marginRight: '8px' }}>✅</span> {sucesso}
-            </motion.div>
-          )}
+          {true}
 
           {step === 1 && (
killedBy: Recovery Component - Unit Tests Passo 3: Redefine senha com sucesso
statusReason: Unable to find an element with the text: /Senha redefinida com sucesso!/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Survived] ObjectLiteral
src/pages/Recovery.tsx:149:22
               initial={{ opacity: 0, height: 0 }}
               animate={{ opacity: 1, height: 'auto' }}
               className={styles.successAlert}
-              style={{
-                background: 'rgba(0,255,0,0.1)',
-                color: '#00cc00',
-                padding: '1rem',
-                borderRadius: '8px',
-                marginBottom: '1.5rem',
-                border: '1px solid rgba(0,255,0,0.2)',
-              }}
+              style={{}}
             >
               <span style={{ marginRight: '8px' }}>✅</span> {sucesso}

[Survived] StringLiteral
src/pages/Recovery.tsx:152:26
               style={{
                 background: 'rgba(0,255,0,0.1)',
                 color: '#00cc00',
-                padding: '1rem',
+                padding: "",
                 borderRadius: '8px',
                 marginBottom: '1.5rem',

[Survived] StringLiteral
src/pages/Recovery.tsx:154:31
                 color: '#00cc00',
                 padding: '1rem',
                 borderRadius: '8px',
-                marginBottom: '1.5rem',
+                marginBottom: "",
                 border: '1px solid rgba(0,255,0,0.2)',
               }}

[Survived] StringLiteral
src/pages/Recovery.tsx:155:25
                 padding: '1rem',
                 borderRadius: '8px',
                 marginBottom: '1.5rem',
-                border: '1px solid rgba(0,255,0,0.2)',
+                border: "",
               }}
             >

[Survived] StringLiteral
src/pages/Recovery.tsx:158:43
                 border: '1px solid rgba(0,255,0,0.2)',
               }}
             >
-              <span style={{ marginRight: '8px' }}>✅</span> {sucesso}
+              <span style={{ marginRight: "" }}>✅</span> {sucesso}
             </motion.div>
           )}

[Killed] ConditionalExpression
src/pages/Recovery.tsx:162:12
             </motion.div>
           )}
 
-          {step === 1 && (
-            <motion.div variants={itemVariants} className={styles.inputGroup}>
-              <div className={styles.labelRow}>
-                <label className={styles.inputLabel}>E-mail Institucional</label>
-              </div>
-              <div className={styles.inputWrapper}>
-                <input
-                  className={styles.inputField}
-                  type="email"
-                  value={email}
-                  onChange={(e) => setEmail(e.target.value)}
-                  placeholder="seu.nome@universidade.br"
-                  required
-                />
-              </div>
-            </motion.div>
-          )}
+          {true}
 
           {step === 2 && (
killedBy: Recovery Component - Unit Tests Renderiza o Passo 1 inicialmente e pede e-mail institucional
statusReason: Unable to find an element with the placeholder text of: seu.nome@universidade.br

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Killed] LogicalOperator
src/pages/Recovery.tsx:162:12
             </motion.div>
           )}
 
-          {step === 1 && (
-            <motion.div variants={itemVariants} className={styles.inputGroup}>
-              <div className={styles.labelRow}>
-                <label className={styles.inputLabel}>E-mail Institucional</label>
-              </div>
-              <div className={styles.inputWrapper}>
-                <input
-                  className={styles.inputField}
-                  type="email"
-                  value={email}
-                  onChange={(e) => setEmail(e.target.value)}
-                  placeholder="seu.nome@universidade.br"
-                  required
-                />
-              </div>
-            </motion.div>
-          )}
+          {step === 1 || <motion.div variants={itemVariants} className={styles.inputGroup}>
+              <div className={styles.labelRow}>
+                <label className={styles.inputLabel}>E-mail Institucional</label>
+              </div>
+              <div className={styles.inputWrapper}>
+                <input className={styles.inputField} type="email" value={email} onChange={e => setEmail(e.target.value)} placeholder="seu.nome@universidade.br" required />
+              </div>
+            </motion.div>}
 
           {step === 2 && (
killedBy: Recovery Component - Unit Tests Renderiza o Passo 1 inicialmente e pede e-mail institucional
statusReason: Unable to find an element with the placeholder text of: seu.nome@universidade.br

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Killed] ArrowFunction
src/pages/Recovery.tsx:172:29
                   className={styles.inputField}
                   type="email"
                   value={email}
-                  onChange={(e) => setEmail(e.target.value)}
+                  onChange={() => undefined}
                   placeholder="seu.nome@universidade.br"
                   required
killedBy: Recovery Component - Unit Tests Submete e-mail e avança para Passo 2 com sucesso
statusReason: expected "vi.fn()" to be called with arguments: [ 'teste@unb.br' ]

Number of calls: 0

[Killed] ConditionalExpression
src/pages/Recovery.tsx:180:12
             </motion.div>
           )}
 
-          {step === 2 && (
+          {true && (
             <motion.div variants={itemVariants} className={styles.inputGroup}>
               <div className={styles.labelRow}>
killedBy: Recovery Component - Unit Tests Submete e-mail e avança para Passo 2 com sucesso
statusReason: expected "vi.fn()" to be called with arguments: [ 'teste@unb.br' ]

Number of calls: 0

[Killed] EqualityOperator
src/pages/Recovery.tsx:180:12
             </motion.div>
           )}
 
-          {step === 2 && (
+          {step !== 2 && (
             <motion.div variants={itemVariants} className={styles.inputGroup}>
               <div className={styles.labelRow}>
killedBy: Recovery Component - Unit Tests Submete e-mail e avança para Passo 2 com sucesso
statusReason: expected "vi.fn()" to be called with arguments: [ 'teste@unb.br' ]

Number of calls: 0

[Killed] ArrowFunction
src/pages/Recovery.tsx:187:28
                 <button
                   type="button"
                   className={styles.forgotLink}
-                  onClick={() => setStep(1)}
+                  onClick={() => undefined}
                   style={{ background: 'none', border: 'none', cursor: 'pointer', padding: 0 }}
                 >
killedBy: Recovery Component - Unit Tests Passo 2: Volta para o Passo 1 ao clicar em Alterar e-mail
statusReason: Unable to find role="heading" and name "Esqueceu a senha?"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Killed] ArrowFunction
src/pages/Recovery.tsx:198:29
                   className={styles.inputField}
                   type="text"
                   value={code}
-                  onChange={(e) => setCode(e.target.value)}
+                  onChange={() => undefined}
                   placeholder="123456"
                   maxLength={6}
killedBy: Recovery Component - Unit Tests Passo 2: Submete código OTP e avança para Passo 3
statusReason: expected "vi.fn()" to be called with arguments: [ 'teste@unb.br', '000000' ]

Number of calls: 0

[Killed] ConditionalExpression
src/pages/Recovery.tsx:207:12
             </motion.div>
           )}
 
-          {step === 3 && (
+          {true && (
             <>
               <motion.div variants={itemVariants} className={styles.inputGroup}>
killedBy: Recovery Component - Unit Tests Submete e-mail e avança para Passo 2 com sucesso
statusReason: expected "vi.fn()" to be called with arguments: [ 'teste@unb.br' ]

Number of calls: 0

[Killed] EqualityOperator
src/pages/Recovery.tsx:207:12
             </motion.div>
           )}
 
-          {step === 3 && (
+          {step !== 3 && (
             <>
               <motion.div variants={itemVariants} className={styles.inputGroup}>
killedBy: Recovery Component - Unit Tests Submete e-mail e avança para Passo 2 com sucesso
statusReason: expected "vi.fn()" to be called with arguments: [ 'teste@unb.br' ]

Number of calls: 0

[Killed] ArrowFunction
src/pages/Recovery.tsx:218:31
                     className={styles.inputField}
                     type={showPassword ? 'text' : 'password'}
                     value={senha}
-                    onChange={(e) => setSenha(e.target.value)}
+                    onChange={() => undefined}
                     placeholder="••••••••"
                     required
killedBy: Recovery Component - Unit Tests Passo 3: Redefine senha com sucesso
statusReason: expected "vi.fn()" to be called with arguments: [ 'teste@unb.br', '000000', …(1) ]

Number of calls: 0

[Killed] BooleanLiteral
src/pages/Recovery.tsx:225:52
                   <button
                     type="button"
                     className={styles.passwordToggle}
-                    onClick={() => setShowPassword(!showPassword)}
+                    onClick={() => setShowPassword(showPassword)}
                     aria-label="Mostrar senha"
                   >
killedBy: Recovery Component - Unit Tests Passo 3: Alterna visibilidade das senhas
statusReason: expect(element).toHaveAttribute("type", "text") // element.getAttribute("type") === "text"

Expected the element to have attribute:
  type="text"
Received:
  type="password"

[Killed] ArrowFunction
src/pages/Recovery.tsx:225:30
                   <button
                     type="button"
                     className={styles.passwordToggle}
-                    onClick={() => setShowPassword(!showPassword)}
+                    onClick={() => undefined}
                     aria-label="Mostrar senha"
                   >
killedBy: Recovery Component - Unit Tests Passo 3: Alterna visibilidade das senhas
statusReason: expect(element).toHaveAttribute("type", "text") // element.getAttribute("type") === "text"

Expected the element to have attribute:
  type="text"
Received:
  type="password"

[Killed] StringLiteral
src/pages/Recovery.tsx:267:49
                 <div className={styles.inputWrapper}>
                   <input
                     className={styles.inputField}
-                    type={showConfirmPassword ? 'text' : 'password'}
+                    type={showConfirmPassword ? "" : 'password'}
                     value={confirmarSenha}
                     onChange={(e) => setConfirmarSenha(e.target.value)}
killedBy: Recovery Component - Unit Tests Passo 3: Alterna visibilidade das senhas
statusReason: expect(element).toHaveAttribute("type", "text") // element.getAttribute("type") === "text"

Expected the element to have attribute:
  type="text"
Received:
  type=""

[Killed] ArrowFunction
src/pages/Recovery.tsx:269:31
                     className={styles.inputField}
                     type={showConfirmPassword ? 'text' : 'password'}
                     value={confirmarSenha}
-                    onChange={(e) => setConfirmarSenha(e.target.value)}
+                    onChange={() => undefined}
                     placeholder="••••••••"
                     required
killedBy: Recovery Component - Unit Tests Passo 3: Redefine senha com sucesso
statusReason: expected "vi.fn()" to be called with arguments: [ 'teste@unb.br', '000000', …(1) ]

Number of calls: 0

[Killed] ArrowFunction
src/pages/Recovery.tsx:276:30
                   <button
                     type="button"
                     className={styles.passwordToggle}
-                    onClick={() => setShowConfirmPassword(!showConfirmPassword)}
+                    onClick={() => undefined}
                     aria-label="Mostrar confirmação de senha"
                   >
killedBy: Recovery Component - Unit Tests Passo 3: Alterna visibilidade das senhas
statusReason: expect(element).toHaveAttribute("type", "text") // element.getAttribute("type") === "text"

Expected the element to have attribute:
  type="text"
Received:
  type="password"

[Killed] BooleanLiteral
src/pages/Recovery.tsx:276:59
                   <button
                     type="button"
                     className={styles.passwordToggle}
-                    onClick={() => setShowConfirmPassword(!showConfirmPassword)}
+                    onClick={() => setShowConfirmPassword(showConfirmPassword)}
                     aria-label="Mostrar confirmação de senha"
                   >
killedBy: Recovery Component - Unit Tests Passo 3: Alterna visibilidade das senhas
statusReason: expect(element).toHaveAttribute("type", "text") // element.getAttribute("type") === "text"

Expected the element to have attribute:
  type="text"
Received:
  type="password"

[Killed] ConditionalExpression
src/pages/Recovery.tsx:323:43
             className={styles.submitBtn}
             disabled={loading}
           >
-            {loading ? 'Processando...' : step === 3 ? 'Redefinir Senha' : 'Continuar'}{' '}
+            {loading ? 'Processando...' : true ? 'Redefinir Senha' : 'Continuar'}{' '}
             <span>→</span>
           </motion.button>
killedBy: Recovery Component - Unit Tests Submete e-mail e avança para Passo 2 com sucesso
statusReason: Unable to find an accessible element with the role "button" and name `/Continuar/i`

Here are the accessible roles:

  heading:

  Name "Governança de Pesquisa Acadêmica":
  <h1

[Killed] EqualityOperator
src/pages/Recovery.tsx:323:43
             className={styles.submitBtn}
             disabled={loading}
           >
-            {loading ? 'Processando...' : step === 3 ? 'Redefinir Senha' : 'Continuar'}{' '}
+            {loading ? 'Processando...' : step !== 3 ? 'Redefinir Senha' : 'Continuar'}{' '}
             <span>→</span>
           </motion.button>
killedBy: Recovery Component - Unit Tests Submete e-mail e avança para Passo 2 com sucesso
statusReason: Unable to find an accessible element with the role "button" and name `/Continuar/i`

Here are the accessible roles:

  heading:

  Name "Governança de Pesquisa Acadêmica":
  <h1

[Survived] StringLiteral
src/pages/Recovery.tsx:330:49
 
         <motion.p
           variants={itemVariants}
-          style={{ textAlign: 'center', margin: '1.5rem 0 0 0', fontSize: '0.875rem' }}
+          style={{ textAlign: 'center', margin: "", fontSize: '0.875rem' }}
         >
           Lembrou a senha?{' '}

[Survived] StringLiteral
src/pages/Recovery.tsx:330:31
 
         <motion.p
           variants={itemVariants}
-          style={{ textAlign: 'center', margin: '1.5rem 0 0 0', fontSize: '0.875rem' }}
+          style={{ textAlign: "", margin: '1.5rem 0 0 0', fontSize: '0.875rem' }}
         >
           Lembrou a senha?{' '}
