[Killed] OptionalChaining
src/pages/dashboard.tsx:10:21
 const Dashboard: React.FC = () => {
   const navigate = useNavigate();
   const { user } = useAuth();
-  const firstName = user?.name?.split(' ')[0] || 'Usuário';
+  const firstName = user?.name.split(' ')[0] || 'Usuário';
 
   const [stats, setStats] = useState({
killedBy: Dashboard Page handles empty documents for RESEARCHER
statusReason: Cannot read properties of undefined (reading 'split')

[Killed] LogicalOperator
src/pages/dashboard.tsx:10:21
 const Dashboard: React.FC = () => {
   const navigate = useNavigate();
   const { user } = useAuth();
-  const firstName = user?.name?.split(' ')[0] || 'Usuário';
+  const firstName = user?.name?.split(' ')[0] && 'Usuário';
 
   const [stats, setStats] = useState({
killedBy: Dashboard Page renders default user and UNKNOWN role properly
statusReason: Unable to find an element with the text: Bom dia, Usuário. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] ObjectLiteral
src/pages/dashboard.tsx:12:38
   const { user } = useAuth();
   const firstName = user?.name?.split(' ')[0] || 'Usuário';
 
-  const [stats, setStats] = useState({
-    activeDocuments: 0,
-    pendingReview: 0,
-    complianceScore: 0,
-    researchProgress: 0,
-  });
+  const [stats, setStats] = useState({});
   const [auditorStats, setAuditorStats] = useState<any>(null);
   const [recentLogs, setRecentLogs] = useState<any[]>([]);

[Killed] ArrayDeclaration
src/pages/dashboard.tsx:19:55
     researchProgress: 0,
   });
   const [auditorStats, setAuditorStats] = useState<any>(null);
-  const [recentLogs, setRecentLogs] = useState<any[]>([]);
+  const [recentLogs, setRecentLogs] = useState<any[]>(["Stryker was here"]);
   const [recentDocs, setRecentDocs] = useState<any[]>([]);
 
killedBy: Dashboard Page renders correctly for AUDITOR role
statusReason: Cannot read properties of undefined (reading 'substring')

[Killed] BlockStatement
src/pages/dashboard.tsx:22:19
   const [recentLogs, setRecentLogs] = useState<any[]>([]);
   const [recentDocs, setRecentDocs] = useState<any[]>([]);
 
-  useEffect(() => {
-    if (user?.role === 'RESEARCHER' || user?.role === 'ADVISOR') {
-      getDashboardStats().then((data) => {
-        if (data) setStats(data);
-      });
-      getDocuments().then((resp) => {
-        if (resp.sucesso) {
-          setRecentDocs(resp.dados.content?.slice(0, 3) || []);
-        }
-      });
-    } else if (user?.role === 'AUDITOR') {
-      getComplianceStats().then((data) => {
-        if (data) setAuditorStats(data);
-      });
-      getAuditLogs().then((logs) => {
-        setRecentLogs(logs.slice(0, 3));
-      });
-    }
-  }, [user]);
+  useEffect(() => {}, [user]);
 
   const customTopbar = (
killedBy: Dashboard Page renders correctly for RESEARCHER role
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] OptionalChaining
src/pages/dashboard.tsx:23:9
   const [recentDocs, setRecentDocs] = useState<any[]>([]);
 
   useEffect(() => {
-    if (user?.role === 'RESEARCHER' || user?.role === 'ADVISOR') {
+    if (user.role === 'RESEARCHER' || user?.role === 'ADVISOR') {
       getDashboardStats().then((data) => {
         if (data) setStats(data);
killedBy: Dashboard Page renders default user and UNKNOWN role properly
statusReason: Cannot read properties of null (reading 'role')

[Killed] EqualityOperator
src/pages/dashboard.tsx:23:9
   const [recentDocs, setRecentDocs] = useState<any[]>([]);
 
   useEffect(() => {
-    if (user?.role === 'RESEARCHER' || user?.role === 'ADVISOR') {
+    if (user?.role !== 'RESEARCHER' || user?.role === 'ADVISOR') {
       getDashboardStats().then((data) => {
         if (data) setStats(data);
killedBy: Dashboard Page renders correctly for RESEARCHER role
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/pages/dashboard.tsx:24:42
 
   useEffect(() => {
     if (user?.role === 'RESEARCHER' || user?.role === 'ADVISOR') {
-      getDashboardStats().then((data) => {
-        if (data) setStats(data);
-      });
+      getDashboardStats().then((data) => {});
       getDocuments().then((resp) => {
         if (resp.sucesso) {
killedBy: Dashboard Page renders correctly for RESEARCHER role
statusReason: Unable to find an element with the text: 10. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/dashboard.tsx:25:13
   useEffect(() => {
     if (user?.role === 'RESEARCHER' || user?.role === 'ADVISOR') {
       getDashboardStats().then((data) => {
-        if (data) setStats(data);
+        if (false) setStats(data);
       });
       getDocuments().then((resp) => {
killedBy: Dashboard Page renders correctly for RESEARCHER role
statusReason: Unable to find an element with the text: 10. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] ConditionalExpression
src/pages/dashboard.tsx:25:13
   useEffect(() => {
     if (user?.role === 'RESEARCHER' || user?.role === 'ADVISOR') {
       getDashboardStats().then((data) => {
-        if (data) setStats(data);
+        if (true) setStats(data);
       });
       getDocuments().then((resp) => {

[Killed] BlockStatement
src/pages/dashboard.tsx:27:37
       getDashboardStats().then((data) => {
         if (data) setStats(data);
       });
-      getDocuments().then((resp) => {
-        if (resp.sucesso) {
-          setRecentDocs(resp.dados.content?.slice(0, 3) || []);
-        }
-      });
+      getDocuments().then((resp) => {});
     } else if (user?.role === 'AUDITOR') {
       getComplianceStats().then((data) => {
killedBy: Dashboard Page renders correctly for RESEARCHER role
statusReason: Unable to find an element with the text: doc1.pdf. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/dashboard.tsx:28:27
         if (data) setStats(data);
       });
       getDocuments().then((resp) => {
-        if (resp.sucesso) {
-          setRecentDocs(resp.dados.content?.slice(0, 3) || []);
-        }
+        if (resp.sucesso) {}
       });
     } else if (user?.role === 'AUDITOR') {
killedBy: Dashboard Page renders correctly for RESEARCHER role
statusReason: Unable to find an element with the text: doc1.pdf. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/dashboard.tsx:28:13
         if (data) setStats(data);
       });
       getDocuments().then((resp) => {
-        if (resp.sucesso) {
+        if (false) {
           setRecentDocs(resp.dados.content?.slice(0, 3) || []);
         }
killedBy: Dashboard Page renders correctly for RESEARCHER role
statusReason: Unable to find an element with the text: doc1.pdf. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/dashboard.tsx:29:25
       });
       getDocuments().then((resp) => {
         if (resp.sucesso) {
-          setRecentDocs(resp.dados.content?.slice(0, 3) || []);
+          setRecentDocs(true);
         }
       });
killedBy: Dashboard Page renders correctly for RESEARCHER role
statusReason: Unable to find an element with the text: doc1.pdf. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/dashboard.tsx:29:25
       });
       getDocuments().then((resp) => {
         if (resp.sucesso) {
-          setRecentDocs(resp.dados.content?.slice(0, 3) || []);
+          setRecentDocs(false);
         }
       });
killedBy: Dashboard Page renders correctly for RESEARCHER role
statusReason: Unable to find an element with the text: doc1.pdf. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/dashboard.tsx:32:16
           setRecentDocs(resp.dados.content?.slice(0, 3) || []);
         }
       });
-    } else if (user?.role === 'AUDITOR') {
+    } else if (false) {
       getComplianceStats().then((data) => {
         if (data) setAuditorStats(data);
killedBy: Dashboard Page renders correctly for AUDITOR role
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] OptionalChaining
src/pages/dashboard.tsx:32:16
           setRecentDocs(resp.dados.content?.slice(0, 3) || []);
         }
       });
-    } else if (user?.role === 'AUDITOR') {
+    } else if (user.role === 'AUDITOR') {
       getComplianceStats().then((data) => {
         if (data) setAuditorStats(data);
killedBy: Dashboard Page renders default user and UNKNOWN role properly
statusReason: Cannot read properties of null (reading 'role')

[Killed] BlockStatement
src/pages/dashboard.tsx:33:43
         }
       });
     } else if (user?.role === 'AUDITOR') {
-      getComplianceStats().then((data) => {
-        if (data) setAuditorStats(data);
-      });
+      getComplianceStats().then((data) => {});
       getAuditLogs().then((logs) => {
         setRecentLogs(logs.slice(0, 3));
killedBy: Dashboard Page renders correctly for AUDITOR role
statusReason: Unable to find an element with the text: 100. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/dashboard.tsx:34:13
       });
     } else if (user?.role === 'AUDITOR') {
       getComplianceStats().then((data) => {
-        if (data) setAuditorStats(data);
+        if (false) setAuditorStats(data);
       });
       getAuditLogs().then((logs) => {
killedBy: Dashboard Page renders correctly for AUDITOR role
statusReason: Unable to find an element with the text: 100. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] ConditionalExpression
src/pages/dashboard.tsx:34:13
       });
     } else if (user?.role === 'AUDITOR') {
       getComplianceStats().then((data) => {
-        if (data) setAuditorStats(data);
+        if (true) setAuditorStats(data);
       });
       getAuditLogs().then((logs) => {

[Killed] BlockStatement
src/pages/dashboard.tsx:36:37
       getComplianceStats().then((data) => {
         if (data) setAuditorStats(data);
       });
-      getAuditLogs().then((logs) => {
-        setRecentLogs(logs.slice(0, 3));
-      });
+      getAuditLogs().then((logs) => {});
     }
   }, [user]);
killedBy: Dashboard Page renders correctly for AUDITOR role
statusReason: Unable to find an element with the text: Data Download. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] MethodExpression
src/pages/dashboard.tsx:37:23
         if (data) setAuditorStats(data);
       });
       getAuditLogs().then((logs) => {
-        setRecentLogs(logs.slice(0, 3));
+        setRecentLogs(logs);
       });
     }

[Killed] ConditionalExpression
src/pages/dashboard.tsx:44:8
 
   const customTopbar = (
     <div className="topbar-responsive-container">
-      {user?.role === 'ADVISOR' ? (
+      {false ? (
         <button 
           onClick={() => navigate('/submissions')}
killedBy: Dashboard Page renders correctly for ADVISOR role
statusReason: Unable to find an element with the text: Ver submissões. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] EqualityOperator
src/pages/dashboard.tsx:44:8
 
   const customTopbar = (
     <div className="topbar-responsive-container">
-      {user?.role === 'ADVISOR' ? (
+      {user?.role !== 'ADVISOR' ? (
         <button 
           onClick={() => navigate('/submissions')}
killedBy: Dashboard Page renders default user and UNKNOWN role properly
statusReason: Unable to find an element with the text: Ver Trilha de Pesquisa. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ArrowFunction
src/pages/dashboard.tsx:46:20
     <div className="topbar-responsive-container">
       {user?.role === 'ADVISOR' ? (
         <button 
-          onClick={() => navigate('/submissions')}
+          onClick={() => undefined}
           style={{ 
             background: 'var(--ed-purple-main)', 
killedBy: Dashboard Page renders correctly for ADVISOR role
statusReason: expected "vi.fn()" to be called with arguments: [ '/submissions' ]

Number of calls: 0

[Survived] StringLiteral
src/pages/dashboard.tsx:48:25
         <button 
           onClick={() => navigate('/submissions')}
           style={{ 
-            background: 'var(--ed-purple-main)', 
+            background: "", 
             border: 'none', 
             padding: '10px 20px', 

[Survived] StringLiteral
src/pages/dashboard.tsx:57:18
             color: 'white',
             display: 'flex',
             alignItems: 'center',
-            gap: '8px',
+            gap: "",
             cursor: 'pointer',
             boxShadow: '0 4px 12px rgba(63, 27, 138, 0.3)'

[Survived] StringLiteral
src/pages/dashboard.tsx:59:24
             alignItems: 'center',
             gap: '8px',
             cursor: 'pointer',
-            boxShadow: '0 4px 12px rgba(63, 27, 138, 0.3)'
+            boxShadow: ""
           }}
         >

[Killed] EqualityOperator
src/pages/dashboard.tsx:64:11
         >
           <i className="bi bi-play-circle"></i> Ver submissões
         </button>
-      ) : user?.role === 'AUDITOR' ? (
+      ) : user?.role !== 'AUDITOR' ? (
         <button 
           onClick={() => navigate('/audit-logs')}
killedBy: Dashboard Page renders default user and UNKNOWN role properly
statusReason: Unable to find an element with the text: Ver Trilha de Pesquisa. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/dashboard.tsx:64:11
         >
           <i className="bi bi-play-circle"></i> Ver submissões
         </button>
-      ) : user?.role === 'AUDITOR' ? (
+      ) : false ? (
         <button 
           onClick={() => navigate('/audit-logs')}
killedBy: Dashboard Page renders correctly for AUDITOR role
statusReason: Unable to find an element with the text: Ver logs de auditoria. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ArrowFunction
src/pages/dashboard.tsx:66:20
         </button>
       ) : user?.role === 'AUDITOR' ? (
         <button 
-          onClick={() => navigate('/audit-logs')}
+          onClick={() => undefined}
           style={{ 
             background: 'var(--ed-purple-main)', 
killedBy: Dashboard Page renders correctly for AUDITOR role
statusReason: expected "vi.fn()" to be called with arguments: [ '/audit-logs' ]

Number of calls: 0

[Killed] StringLiteral
src/pages/dashboard.tsx:66:35
         </button>
       ) : user?.role === 'AUDITOR' ? (
         <button 
-          onClick={() => navigate('/audit-logs')}
+          onClick={() => navigate("")}
           style={{ 
             background: 'var(--ed-purple-main)', 
killedBy: Dashboard Page renders correctly for AUDITOR role
statusReason: expected "vi.fn()" to be called with arguments: [ '/audit-logs' ]

Received:

  1st vi.fn() call:

  [
-   "/audit-logs",

[Survived] StringLiteral
src/pages/dashboard.tsx:75:22
             fontSize: '14px',
             fontWeight: 600,
             color: 'white',
-            display: 'flex',
+            display: "",
             alignItems: 'center',
             gap: '8px',

[Survived] StringLiteral
src/pages/dashboard.tsx:78:21
             display: 'flex',
             alignItems: 'center',
             gap: '8px',
-            cursor: 'pointer',
+            cursor: "",
             boxShadow: '0 4px 12px rgba(63, 27, 138, 0.3)'
           }}

[Killed] ArrowFunction
src/pages/dashboard.tsx:86:20
         </button>
       ) : (
         <button 
-          onClick={() => navigate('/trail')}
+          onClick={() => undefined}
           style={{ 
             background: 'var(--ed-purple-main)', 
killedBy: Dashboard Page renders correctly for RESEARCHER role
statusReason: expected "vi.fn()" to be called with arguments: [ '/trail' ]

Number of calls: 0

[Killed] StringLiteral
src/pages/dashboard.tsx:86:35
         </button>
       ) : (
         <button 
-          onClick={() => navigate('/trail')}
+          onClick={() => navigate("")}
           style={{ 
             background: 'var(--ed-purple-main)', 
killedBy: Dashboard Page renders correctly for RESEARCHER role
statusReason: expected "vi.fn()" to be called with arguments: [ '/trail' ]

Received:

  1st vi.fn() call:

  [
-   "/trail",

[Survived] StringLiteral
src/pages/dashboard.tsx:89:21
           onClick={() => navigate('/trail')}
           style={{ 
             background: 'var(--ed-purple-main)', 
-            border: 'none', 
+            border: "", 
             padding: '10px 20px', 
             borderRadius: '8px',

[Survived] StringLiteral
src/pages/dashboard.tsx:91:27
             background: 'var(--ed-purple-main)', 
             border: 'none', 
             padding: '10px 20px', 
-            borderRadius: '8px',
+            borderRadius: "",
             fontSize: '14px',
             fontWeight: 600,

[Killed] StringLiteral
src/pages/dashboard.tsx:110:14
 
   return (
     <DashboardLayout
-      title={`Bom dia, ${firstName}`}
+      title={``}
       subtitle="Resumo executivo da sua atividade de pesquisa e governança"
       breadcrumbs={['EdTech', 'Visão Geral']}
killedBy: Dashboard Page renders default user and UNKNOWN role properly
statusReason: Unable to find an element with the text: Bom dia, Usuário. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] ArrayDeclaration
src/pages/dashboard.tsx:112:20
     <DashboardLayout
       title={`Bom dia, ${firstName}`}
       subtitle="Resumo executivo da sua atividade de pesquisa e governança"
-      breadcrumbs={['EdTech', 'Visão Geral']}
+      breadcrumbs={[]}
       customTopbarElement={customTopbar}
     >

[Survived] StringLiteral
src/pages/dashboard.tsx:112:21
     <DashboardLayout
       title={`Bom dia, ${firstName}`}
       subtitle="Resumo executivo da sua atividade de pesquisa e governança"
-      breadcrumbs={['EdTech', 'Visão Geral']}
+      breadcrumbs={["", 'Visão Geral']}
       customTopbarElement={customTopbar}
     >

[Killed] ConditionalExpression
src/pages/dashboard.tsx:118:10
       
       {/* 1. SEÇÃO DE CARDS INDICADORES (STATS ROW REFACTORADO) */}
       <div className="row g-3 mb-4">
-        {user?.role === 'RESEARCHER' ? (
+        {true ? (
           <>
             <div className="col-12 col-sm-6 col-xl-3">
killedBy: Dashboard Page renders default user and UNKNOWN role properly
statusReason: Unable to find an element with the text: 24. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] OptionalChaining
src/pages/dashboard.tsx:118:10
       
       {/* 1. SEÇÃO DE CARDS INDICADORES (STATS ROW REFACTORADO) */}
       <div className="row g-3 mb-4">
-        {user?.role === 'RESEARCHER' ? (
+        {user.role === 'RESEARCHER' ? (
           <>
             <div className="col-12 col-sm-6 col-xl-3">
killedBy: Dashboard Page renders default user and UNKNOWN role properly
statusReason: Cannot read properties of null (reading 'role')

[Survived] StringLiteral
src/pages/dashboard.tsx:124:84
               <div className="stat-card h-100 m-0">
                 <span className="stat-header">
                   Meus Documentos
-                  <i className="bi bi-file-earmark-text stat-icon" style={{ color: 'var(--ed-purple-light)' }}></i>
+                  <i className="bi bi-file-earmark-text stat-icon" style={{ color: "" }}></i>
                 </span>
                 <div className="stat-body">

[Killed] ConditionalExpression
src/pages/dashboard.tsx:127:49
                   <i className="bi bi-file-earmark-text stat-icon" style={{ color: 'var(--ed-purple-light)' }}></i>
                 </span>
                 <div className="stat-body">
-                  <span className="stat-value">{stats.activeDocuments || 12}</span>
+                  <span className="stat-value">{false}</span>
                 </div>
killedBy: Dashboard Page renders correctly for RESEARCHER role
statusReason: Unable to find an element with the text: 10. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/dashboard.tsx:127:49
                   <i className="bi bi-file-earmark-text stat-icon" style={{ color: 'var(--ed-purple-light)' }}></i>
                 </span>
                 <div className="stat-body">
-                  <span className="stat-value">{stats.activeDocuments || 12}</span>
+                  <span className="stat-value">{true}</span>
                 </div>
killedBy: Dashboard Page renders correctly for RESEARCHER role
statusReason: Unable to find an element with the text: 10. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] StringLiteral
src/pages/dashboard.tsx:137:72
               <div className="stat-card h-100 m-0">
                 <div className="stat-header">
                   Em Revisão
-                  <i className="bi bi-clock stat-icon" style={{ color: 'var(--ed-orange)' }}></i>
+                  <i className="bi bi-clock stat-icon" style={{ color: "" }}></i>
                 </div>
                 <div className="stat-body">

[Survived] LogicalOperator
src/pages/dashboard.tsx:140:49
                   <i className="bi bi-clock stat-icon" style={{ color: 'var(--ed-orange)' }}></i>
                 </div>
                 <div className="stat-body">
-                  <span className="stat-value">{stats.pendingReview || 2}</span>
+                  <span className="stat-value">{stats.pendingReview && 2}</span>
                 </div>

[Survived] ConditionalExpression
src/pages/dashboard.tsx:140:49
                   <i className="bi bi-clock stat-icon" style={{ color: 'var(--ed-orange)' }}></i>
                 </div>
                 <div className="stat-body">
-                  <span className="stat-value">{stats.pendingReview || 2}</span>
+                  <span className="stat-value">{true}</span>
                 </div>

[Survived] ObjectLiteral
src/pages/dashboard.tsx:150:70
               <div className="stat-card h-100 m-0">
                 <span className="stat-header">
                   Aprovados
-                  <i className="bi bi-check-circle stat-icon" style={{ color: 'var(--ed-status-success)' }}></i>
+                  <i className="bi bi-check-circle stat-icon" style={{}}></i>
                 </span>
                 <div className="stat-body">

[Survived] StringLiteral
src/pages/dashboard.tsx:150:79
               <div className="stat-card h-100 m-0">
                 <span className="stat-header">
                   Aprovados
-                  <i className="bi bi-check-circle stat-icon" style={{ color: 'var(--ed-status-success)' }}></i>
+                  <i className="bi bi-check-circle stat-icon" style={{ color: "" }}></i>
                 </span>
                 <div className="stat-body">

[Survived] ObjectLiteral
src/pages/dashboard.tsx:163:70
               <div className="stat-card h-100 m-0">
                 <span className="stat-header">
                   Seu Compliance Score
-                  <i className="bi bi-shield-check stat-icon" style={{ color: 'var(--ed-status-info)' }}></i>
+                  <i className="bi bi-shield-check stat-icon" style={{}}></i>
                 </span>
                 <div className="stat-body">

[Killed] EqualityOperator
src/pages/dashboard.tsx:172:13
               </div>
             </div>
           </>
-        ) : user?.role === 'AUDITOR' ? (
+        ) : user?.role !== 'AUDITOR' ? (
           <>
             <div className="col-12 col-sm-6 col-xl-3">
killedBy: Dashboard Page renders default user and UNKNOWN role properly
statusReason: Unable to find an element with the text: 24. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/dashboard.tsx:172:13
               </div>
             </div>
           </>
-        ) : user?.role === 'AUDITOR' ? (
+        ) : false ? (
           <>
             <div className="col-12 col-sm-6 col-xl-3">
killedBy: Dashboard Page renders correctly for AUDITOR role
statusReason: Unable to find an element with the text: 100. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] OptionalChaining
src/pages/dashboard.tsx:181:49
                   <i className="bi bi-activity stat-icon" style={{ color: 'var(--ed-purple-light)' }}></i>
                 </span>
                 <div className="stat-body">
-                  <span className="stat-value">{auditorStats?.totalEvents || 0}</span>
+                  <span className="stat-value">{auditorStats.totalEvents || 0}</span>
                 </div>
               </div>
killedBy: Dashboard Page renders correctly for AUDITOR role
statusReason: Cannot read properties of null (reading 'totalEvents')
