[Killed] ConditionalExpression
src/pages/dashboard.tsx:181:49
                   <i className="bi bi-activity stat-icon" style={{ color: 'var(--ed-purple-light)' }}></i>
                 </span>
                 <div className="stat-body">
-                  <span className="stat-value">{auditorStats?.totalEvents || 0}</span>
+                  <span className="stat-value">{false}</span>
                 </div>
               </div>
killedBy: Dashboard Page renders correctly for AUDITOR role
statusReason: Unable to find an element with the text: 100. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] OptionalChaining
src/pages/dashboard.tsx:192:49
                   <i className="bi bi-exclamation-triangle stat-icon" style={{ color: 'var(--ed-orange)' }}></i>
                 </div>
                 <div className="stat-body">
-                  <span className="stat-value">{auditorStats?.pendingItems || 0}</span>
+                  <span className="stat-value">{auditorStats.pendingItems || 0}</span>
                 </div>
killedBy: Dashboard Page renders correctly for AUDITOR role
statusReason: Cannot read properties of null (reading 'pendingItems')

[Survived] ConditionalExpression
src/pages/dashboard.tsx:192:49
                   <i className="bi bi-exclamation-triangle stat-icon" style={{ color: 'var(--ed-orange)' }}></i>
                 </div>
                 <div className="stat-body">
-                  <span className="stat-value">{auditorStats?.pendingItems || 0}</span>
+                  <span className="stat-value">{true}</span>
                 </div>

[Killed] OptionalChaining
src/pages/dashboard.tsx:204:88
                   <i className="bi bi-file-earmark-text stat-icon" style={{ color: 'var(--ed-status-info)' }}></i>
                 </span>
                 <div className="stat-body">
-                  <span className="stat-value">{auditorStats?.compliantPolicies || 0}/{auditorStats?.totalPolicies || 5}</span>
+                  <span className="stat-value">{auditorStats?.compliantPolicies || 0}/{auditorStats.totalPolicies || 5}</span>
                 </div>
               </div>
killedBy: Dashboard Page renders correctly for AUDITOR role
statusReason: Cannot read properties of null (reading 'totalPolicies')

[Killed] OptionalChaining
src/pages/dashboard.tsx:204:49
                   <i className="bi bi-file-earmark-text stat-icon" style={{ color: 'var(--ed-status-info)' }}></i>
                 </span>
                 <div className="stat-body">
-                  <span className="stat-value">{auditorStats?.compliantPolicies || 0}/{auditorStats?.totalPolicies || 5}</span>
+                  <span className="stat-value">{auditorStats.compliantPolicies || 0}/{auditorStats?.totalPolicies || 5}</span>
                 </div>
               </div>
killedBy: Dashboard Page renders correctly for AUDITOR role
statusReason: Cannot read properties of null (reading 'compliantPolicies')

[Survived] StringLiteral
src/pages/dashboard.tsx:212:79
               <div className="stat-card h-100 m-0">
                 <span className="stat-header">
                   Compliance Geral
-                  <i className="bi bi-shield-check stat-icon" style={{ color: 'var(--ed-status-success)' }}></i>
+                  <i className="bi bi-shield-check stat-icon" style={{ color: "" }}></i>
                 </span>
                 <div className="stat-body">

[Killed] OptionalChaining
src/pages/dashboard.tsx:215:49
                   <i className="bi bi-shield-check stat-icon" style={{ color: 'var(--ed-status-success)' }}></i>
                 </span>
                 <div className="stat-body">
-                  <span className="stat-value">{auditorStats?.score || 0}%</span>
+                  <span className="stat-value">{auditorStats.score || 0}%</span>
                 </div>
killedBy: Dashboard Page renders correctly for AUDITOR role
statusReason: Cannot read properties of null (reading 'score')

[Survived] LogicalOperator
src/pages/dashboard.tsx:215:49
                   <i className="bi bi-shield-check stat-icon" style={{ color: 'var(--ed-status-success)' }}></i>
                 </span>
                 <div className="stat-body">
-                  <span className="stat-value">{auditorStats?.score || 0}%</span>
+                  <span className="stat-value">{auditorStats?.score && 0}%</span>
                 </div>

[Killed] LogicalOperator
src/pages/dashboard.tsx:230:49
                   <i className="bi bi-file-earmark-text stat-icon" style={{ color: 'var(--ed-purple-light)' }}></i>
                 </span>
                 <div className="stat-body">
-                  <span className="stat-value">{stats.activeDocuments || 24}</span>
+                  <span className="stat-value">{stats.activeDocuments && 24}</span>
                 </div>
killedBy: Dashboard Page renders default user and UNKNOWN role properly
statusReason: Unable to find an element with the text: 24. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/dashboard.tsx:230:49
                   <i className="bi bi-file-earmark-text stat-icon" style={{ color: 'var(--ed-purple-light)' }}></i>
                 </span>
                 <div className="stat-body">
-                  <span className="stat-value">{stats.activeDocuments || 24}</span>
+                  <span className="stat-value">{false}</span>
                 </div>
killedBy: Dashboard Page renders default user and UNKNOWN role properly
statusReason: Unable to find an element with the text: 24. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] StringLiteral
src/pages/dashboard.tsx:240:72
               <div className="stat-card h-100 m-0">
                 <div className="stat-header">
                   Aguardando revisão
-                  <i className="bi bi-clock stat-icon" style={{ color: 'var(--ed-orange)' }}></i>
+                  <i className="bi bi-clock stat-icon" style={{ color: "" }}></i>
                 </div>
                 <div className="stat-body">

[Survived] ConditionalExpression
src/pages/dashboard.tsx:243:49
                   <i className="bi bi-clock stat-icon" style={{ color: 'var(--ed-orange)' }}></i>
                 </div>
                 <div className="stat-body">
-                  <span className="stat-value">{stats.pendingReview || 5}</span>
+                  <span className="stat-value">{false}</span>
                 </div>

[Survived] LogicalOperator
src/pages/dashboard.tsx:243:49
                   <i className="bi bi-clock stat-icon" style={{ color: 'var(--ed-orange)' }}></i>
                 </div>
                 <div className="stat-body">
-                  <span className="stat-value">{stats.pendingReview || 5}</span>
+                  <span className="stat-value">{stats.pendingReview && 5}</span>
                 </div>

[Survived] ObjectLiteral
src/pages/dashboard.tsx:253:70
               <div className="stat-card h-100 m-0">
                 <span className="stat-header">
                   Compliance Score Geral
-                  <i className="bi bi-shield-check stat-icon" style={{ color: 'var(--ed-status-success)' }}></i>
+                  <i className="bi bi-shield-check stat-icon" style={{}}></i>
                 </span>
                 <div className="stat-body">

[Survived] ConditionalExpression
src/pages/dashboard.tsx:256:49
                   <i className="bi bi-shield-check stat-icon" style={{ color: 'var(--ed-status-success)' }}></i>
                 </span>
                 <div className="stat-body">
-                  <span className="stat-value">{stats.complianceScore || 92}%</span>
+                  <span className="stat-value">{true}%</span>
                 </div>

[Survived] LogicalOperator
src/pages/dashboard.tsx:256:49
                   <i className="bi bi-shield-check stat-icon" style={{ color: 'var(--ed-status-success)' }}></i>
                 </span>
                 <div className="stat-body">
-                  <span className="stat-value">{stats.complianceScore || 92}%</span>
+                  <span className="stat-value">{stats.complianceScore && 92}%</span>
                 </div>

[Survived] StringLiteral
src/pages/dashboard.tsx:266:75
               <div className="stat-card h-100 m-0">
                 <span className="stat-header">
                   Progresso da pesquisa
-                  <i className="bi bi-graph-up stat-icon" style={{ color: 'var(--ed-status-info)' }}></i>
+                  <i className="bi bi-graph-up stat-icon" style={{ color: "" }}></i>
                 </span>
                 <div className="stat-body">

[Survived] ConditionalExpression
src/pages/dashboard.tsx:269:49
                   <i className="bi bi-graph-up stat-icon" style={{ color: 'var(--ed-status-info)' }}></i>
                 </span>
                 <div className="stat-body">
-                  <span className="stat-value">{stats.researchProgress || 68}%</span>
+                  <span className="stat-value">{true}%</span>
                 </div>

[Survived] ConditionalExpression
src/pages/dashboard.tsx:269:49
                   <i className="bi bi-graph-up stat-icon" style={{ color: 'var(--ed-status-info)' }}></i>
                 </span>
                 <div className="stat-body">
-                  <span className="stat-value">{stats.researchProgress || 68}%</span>
+                  <span className="stat-value">{false}%</span>
                 </div>

[Killed] OptionalChaining
src/pages/dashboard.tsx:279:8
       </div>
 
       {/* 2. BARRA DE ALERTA DE GOVERNANÇA (FLEXBOX RESPONSIVO) */}
-      {user?.role === 'RESEARCHER' ? (
+      {user.role === 'RESEARCHER' ? (
           <div className="alert-content">
killedBy: Dashboard Page renders default user and UNKNOWN role properly
statusReason: Cannot read properties of null (reading 'role')

[Killed] EqualityOperator
src/pages/dashboard.tsx:279:8
       </div>
 
       {/* 2. BARRA DE ALERTA DE GOVERNANÇA (FLEXBOX RESPONSIVO) */}
-      {user?.role === 'RESEARCHER' ? (
+      {user?.role !== 'RESEARCHER' ? (
           <div className="alert-content">
killedBy: Dashboard Page renders correctly for RESEARCHER role
statusReason: Unable to find an element with the text: AÇÃO REQUERIDA. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] ArrowFunction
src/pages/dashboard.tsx:292:125
               </span>
             </div>
           </div>
-          <button className="btn-alert w-100 w-md-auto" style={{ background: 'white', color: 'var(--ed-orange)' }} onClick={() => navigate('/trail')}>
+          <button className="btn-alert w-100 w-md-auto" style={{ background: 'white', color: 'var(--ed-orange)' }} onClick={() => undefined}>
             <i className="bi bi-arrow-right-short"></i> Corrigir agora
           </button>

[Survived] StringLiteral
src/pages/dashboard.tsx:292:94
               </span>
             </div>
           </div>
-          <button className="btn-alert w-100 w-md-auto" style={{ background: 'white', color: 'var(--ed-orange)' }} onClick={() => navigate('/trail')}>
+          <button className="btn-alert w-100 w-md-auto" style={{ background: 'white', color: "" }} onClick={() => navigate('/trail')}>
             <i className="bi bi-arrow-right-short"></i> Corrigir agora
           </button>

[Killed] ConditionalExpression
src/pages/dashboard.tsx:296:11
             <i className="bi bi-arrow-right-short"></i> Corrigir agora
           </button>
         </div>
-      ) : user?.role === 'AUDITOR' ? (
+      ) : false ? (
           <div className="alert-content">
killedBy: Dashboard Page renders correctly for AUDITOR role
statusReason: Unable to find an element with the text: FALHA CRÍTICA DE RETENÇÃO. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/dashboard.tsx:296:11
             <i className="bi bi-arrow-right-short"></i> Corrigir agora
           </button>
         </div>
-      ) : user?.role === 'AUDITOR' ? (
+      ) : true ? (
           <div className="alert-content">
killedBy: Dashboard Page renders correctly for ADVISOR role
statusReason: Unable to find an element with the text: ALERTA DE GOVERNANÇA GERAL. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ArrowFunction
src/pages/dashboard.tsx:309:116
               </span>
             </div>
           </div>
-          <button className="btn-alert w-100 w-md-auto" style={{ background: 'white', color: '#dc2626' }} onClick={() => navigate('/compliance-center')}>
+          <button className="btn-alert w-100 w-md-auto" style={{ background: 'white', color: '#dc2626' }} onClick={() => undefined}>
             <i className="bi bi-arrow-right-short"></i> Investigar
           </button>
killedBy: Dashboard Page renders correctly for AUDITOR role
statusReason: expected "vi.fn()" to be called with arguments: [ '/compliance-center' ]

Received:

  1st vi.fn() call:

  [
-   "/compliance-center",

[Survived] ObjectLiteral
src/pages/dashboard.tsx:309:64
               </span>
             </div>
           </div>
-          <button className="btn-alert w-100 w-md-auto" style={{ background: 'white', color: '#dc2626' }} onClick={() => navigate('/compliance-center')}>
+          <button className="btn-alert w-100 w-md-auto" style={{}} onClick={() => navigate('/compliance-center')}>
             <i className="bi bi-arrow-right-short"></i> Investigar
           </button>

[Killed] ArrowFunction
src/pages/dashboard.tsx:326:66
               </span>
             </div>
           </div>
-          <button className="btn-alert w-100 w-md-auto" onClick={() => navigate('/trail')}>
+          <button className="btn-alert w-100 w-md-auto" onClick={() => undefined}>
             <i className="bi bi-arrow-right-short"></i> Ver detalhes
           </button>
killedBy: Dashboard Page renders correctly for ADVISOR role
statusReason: expected "vi.fn()" to be called with arguments: [ '/trail' ]

Received:

  1st vi.fn() call:

  [
-   "/trail",

[Killed] ConditionalExpression
src/pages/dashboard.tsx:336:12
       <div className="row g-4">
         {/* COLUNA DA ESQUERDA (Lista de submissões/atividades) */}
         <div className="col-12 col-xl-8">
-          {user?.role === 'RESEARCHER' ? (
+          {false ? (
             <div className="dashboard-card h-100 mb-0">
               <div className="card-header-flex">
killedBy: Dashboard Page renders correctly for RESEARCHER role
statusReason: Unable to find an element with the text: Minhas Submissões Recentes. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/dashboard.tsx:336:12
       <div className="row g-4">
         {/* COLUNA DA ESQUERDA (Lista de submissões/atividades) */}
         <div className="col-12 col-xl-8">
-          {user?.role === 'RESEARCHER' ? (
+          {true ? (
             <div className="dashboard-card h-100 mb-0">
               <div className="card-header-flex">
killedBy: Dashboard Page renders correctly for ADVISOR role
statusReason: Unable to find an element with the text: Revisões Pendentes. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] ObjectLiteral
src/pages/dashboard.tsx:340:59
             <div className="dashboard-card h-100 mb-0">
               <div className="card-header-flex">
                 <h3 className="card-title">Minhas Submissões Recentes</h3>
-                <span className="card-action-link" style={{ color: 'var(--ed-purple-light)', cursor: 'pointer', fontSize: '13px', fontWeight: 500 }}>Ver histórico</span>
+                <span className="card-action-link" style={{}}>Ver histórico</span>
               </div>
               <div className="doc-list">

[Survived] StringLiteral
src/pages/dashboard.tsx:340:68
             <div className="dashboard-card h-100 mb-0">
               <div className="card-header-flex">
                 <h3 className="card-title">Minhas Submissões Recentes</h3>
-                <span className="card-action-link" style={{ color: 'var(--ed-purple-light)', cursor: 'pointer', fontSize: '13px', fontWeight: 500 }}>Ver histórico</span>
+                <span className="card-action-link" style={{ color: "", cursor: 'pointer', fontSize: '13px', fontWeight: 500 }}>Ver histórico</span>
               </div>
               <div className="doc-list">

[Killed] ConditionalExpression
src/pages/dashboard.tsx:343:18
                 <span className="card-action-link" style={{ color: 'var(--ed-purple-light)', cursor: 'pointer', fontSize: '13px', fontWeight: 500 }}>Ver histórico</span>
               </div>
               <div className="doc-list">
-                {recentDocs.length > 0 ? recentDocs.map((doc: any, i) => (
+                {false ? recentDocs.map((doc: any, i) => (
                     <div className="doc-info" style={{ display: 'flex', gap: '16px', alignItems: 'center' }}>
killedBy: Dashboard Page renders correctly for RESEARCHER role
statusReason: Unable to find an element with the text: doc1.pdf. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] EqualityOperator
src/pages/dashboard.tsx:343:18
                 <span className="card-action-link" style={{ color: 'var(--ed-purple-light)', cursor: 'pointer', fontSize: '13px', fontWeight: 500 }}>Ver histórico</span>
               </div>
               <div className="doc-list">
-                {recentDocs.length > 0 ? recentDocs.map((doc: any, i) => (
+                {recentDocs.length >= 0 ? recentDocs.map((doc: any, i) => (
                     <div className="doc-info" style={{ display: 'flex', gap: '16px', alignItems: 'center' }}>
killedBy: Dashboard Page handles empty documents for RESEARCHER
statusReason: Unable to find an element with the text: Nenhum documento. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] StringLiteral
src/pages/dashboard.tsx:345:65
               <div className="doc-list">
                 {recentDocs.length > 0 ? recentDocs.map((doc: any, i) => (
-                    <div className="doc-info" style={{ display: 'flex', gap: '16px', alignItems: 'center' }}>
+                    <div className="doc-info" style={{ display: "", gap: '16px', alignItems: 'center' }}>
                         <i className={doc.title.endsWith('.pdf') ? 'bi bi-file-earmark-pdf' : 'bi bi-file-earmark-text'}></i>

[Survived] MethodExpression
src/pages/dashboard.tsx:347:39
                     <div className="doc-info" style={{ display: 'flex', gap: '16px', alignItems: 'center' }}>
-                        <i className={doc.title.endsWith('.pdf') ? 'bi bi-file-earmark-pdf' : 'bi bi-file-earmark-text'}></i>
+                        <i className={doc.title.startsWith('.pdf') ? 'bi bi-file-earmark-pdf' : 'bi bi-file-earmark-text'}></i>
                       </div>
                       <div style={{ display: 'flex', flexDirection: 'column' }}>

[Survived] StringLiteral
src/pages/dashboard.tsx:347:58
                     <div className="doc-info" style={{ display: 'flex', gap: '16px', alignItems: 'center' }}>
-                        <i className={doc.title.endsWith('.pdf') ? 'bi bi-file-earmark-pdf' : 'bi bi-file-earmark-text'}></i>
+                        <i className={doc.title.endsWith("") ? 'bi bi-file-earmark-pdf' : 'bi bi-file-earmark-text'}></i>
                       </div>
                       <div style={{ display: 'flex', flexDirection: 'column' }}>

[Survived] ObjectLiteral
src/pages/dashboard.tsx:349:35
                         <i className={doc.title.endsWith('.pdf') ? 'bi bi-file-earmark-pdf' : 'bi bi-file-earmark-text'}></i>
                       </div>
-                      <div style={{ display: 'flex', flexDirection: 'column' }}>
+                      <div style={{}}>
                         <span className="doc-name" style={{ fontWeight: 600, color: 'var(--ed-text-dark)', fontSize: '14px' }}>
                           {doc.title}

[Survived] StringLiteral
src/pages/dashboard.tsx:350:118
                         <i className={doc.title.endsWith('.pdf') ? 'bi bi-file-earmark-pdf' : 'bi bi-file-earmark-text'}></i>
                       </div>
                       <div style={{ display: 'flex', flexDirection: 'column' }}>
-                        <span className="doc-name" style={{ fontWeight: 600, color: 'var(--ed-text-dark)', fontSize: '14px' }}>
+                        <span className="doc-name" style={{ fontWeight: 600, color: 'var(--ed-text-dark)', fontSize: "" }}>
                           {doc.title}
                         </span>

[Survived] StringLiteral
src/pages/dashboard.tsx:350:85
                         <i className={doc.title.endsWith('.pdf') ? 'bi bi-file-earmark-pdf' : 'bi bi-file-earmark-text'}></i>
                       </div>
                       <div style={{ display: 'flex', flexDirection: 'column' }}>
-                        <span className="doc-name" style={{ fontWeight: 600, color: 'var(--ed-text-dark)', fontSize: '14px' }}>
+                        <span className="doc-name" style={{ fontWeight: 600, color: "", fontSize: '14px' }}>
                           {doc.title}
                         </span>

[Survived] StringLiteral
src/pages/dashboard.tsx:357:125
                       </div>
                     </div>
                     <div className="d-flex align-items-center justify-content-between w-100 w-sm-auto gap-3">
-                      <span style={{ fontSize: '12px', color: 'var(--ed-text-muted)', background: 'var(--border)', padding: '4px 10px', borderRadius: '12px', fontWeight: 600 }}>
+                      <span style={{ fontSize: '12px', color: 'var(--ed-text-muted)', background: 'var(--border)', padding: "", borderRadius: '12px', fontWeight: 600 }}>
                         {doc.status}
                       </span>

[Killed] OptionalChaining
src/pages/dashboard.tsx:370:15
                 )}
               </div>
             </div>
-          ) : user?.role === 'AUDITOR' ? (
+          ) : user.role === 'AUDITOR' ? (
             <div className="dashboard-card h-100 mb-0">
               <div className="card-header-flex">
killedBy: Dashboard Page renders default user and UNKNOWN role properly
statusReason: Cannot read properties of null (reading 'role')

[Killed] EqualityOperator
src/pages/dashboard.tsx:377:18
               </div>
               <div className="doc-list">
-                {recentLogs.length > 0 ? recentLogs.map((log: any, i) => (
+                {recentLogs.length <= 0 ? recentLogs.map((log: any, i) => (
                     <div className="doc-info" style={{ display: 'flex', gap: '16px', alignItems: 'center' }}>
killedBy: Dashboard Page renders correctly for AUDITOR role
statusReason: Unable to find an element with the text: Data Download. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/dashboard.tsx:377:18
               </div>
               <div className="doc-list">
-                {recentLogs.length > 0 ? recentLogs.map((log: any, i) => (
+                {true ? recentLogs.map((log: any, i) => (
                     <div className="doc-info" style={{ display: 'flex', gap: '16px', alignItems: 'center' }}>
killedBy: Dashboard Page handles empty logs for AUDITOR
statusReason: Unable to find an element with the text: Nenhum log crítico. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] StringLiteral
src/pages/dashboard.tsx:379:98
               <div className="doc-list">
                 {recentLogs.length > 0 ? recentLogs.map((log: any, i) => (
-                    <div className="doc-info" style={{ display: 'flex', gap: '16px', alignItems: 'center' }}>
+                    <div className="doc-info" style={{ display: 'flex', gap: '16px', alignItems: "" }}>
                         <i className="bi bi-shield-exclamation"></i>

[Survived] StringLiteral
src/pages/dashboard.tsx:383:46
                         <i className="bi bi-shield-exclamation"></i>
                       </div>
-                      <div style={{ display: 'flex', flexDirection: 'column' }}>
+                      <div style={{ display: "", flexDirection: 'column' }}>
                         <span className="doc-name" style={{ fontWeight: 600, color: 'var(--ed-text-dark)', fontSize: '14px' }}>
                           {log.action}

[Survived] MethodExpression
src/pages/dashboard.tsx:387:92
                         <span className="doc-name" style={{ fontWeight: 600, color: 'var(--ed-text-dark)', fontSize: '14px' }}>
                           {log.action}
                         </span>
-                        <span style={{ fontSize: '12px', color: 'var(--ed-text-muted)' }}>{log.details.substring(0, 30)}...</span>
+                        <span style={{ fontSize: '12px', color: 'var(--ed-text-muted)' }}>{log.details}...</span>
                       </div>
                     </div>

[Survived] ObjectLiteral
src/pages/dashboard.tsx:391:36
                       </div>
                     </div>
                     <div className="d-flex align-items-center justify-content-between w-100 w-sm-auto gap-3">
-                      <span style={{ fontSize: '12px', color: 'var(--ed-text-muted)' }}>{log.userName}</span>
+                      <span style={{}}>{log.userName}</span>
                     </div>
                   </div>

[Survived] StringLiteral
src/pages/dashboard.tsx:391:48
                       </div>
                     </div>
                     <div className="d-flex align-items-center justify-content-between w-100 w-sm-auto gap-3">
-                      <span style={{ fontSize: '12px', color: 'var(--ed-text-muted)' }}>{log.userName}</span>
+                      <span style={{ fontSize: "", color: 'var(--ed-text-muted)' }}>{log.userName}</span>
                     </div>
                   </div>

[Survived] StringLiteral
src/pages/dashboard.tsx:395:78
                     </div>
                   </div>
                 )) : (
-                  <div style={{ padding: '2rem', textAlign: 'center', color: '#64748B' }}>Nenhum log crítico</div>
+                  <div style={{ padding: '2rem', textAlign: 'center', color: "" }}>Nenhum log crítico</div>
                 )}
               </div>

[Survived] ObjectLiteral
src/pages/dashboard.tsx:395:31
                     </div>
                   </div>
                 )) : (
-                  <div style={{ padding: '2rem', textAlign: 'center', color: '#64748B' }}>Nenhum log crítico</div>
+                  <div style={{}}>Nenhum log crítico</div>
                 )}
               </div>

[Survived] StringLiteral
src/pages/dashboard.tsx:403:123
             <div className="dashboard-card h-100 mb-0">
               <div className="card-header-flex">
                 <h3 className="card-title">Revisões Pendentes</h3>
-                <span className="card-action-link" style={{ color: 'var(--ed-purple-light)', cursor: 'pointer', fontSize: '13px', fontWeight: 500 }}>Ver todas</span>
+                <span className="card-action-link" style={{ color: 'var(--ed-purple-light)', cursor: 'pointer', fontSize: "", fontWeight: 500 }}>Ver todas</span>
               </div>
               <div className="doc-list">
