[Survived] ObjectLiteral
src/pages/dashboard.tsx:413:59
                         <i className="bi bi-file-earmark-pdf"></i>
                       </div>
                       <div style={{ display: 'flex', flexDirection: 'column' }}>
-                        <span className="doc-name" style={{ fontWeight: 600, color: 'var(--ed-text-dark)', fontSize: '14px' }}>
+                        <span className="doc-name" style={{}}>
                           {doc.title}
                         </span>

[Survived] OptionalChaining
src/pages/dashboard.tsx:416:92
                         <span className="doc-name" style={{ fontWeight: 600, color: 'var(--ed-text-dark)', fontSize: '14px' }}>
                           {doc.title}
                         </span>
-                        <span style={{ fontSize: '12px', color: 'var(--ed-text-muted)' }}>{doc.author?.name} - {new Date(doc.createdAt).toLocaleDateString()}</span>
+                        <span style={{ fontSize: '12px', color: 'var(--ed-text-muted)' }}>{doc.author.name} - {new Date(doc.createdAt).toLocaleDateString()}</span>
                       </div>
                     </div>

[Survived] ObjectLiteral
src/pages/dashboard.tsx:416:38
                         <span className="doc-name" style={{ fontWeight: 600, color: 'var(--ed-text-dark)', fontSize: '14px' }}>
                           {doc.title}
                         </span>
-                        <span style={{ fontSize: '12px', color: 'var(--ed-text-muted)' }}>{doc.author?.name} - {new Date(doc.createdAt).toLocaleDateString()}</span>
+                        <span style={{}}>{doc.author?.name} - {new Date(doc.createdAt).toLocaleDateString()}</span>
                       </div>
                     </div>

[Survived] StringLiteral
src/pages/dashboard.tsx:420:131
                       </div>
                     </div>
                     <div className="d-flex align-items-center justify-content-between w-100 w-sm-auto gap-3">
-                      <span style={{ fontSize: '12px', color: 'var(--ed-orange)', background: 'rgba(245, 158, 11, 0.1)', padding: '4px 10px', borderRadius: '12px', fontWeight: 600 }}>
+                      <span style={{ fontSize: '12px', color: 'var(--ed-orange)', background: 'rgba(245, 158, 11, 0.1)', padding: "", borderRadius: '12px', fontWeight: 600 }}>
                         <i className="bi bi-clock"></i> Pendente
                       </span>

[Survived] StringLiteral
src/pages/dashboard.tsx:429:78
                     </div>
                   </div>
                 )) : (
-                  <div style={{ padding: '2rem', textAlign: 'center', color: '#64748B' }}>Nenhuma submissão pendente.</div>
+                  <div style={{ padding: '2rem', textAlign: 'center', color: "" }}>Nenhuma submissão pendente.</div>
                 )}
               </div>

[Killed] ConditionalExpression
src/pages/dashboard.tsx:438:12
 
         {/* COLUNA DA DIREITA (Compliance e Gráficos de Progresso) */}
         <div className="col-12 col-xl-4 d-flex flex-column gap-4">
-          {user?.role === 'RESEARCHER' ? (
+          {false ? (
             <>
               {/* Compliance Score (Personal) */}
killedBy: Dashboard Page renders correctly for RESEARCHER role
statusReason: Unable to find an element with the text: Meu Perfil de Conformidade. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] OptionalChaining
src/pages/dashboard.tsx:438:12
 
         {/* COLUNA DA DIREITA (Compliance e Gráficos de Progresso) */}
         <div className="col-12 col-xl-4 d-flex flex-column gap-4">
-          {user?.role === 'RESEARCHER' ? (
+          {user.role === 'RESEARCHER' ? (
             <>
               {/* Compliance Score (Personal) */}
killedBy: Dashboard Page renders default user and UNKNOWN role properly
statusReason: Cannot read properties of null (reading 'role')

[Survived] ObjectLiteral
src/pages/dashboard.tsx:472:58
 
               {/* Research Progress (Personal) */}
               <div className="dashboard-card mb-0">
-                <div className="card-header-flex" style={{ paddingBottom: '10px', border: 'none' }}>
+                <div className="card-header-flex" style={{}}>
                   <div className="card-title">Progresso da Tese / Artigo</div>
                 </div>

[Survived] StringLiteral
src/pages/dashboard.tsx:472:75
 
               {/* Research Progress (Personal) */}
               <div className="dashboard-card mb-0">
-                <div className="card-header-flex" style={{ paddingBottom: '10px', border: 'none' }}>
+                <div className="card-header-flex" style={{ paddingBottom: "", border: 'none' }}>
                   <div className="card-title">Progresso da Tese / Artigo</div>
                 </div>

[Survived] StringLiteral
src/pages/dashboard.tsx:482:86
                       <span>100%</span>
                     </div>
                     <div className="progress-bar-bg">
-                      <div className="progress-bar-fill fill-purple" style={{ width: '100%' }}></div>
+                      <div className="progress-bar-fill fill-purple" style={{ width: "" }}></div>
                     </div>
                   </div>

[Killed] OptionalChaining
src/pages/dashboard.tsx:508:15
                 </div>
               </div>
             </>
-          ) : user?.role === 'AUDITOR' ? (
+          ) : user.role === 'AUDITOR' ? (
             <>
               {/* Compliance Overview */}
killedBy: Dashboard Page renders default user and UNKNOWN role properly
statusReason: Cannot read properties of null (reading 'role')

[Survived] StringLiteral
src/pages/dashboard.tsx:522:106
                       <span>100%</span>
                     </div>
                     <div className="progress-bar-bg">
-                      <div className="progress-bar-fill fill-purple" style={{ width: '100%', background: '#4CAF50' }}></div>
+                      <div className="progress-bar-fill fill-purple" style={{ width: '100%', background: "" }}></div>
                     </div>
                   </div>

[Survived] StringLiteral
src/pages/dashboard.tsx:540:83
                       <span>58%</span>
                     </div>
                     <div className="progress-bar-bg">
-                      <div className="progress-bar-fill fill-red" style={{ width: '58%', background: '#F44336' }}></div>
+                      <div className="progress-bar-fill fill-red" style={{ width: "", background: '#F44336' }}></div>
                     </div>
                   </div>

[Survived] StringLiteral
src/pages/dashboard.tsx:550:91
             <>
               {/* Compliance Score (General) */}
               <div className="dashboard-card mb-0">
-                <div className="card-header-flex" style={{ paddingBottom: '10px', border: 'none' }}>
+                <div className="card-header-flex" style={{ paddingBottom: '10px', border: "" }}>
                   <div>
                     <div className="card-title">Pontuação de Conformidade (Laboratório)</div>

[Survived] StringLiteral
src/pages/dashboard.tsx:590:86
                       <span>82%</span>
                     </div>
                     <div className="progress-bar-bg">
-                      <div className="progress-bar-fill fill-purple" style={{ width: '82%' }}></div>
+                      <div className="progress-bar-fill fill-purple" style={{ width: "" }}></div>
                     </div>
                   </div>

[Survived] ObjectLiteral
src/pages/dashboard.tsx:590:77
                       <span>82%</span>
                     </div>
                     <div className="progress-bar-bg">
-                      <div className="progress-bar-fill fill-purple" style={{ width: '82%' }}></div>
+                      <div className="progress-bar-fill fill-purple" style={{}}></div>
                     </div>
                   </div>
