[Killed] BooleanLiteral
src/pages/documentos.tsx:18:62
   const [filterStatus, setFilterStatus] = useState('');
 
   // Modal State
-  const [isUploadModalOpen, setIsUploadModalOpen] = useState(false);
+  const [isUploadModalOpen, setIsUploadModalOpen] = useState(true);
   const [previewDoc, setPreviewDoc] = useState<Document | null>(null);
   const [previewUrl, setPreviewUrl] = useState<string>('');
statusReason: Found multiple elements with the role "button" and name ""

Here are the matching elements:

Ignored nodes: comments, script, style
<button
  class="btn-icon-action"
  style="color: rgb(203, 213, 225); padding: 0px;"

[Survived] BooleanLiteral
src/pages/documentos.tsx:21:60
   const [isUploadModalOpen, setIsUploadModalOpen] = useState(false);
   const [previewDoc, setPreviewDoc] = useState<Document | null>(null);
   const [previewUrl, setPreviewUrl] = useState<string>('');
-  const [isPreviewLoading, setIsPreviewLoading] = useState(false);
+  const [isPreviewLoading, setIsPreviewLoading] = useState(true);
   const [isDragging, setIsDragging] = useState(false);
   const [uploadFile, setUploadFile] = useState<File | null>(null);

[Survived] BooleanLiteral
src/pages/documentos.tsx:22:48
   const [previewDoc, setPreviewDoc] = useState<Document | null>(null);
   const [previewUrl, setPreviewUrl] = useState<string>('');
   const [isPreviewLoading, setIsPreviewLoading] = useState(false);
-  const [isDragging, setIsDragging] = useState(false);
+  const [isDragging, setIsDragging] = useState(true);
   const [uploadFile, setUploadFile] = useState<File | null>(null);
   const [toastMessage, setToastMessage] = useState('');

[Survived] StringLiteral
src/pages/documentos.tsx:24:52
   const [isPreviewLoading, setIsPreviewLoading] = useState(false);
   const [isDragging, setIsDragging] = useState(false);
   const [uploadFile, setUploadFile] = useState<File | null>(null);
-  const [toastMessage, setToastMessage] = useState('');
+  const [toastMessage, setToastMessage] = useState("Stryker was here!");
 
   // React Query Hooks

[NoCoverage] ArrayDeclaration
src/pages/documentos.tsx:27:29
   const [toastMessage, setToastMessage] = useState('');
 
   // React Query Hooks
-  const { data: documents = [], isLoading: loadingDocs } = useDocuments('', filterTitle);
+  const { data: documents = ["Stryker was here"], isLoading: loadingDocs } = useDocuments('', filterTitle);
   const { mutateAsync: getUrl } = useDownloadUrl();
   const { mutateAsync: _uploadDoc } = useUploadDocument();

[Survived] StringLiteral
src/pages/documentos.tsx:27:73
   const [toastMessage, setToastMessage] = useState('');
 
   // React Query Hooks
-  const { data: documents = [], isLoading: loadingDocs } = useDocuments('', filterTitle);
+  const { data: documents = [], isLoading: loadingDocs } = useDocuments("Stryker was here!", filterTitle);
   const { mutateAsync: getUrl } = useDownloadUrl();
   const { mutateAsync: _uploadDoc } = useUploadDocument();

[Killed] BlockStatement
src/pages/documentos.tsx:32:42
   const { mutateAsync: _uploadDoc } = useUploadDocument();
   const { mutateAsync: toggleStar } = useToggleStar();
 
-  const showToast = (message: string) => {
-    setToastMessage(message);
-    setTimeout(() => setToastMessage(''), 3000);
-  };
+  const showToast = (message: string) => {};
 
   const handleDownload = async (docId: string) => {
statusReason: Unable to find an element with the text: Carregando opções para: Doc 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ArrowFunction
src/pages/documentos.tsx:34:16
 
   const showToast = (message: string) => {
     setToastMessage(message);
-    setTimeout(() => setToastMessage(''), 3000);
+    setTimeout(() => undefined, 3000);
   };
 
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <span>
  Carregando opções para: Doc 1
</span> instead

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
src/pages/documentos.tsx:37:51
     setTimeout(() => setToastMessage(''), 3000);
   };
 
-  const handleDownload = async (docId: string) => {
-    showToast('Iniciando download seguro...');
-
-    try {
-      const url = await getUrl(docId);
-      if (url) {
-        window.open(url, '_blank', 'noopener,noreferrer');
-        showToast('Download finalizado com sucesso!');
-      }
-    } catch (error: any) {
-      showToast('Aviso: Falha ao baixar documento. ' + (error.message || 'Erro ao obter link.'));
-    }
-  };
+  const handleDownload = async (docId: string) => {};
 
   const handleView = async (doc: Document) => {
statusReason: Unable to find an element with the text: Iniciando download seguro.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] StringLiteral
src/pages/documentos.tsx:38:15
   };
 
   const handleDownload = async (docId: string) => {
-    showToast('Iniciando download seguro...');
+    showToast("");
 
     try {
statusReason: Unable to find an element with the text: Iniciando download seguro.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/documentos.tsx:40:9
   const handleDownload = async (docId: string) => {
     showToast('Iniciando download seguro...');
 
-    try {
-      const url = await getUrl(docId);
-      if (url) {
-        window.open(url, '_blank', 'noopener,noreferrer');
-        showToast('Download finalizado com sucesso!');
-      }
-    } catch (error: any) {
+    try {} catch (error: any) {
       showToast('Aviso: Falha ao baixar documento. ' + (error.message || 'Erro ao obter link.'));
     }
statusReason: expected "vi.fn()" to be called with arguments: [ 'http://example.com/file.pdf', …(2) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
src/pages/documentos.tsx:42:11
 
     try {
       const url = await getUrl(docId);
-      if (url) {
+      if (false) {
         window.open(url, '_blank', 'noopener,noreferrer');
         showToast('Download finalizado com sucesso!');
statusReason: expected "vi.fn()" to be called with arguments: [ 'http://example.com/file.pdf', …(2) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
src/pages/documentos.tsx:42:16
 
     try {
       const url = await getUrl(docId);
-      if (url) {
-        window.open(url, '_blank', 'noopener,noreferrer');
-        showToast('Download finalizado com sucesso!');
-      }
+      if (url) {}
     } catch (error: any) {
       showToast('Aviso: Falha ao baixar documento. ' + (error.message || 'Erro ao obter link.'));
statusReason: expected "vi.fn()" to be called with arguments: [ 'http://example.com/file.pdf', …(2) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
src/pages/documentos.tsx:43:26
     try {
       const url = await getUrl(docId);
       if (url) {
-        window.open(url, '_blank', 'noopener,noreferrer');
+        window.open(url, "", 'noopener,noreferrer');
         showToast('Download finalizado com sucesso!');
       }
statusReason: expected "vi.fn()" to be called with arguments: [ 'http://example.com/file.pdf', …(2) ]

Received:

  1st vi.fn() call:

  [
    "http://example.com/file.pdf",

[Killed] BlockStatement
src/pages/documentos.tsx:46:26
         window.open(url, '_blank', 'noopener,noreferrer');
         showToast('Download finalizado com sucesso!');
       }
-    } catch (error: any) {
-      showToast('Aviso: Falha ao baixar documento. ' + (error.message || 'Erro ao obter link.'));
-    }
+    } catch (error: any) {}
   };
 
statusReason: Unable to find an element with the text: Aviso: Falha ao baixar documento. Download failed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] LogicalOperator
src/pages/documentos.tsx:47:57
         showToast('Download finalizado com sucesso!');
       }
     } catch (error: any) {
-      showToast('Aviso: Falha ao baixar documento. ' + (error.message || 'Erro ao obter link.'));
+      showToast('Aviso: Falha ao baixar documento. ' + (error.message && 'Erro ao obter link.'));
     }
   };
statusReason: Unable to find an element with the text: Aviso: Falha ao baixar documento. Download failed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/documentos.tsx:47:57
         showToast('Download finalizado com sucesso!');
       }
     } catch (error: any) {
-      showToast('Aviso: Falha ao baixar documento. ' + (error.message || 'Erro ao obter link.'));
+      showToast('Aviso: Falha ao baixar documento. ' + (false));
     }
   };
statusReason: Unable to find an element with the text: Aviso: Falha ao baixar documento. Download failed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/documentos.tsx:51:47
     }
   };
 
-  const handleView = async (doc: Document) => {
-    setPreviewDoc(doc);
-    setIsPreviewLoading(true);
-    setPreviewUrl('');
-    
-    try {
-      const url = await getUrl(doc.id);
-      if (url) {
-        setPreviewUrl(url);
-      }
-    } catch {
-      showToast('Erro ao carregar preview do documento');
-    } finally {
-      setIsPreviewLoading(false);
-    }
-  };
+  const handleView = async (doc: Document) => {};
 
   const closePreviewModal = () => {
statusReason: Unable to find an element with the text: Seu navegador não suporta a visualização nativa de PDFs.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] BooleanLiteral
src/pages/documentos.tsx:53:25
 
   const handleView = async (doc: Document) => {
     setPreviewDoc(doc);
-    setIsPreviewLoading(true);
+    setIsPreviewLoading(false);
     setPreviewUrl('');
     

[Killed] BlockStatement
src/pages/documentos.tsx:56:9
     setIsPreviewLoading(true);
     setPreviewUrl('');
     
-    try {
-      const url = await getUrl(doc.id);
-      if (url) {
-        setPreviewUrl(url);
-      }
-    } catch {
+    try {} catch {
       showToast('Erro ao carregar preview do documento');
     } finally {
statusReason: Unable to find an element with the text: Seu navegador não suporta a visualização nativa de PDFs.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/documentos.tsx:58:16
     
     try {
       const url = await getUrl(doc.id);
-      if (url) {
-        setPreviewUrl(url);
-      }
+      if (url) {}
     } catch {
       showToast('Erro ao carregar preview do documento');
statusReason: Unable to find an element with the text: Seu navegador não suporta a visualização nativa de PDFs.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/documentos.tsx:58:11
     
     try {
       const url = await getUrl(doc.id);
-      if (url) {
+      if (false) {
         setPreviewUrl(url);
       }
statusReason: Unable to find an element with the text: Seu navegador não suporta a visualização nativa de PDFs.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/documentos.tsx:61:13
       if (url) {
         setPreviewUrl(url);
       }
-    } catch {
-      showToast('Erro ao carregar preview do documento');
-    } finally {
+    } catch {} finally {
       setIsPreviewLoading(false);
     }
statusReason: Unable to find an element with the text: Erro ao carregar preview do documento. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/documentos.tsx:63:15
       }
     } catch {
       showToast('Erro ao carregar preview do documento');
-    } finally {
-      setIsPreviewLoading(false);
-    }
+    } finally {}
   };
 
statusReason: Unable to find an element with the text: Seu navegador não suporta a visualização nativa de PDFs.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BooleanLiteral
src/pages/documentos.tsx:64:27
     } catch {
       showToast('Erro ao carregar preview do documento');
     } finally {
-      setIsPreviewLoading(false);
+      setIsPreviewLoading(true);
     }
   };
statusReason: Unable to find an element with the text: Seu navegador não suporta a visualização nativa de PDFs.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] BlockStatement
src/pages/documentos.tsx:68:35
     }
   };
 
-  const closePreviewModal = () => {
-    setPreviewDoc(null);
-  };
+  const closePreviewModal = () => {};
 
   const handleOptions = (docName: string) => {

[Killed] BlockStatement
src/pages/documentos.tsx:72:46
     setPreviewDoc(null);
   };
 
-  const handleOptions = (docName: string) => {
-    showToast(`Carregando opções para: ${docName}`);
-  };
+  const handleOptions = (docName: string) => {};
 
   const handleToggleStar = async (docId: string) => {
statusReason: Unable to find an element with the text: Carregando opções para: Doc 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] StringLiteral
src/pages/documentos.tsx:73:15
   };
 
   const handleOptions = (docName: string) => {
-    showToast(`Carregando opções para: ${docName}`);
+    showToast(``);
   };
 
statusReason: Unable to find an element with the text: Carregando opções para: Doc 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/documentos.tsx:76:53
     showToast(`Carregando opções para: ${docName}`);
   };
 
-  const handleToggleStar = async (docId: string) => {
-    try {
-      await toggleStar(docId);
-      showToast('Favorito atualizado!');
-    } catch {
-      showToast('Erro ao atualizar favorito.');
-    }
-  };
+  const handleToggleStar = async (docId: string) => {};
 
   // Modal Handlers
statusReason: Unable to find an element with the text: Favorito atualizado!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/documentos.tsx:77:9
   };
 
   const handleToggleStar = async (docId: string) => {
-    try {
-      await toggleStar(docId);
-      showToast('Favorito atualizado!');
-    } catch {
+    try {} catch {
       showToast('Erro ao atualizar favorito.');
     }
statusReason: Unable to find an element with the text: Favorito atualizado!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/documentos.tsx:80:13
     try {
       await toggleStar(docId);
       showToast('Favorito atualizado!');
-    } catch {
-      showToast('Erro ao atualizar favorito.');
-    }
+    } catch {}
   };
 
statusReason: Unable to find an element with the text: Erro ao atualizar favorito.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ArrowFunction
src/pages/documentos.tsx:86:27
   };
 
   // Modal Handlers
-  const openUploadModal = () => setIsUploadModalOpen(true);
+  const openUploadModal = () => undefined;
 
   const closeUploadModal = () => {
statusReason: Unable to find an element with the text: Novo Upload. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BooleanLiteral
src/pages/documentos.tsx:86:54
   };
 
   // Modal Handlers
-  const openUploadModal = () => setIsUploadModalOpen(true);
+  const openUploadModal = () => setIsUploadModalOpen(false);
 
   const closeUploadModal = () => {
statusReason: Unable to find an element with the text: Novo Upload. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/documentos.tsx:88:34
   // Modal Handlers
   const openUploadModal = () => setIsUploadModalOpen(true);
 
-  const closeUploadModal = () => {
-    setIsUploadModalOpen(false);
-    setUploadFile(null);
-    setIsDragging(false);
-  };
+  const closeUploadModal = () => {};
 
   const handleDragOver = (e: React.DragEvent) => {
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h3
  class="modal-title"
>
  Novo Upload
</h3> instead

[Killed] BooleanLiteral
src/pages/documentos.tsx:89:26
   const openUploadModal = () => setIsUploadModalOpen(true);
 
   const closeUploadModal = () => {
-    setIsUploadModalOpen(false);
+    setIsUploadModalOpen(true);
     setUploadFile(null);
     setIsDragging(false);
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h3
  class="modal-title"
>
  Novo Upload
</h3> instead

[Survived] BooleanLiteral
src/pages/documentos.tsx:91:19
   const closeUploadModal = () => {
     setIsUploadModalOpen(false);
     setUploadFile(null);
-    setIsDragging(false);
+    setIsDragging(true);
   };
 

[Killed] BlockStatement
src/pages/documentos.tsx:94:50
     setIsDragging(false);
   };
 
-  const handleDragOver = (e: React.DragEvent) => {
-    e.preventDefault();
-    setIsDragging(true);
-  };
+  const handleDragOver = (e: React.DragEvent) => {};
 
   const handleDragLeave = (e: React.DragEvent) => {
statusReason: expect(element).toHaveClass("dragging")

Expected the element to have class:
  dragging
Received:
  upload-area

[Killed] BooleanLiteral
src/pages/documentos.tsx:96:19
 
   const handleDragOver = (e: React.DragEvent) => {
     e.preventDefault();
-    setIsDragging(true);
+    setIsDragging(false);
   };
 
statusReason: expect(element).toHaveClass("dragging")

Expected the element to have class:
  dragging
Received:
  upload-area

[Killed] BlockStatement
src/pages/documentos.tsx:99:51
     setIsDragging(true);
   };
 
-  const handleDragLeave = (e: React.DragEvent) => {
-    e.preventDefault();
-    setIsDragging(false);
-  };
+  const handleDragLeave = (e: React.DragEvent) => {};
 
   const handleDrop = (e: React.DragEvent) => {
statusReason: expect(element).not.toHaveClass("dragging")

Expected the element not to have class:
  dragging
Received:
  upload-area dragging

[Killed] BooleanLiteral
src/pages/documentos.tsx:101:19
 
   const handleDragLeave = (e: React.DragEvent) => {
     e.preventDefault();
-    setIsDragging(false);
+    setIsDragging(true);
   };
 
statusReason: expect(element).not.toHaveClass("dragging")

Expected the element not to have class:
  dragging
Received:
  upload-area dragging

[Killed] BlockStatement
src/pages/documentos.tsx:104:46
     setIsDragging(false);
   };
 
-  const handleDrop = (e: React.DragEvent) => {
-    e.preventDefault();
-    setIsDragging(false);
-    if (e.dataTransfer.files && e.dataTransfer.files[0]) {
-      setUploadFile(e.dataTransfer.files[0]);
-    }
-  };
+  const handleDrop = (e: React.DragEvent) => {};
 
   const handleFileInput = (e: React.ChangeEvent<HTMLInputElement>) => {
statusReason: Unable to find an element with the text: test.pdf. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/documentos.tsx:107:9
   const handleDrop = (e: React.DragEvent) => {
     e.preventDefault();
     setIsDragging(false);
-    if (e.dataTransfer.files && e.dataTransfer.files[0]) {
+    if (false) {
       setUploadFile(e.dataTransfer.files[0]);
     }
statusReason: Unable to find an element with the text: test.pdf. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/documentos.tsx:107:58
   const handleDrop = (e: React.DragEvent) => {
     e.preventDefault();
     setIsDragging(false);
-    if (e.dataTransfer.files && e.dataTransfer.files[0]) {
-      setUploadFile(e.dataTransfer.files[0]);
-    }
+    if (e.dataTransfer.files && e.dataTransfer.files[0]) {}
   };
 
statusReason: Unable to find an element with the text: test.pdf. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/documentos.tsx:112:71
     }
   };
 
-  const handleFileInput = (e: React.ChangeEvent<HTMLInputElement>) => {
-    if (e.target.files && e.target.files.length > 0) {
-      setUploadFile(e.target.files[0]);
-    }
-  };
+  const handleFileInput = (e: React.ChangeEvent<HTMLInputElement>) => {};
 
   // Using real data from React Query
statusReason: Unable to find an element with the text: test2.csv. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/documentos.tsx:113:54
   };
 
   const handleFileInput = (e: React.ChangeEvent<HTMLInputElement>) => {
-    if (e.target.files && e.target.files.length > 0) {
-      setUploadFile(e.target.files[0]);
-    }
+    if (e.target.files && e.target.files.length > 0) {}
   };
 
statusReason: Unable to find an element with the text: test2.csv. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] EqualityOperator
src/pages/documentos.tsx:113:27
   };
 
   const handleFileInput = (e: React.ChangeEvent<HTMLInputElement>) => {
-    if (e.target.files && e.target.files.length > 0) {
+    if (e.target.files && e.target.files.length <= 0) {
       setUploadFile(e.target.files[0]);
     }
statusReason: Unable to find an element with the text: test2.csv. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/documentos.tsx:119:28
   };
 
   // Using real data from React Query
-  const displayDocuments = documents.length > 0 ? documents : [];
+  const displayDocuments = false ? documents : [];
 
   const getStatusClass = (status: string) => {
statusReason: Unable to find an element with the text: Doc 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] EqualityOperator
src/pages/documentos.tsx:119:28
   };
 
   // Using real data from React Query
-  const displayDocuments = documents.length > 0 ? documents : [];
+  const displayDocuments = documents.length <= 0 ? documents : [];
 
   const getStatusClass = (status: string) => {
statusReason: Unable to find an element with the text: Doc 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] BlockStatement
src/pages/documentos.tsx:121:46
   // Using real data from React Query
   const displayDocuments = documents.length > 0 ? documents : [];
 
-  const getStatusClass = (status: string) => {
-    switch (status) {
-      case 'Em Revisão':
-        return 'status-review';
-      case 'Aprovado':
-        return 'status-approved';
-      case 'Submetido':
-        return 'status-submitted';
-      case 'Rascunho':
-        return 'status-draft';
-      default:
-        return 'status-draft';
-    }
-  };
+  const getStatusClass = (status: string) => {};
 
   const getTypeColor = (type: string) => {

[Survived] ConditionalExpression
src/pages/documentos.tsx:123:7
 
   const getStatusClass = (status: string) => {
     switch (status) {
-      case 'Em Revisão':
-        return 'status-review';
+      case 'Em Revisão':
       case 'Aprovado':
         return 'status-approved';

[Survived] StringLiteral
src/pages/documentos.tsx:123:12
 
   const getStatusClass = (status: string) => {
     switch (status) {
-      case 'Em Revisão':
+      case "":
         return 'status-review';
       case 'Aprovado':

[Survived] StringLiteral
src/pages/documentos.tsx:124:16
   const getStatusClass = (status: string) => {
     switch (status) {
       case 'Em Revisão':
-        return 'status-review';
+        return "";
       case 'Aprovado':
         return 'status-approved';

[Survived] ConditionalExpression
src/pages/documentos.tsx:125:7
     switch (status) {
       case 'Em Revisão':
         return 'status-review';
-      case 'Aprovado':
-        return 'status-approved';
+      case 'Aprovado':
       case 'Submetido':
         return 'status-submitted';

[Survived] ConditionalExpression
src/pages/documentos.tsx:127:7
         return 'status-review';
       case 'Aprovado':
         return 'status-approved';
-      case 'Submetido':
-        return 'status-submitted';
+      case 'Submetido':
       case 'Rascunho':
         return 'status-draft';

[Survived] StringLiteral
src/pages/documentos.tsx:127:12
         return 'status-review';
       case 'Aprovado':
         return 'status-approved';
-      case 'Submetido':
+      case "":
         return 'status-submitted';
       case 'Rascunho':
