[Survived] ConditionalExpression
src/pages/documentos.tsx:129:7
         return 'status-approved';
       case 'Submetido':
         return 'status-submitted';
-      case 'Rascunho':
-        return 'status-draft';
+      case 'Rascunho':
       default:
         return 'status-draft';

[Survived] StringLiteral
src/pages/documentos.tsx:129:12
         return 'status-approved';
       case 'Submetido':
         return 'status-submitted';
-      case 'Rascunho':
+      case "":
         return 'status-draft';
       default:

[NoCoverage] ConditionalExpression
src/pages/documentos.tsx:131:7
         return 'status-submitted';
       case 'Rascunho':
         return 'status-draft';
-      default:
-        return 'status-draft';
+      default:
     }
   };

[Survived] BlockStatement
src/pages/documentos.tsx:136:42
     }
   };
 
-  const getTypeColor = (type: string) => {
-    switch (type) {
-      case 'PDF':
-        return 'type-pdf';
-      case 'CSV':
-        return 'type-csv';
-      case 'JSON':
-        return 'type-json';
-      default:
-        return 'type-default';
-    }
-  };
+  const getTypeColor = (type: string) => {};
 
   return (

[Survived] ConditionalExpression
src/pages/documentos.tsx:138:7
 
   const getTypeColor = (type: string) => {
     switch (type) {
-      case 'PDF':
-        return 'type-pdf';
+      case 'PDF':
       case 'CSV':
         return 'type-csv';

[Survived] StringLiteral
src/pages/documentos.tsx:138:12
 
   const getTypeColor = (type: string) => {
     switch (type) {
-      case 'PDF':
+      case "":
         return 'type-pdf';
       case 'CSV':

[Survived] ConditionalExpression
src/pages/documentos.tsx:140:7
     switch (type) {
       case 'PDF':
         return 'type-pdf';
-      case 'CSV':
-        return 'type-csv';
+      case 'CSV':
       case 'JSON':
         return 'type-json';

[Survived] ConditionalExpression
src/pages/documentos.tsx:142:7
         return 'type-pdf';
       case 'CSV':
         return 'type-csv';
-      case 'JSON':
-        return 'type-json';
+      case 'JSON':
       default:
         return 'type-default';

[Survived] ConditionalExpression
src/pages/documentos.tsx:144:7
         return 'type-csv';
       case 'JSON':
         return 'type-json';
-      default:
-        return 'type-default';
+      default:
     }
   };

[Survived] StringLiteral
src/pages/documentos.tsx:153:31
     <DashboardLayout
       title="Meus Documentos"
       subtitle="Gerencie seus arquivos de pesquisa e acompanhe submissões"
-      breadcrumbs={['EdTech', 'Área de Pesquisa']}
+      breadcrumbs={['EdTech', ""]}
     >
       {/* Top Stats Cards */}

[Survived] StringLiteral
src/pages/documentos.tsx:153:21
     <DashboardLayout
       title="Meus Documentos"
       subtitle="Gerencie seus arquivos de pesquisa e acompanhe submissões"
-      breadcrumbs={['EdTech', 'Área de Pesquisa']}
+      breadcrumbs={["", 'Área de Pesquisa']}
     >
       {/* Top Stats Cards */}

[Killed] ArrowFunction
src/pages/documentos.tsx:223:27
                 className="docs-search-input"
                 placeholder="Buscar documento..."
                 value={filterTitle}
-                onChange={(e) => setFilterTitle(e.target.value)}
+                onChange={() => undefined}
               />
             </div>
statusReason: expect(element).toHaveValue(Doc Test)

Expected the element to have value:
  Doc Test
Received:

[Killed] ArrowFunction
src/pages/documentos.tsx:229:25
             <select
               className="docs-status-select"
               value={filterStatus}
-              onChange={(e) => setFilterStatus(e.target.value)}
+              onChange={() => undefined}
             >
               <option value="">Todos os status</option>
statusReason: expect(element).toHaveValue(Aprovado)

Expected the element to have value:
  Aprovado
Received:

[Killed] ConditionalExpression
src/pages/documentos.tsx:261:19
                     Carregando documentos...
                   </td>
                 </tr>
-              ) : displayDocuments.length === 0 ? (
+              ) : false ? (
                 <tr>
                   <td colSpan={7} className="text-center py-4 text-muted">
statusReason: Unable to find an element with the text: Nenhum documento encontrado.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/documentos.tsx:261:19
                     Carregando documentos...
                   </td>
                 </tr>
-              ) : displayDocuments.length === 0 ? (
+              ) : true ? (
                 <tr>
                   <td colSpan={7} className="text-center py-4 text-muted">
statusReason: Unable to find an element with the text: Doc 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ArrowFunction
src/pages/documentos.tsx:273:34
                     <div className="d-flex align-items-center gap-3">
                       <button 
                         className="btn-icon-action" 
-                        onClick={() => handleToggleStar(doc.id)}
+                        onClick={() => undefined}
                         style={{ color: doc.starred ? '#f59e0b' : '#cbd5e1', padding: 0 }}
                       >
statusReason: Unable to find an element with the text: Favorito atualizado!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] StringLiteral
src/pages/documentos.tsx:276:39
                         onClick={() => handleToggleStar(doc.id)}
                         style={{ color: doc.starred ? '#f59e0b' : '#cbd5e1', padding: 0 }}
                       >
-                        <i className={`bi ${doc.starred ? 'bi-star-fill' : 'bi-star'}`}></i>
+                        <i className={``}></i>
                       </button>
                       <div className={`doc-type-icon ${getTypeColor(doc.type || 'PDF')}-bg`}>
statusReason: Unable to fire a "click" event - please provide a DOM element.

[Survived] ConditionalExpression
src/pages/documentos.tsx:278:69
                       >
                         <i className={`bi ${doc.starred ? 'bi-star-fill' : 'bi-star'}`}></i>
                       </button>
-                      <div className={`doc-type-icon ${getTypeColor(doc.type || 'PDF')}-bg`}>
+                      <div className={`doc-type-icon ${getTypeColor(false)}-bg`}>
                         <i className={`bi bi-file-earmark-text ${getTypeColor(doc.type || 'PDF')}-text`}></i>
                       </div>

[Survived] ConditionalExpression
src/pages/documentos.tsx:278:69
                       >
                         <i className={`bi ${doc.starred ? 'bi-star-fill' : 'bi-star'}`}></i>
                       </button>
-                      <div className={`doc-type-icon ${getTypeColor(doc.type || 'PDF')}-bg`}>
+                      <div className={`doc-type-icon ${getTypeColor(true)}-bg`}>
                         <i className={`bi bi-file-earmark-text ${getTypeColor(doc.type || 'PDF')}-text`}></i>
                       </div>

[Survived] ConditionalExpression
src/pages/documentos.tsx:279:79
                         <i className={`bi ${doc.starred ? 'bi-star-fill' : 'bi-star'}`}></i>
                       </button>
                       <div className={`doc-type-icon ${getTypeColor(doc.type || 'PDF')}-bg`}>
-                        <i className={`bi bi-file-earmark-text ${getTypeColor(doc.type || 'PDF')}-text`}></i>
+                        <i className={`bi bi-file-earmark-text ${getTypeColor(true)}-text`}></i>
                       </div>
                       <span className="doc-title-cell">{doc.title}</span>

[Survived] ConditionalExpression
src/pages/documentos.tsx:279:79
                         <i className={`bi ${doc.starred ? 'bi-star-fill' : 'bi-star'}`}></i>
                       </button>
                       <div className={`doc-type-icon ${getTypeColor(doc.type || 'PDF')}-bg`}>
-                        <i className={`bi bi-file-earmark-text ${getTypeColor(doc.type || 'PDF')}-text`}></i>
+                        <i className={`bi bi-file-earmark-text ${getTypeColor(false)}-text`}></i>
                       </div>
                       <span className="doc-title-cell">{doc.title}</span>

[Survived] ConditionalExpression
src/pages/documentos.tsx:284:47
                       <span className="doc-title-cell">{doc.title}</span>
                     </div>
                   </td>
-                  <td className="text-muted">{doc.project || 'Projeto'}</td>
+                  <td className="text-muted">{true}</td>
                   <td>
                     <span className={`type-badge ${getTypeColor(doc.type || 'PDF')}-text`}>{doc.type || 'PDF'}</span>

[Survived] LogicalOperator
src/pages/documentos.tsx:284:47
                       <span className="doc-title-cell">{doc.title}</span>
                     </div>
                   </td>
-                  <td className="text-muted">{doc.project || 'Projeto'}</td>
+                  <td className="text-muted">{doc.project && 'Projeto'}</td>
                   <td>
                     <span className={`type-badge ${getTypeColor(doc.type || 'PDF')}-text`}>{doc.type || 'PDF'}</span>

[Survived] ConditionalExpression
src/pages/documentos.tsx:286:93
                   </td>
                   <td className="text-muted">{doc.project || 'Projeto'}</td>
                   <td>
-                    <span className={`type-badge ${getTypeColor(doc.type || 'PDF')}-text`}>{doc.type || 'PDF'}</span>
+                    <span className={`type-badge ${getTypeColor(doc.type || 'PDF')}-text`}>{true}</span>
                   </td>
                   <td className="text-muted">{doc.size}</td>

[Survived] LogicalOperator
src/pages/documentos.tsx:286:93
                   </td>
                   <td className="text-muted">{doc.project || 'Projeto'}</td>
                   <td>
-                    <span className={`type-badge ${getTypeColor(doc.type || 'PDF')}-text`}>{doc.type || 'PDF'}</span>
+                    <span className={`type-badge ${getTypeColor(doc.type || 'PDF')}-text`}>{doc.type && 'PDF'}</span>
                   </td>
                   <td className="text-muted">{doc.size}</td>

[Killed] ArrowFunction
src/pages/documentos.tsx:300:34
                       <button
                         className="btn-icon-action"
                         title="Visualizar"
-                        onClick={() => handleView(doc as Document)}
+                        onClick={() => undefined}
                       >
                         <i className="bi bi-eye"></i>
statusReason: Unable to find an element with the text: Seu navegador não suporta a visualização nativa de PDFs.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ArrowFunction
src/pages/documentos.tsx:307:34
                       <button
                         className="btn-icon-action"
                         title="Download"
-                        onClick={() => handleDownload(doc.id)}
+                        onClick={() => undefined}
                       >
                         <i className="bi bi-download"></i>
statusReason: Unable to find an element with the text: Iniciando download seguro.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ArrowFunction
src/pages/documentos.tsx:314:34
                       <button
                         className="btn-icon-action"
                         title="Opções"
-                        onClick={() => handleOptions(doc.title)}
+                        onClick={() => undefined}
                       >
                         <i className="bi bi-three-dots"></i>
statusReason: Unable to find an element with the text: Carregando opções para: Doc 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] ArrowFunction
src/pages/documentos.tsx:330:51
       {/* Upload Modal Overlay */}
       {isUploadModalOpen && (
         <div className="modal-overlay" onClick={closeUploadModal}>
-          <div className="modal-content" onClick={(e) => e.stopPropagation()}>
+          <div className="modal-content" onClick={() => undefined}>
             <div className="modal-header">
               <div className="modal-title-group">

[Killed] StringLiteral
src/pages/documentos.tsx:343:56
 
             <div className="modal-body">
               <div
-                className={`upload-area ${isDragging ? 'dragging' : ''}`}
+                className={`upload-area ${isDragging ? "" : ''}`}
                 onDragOver={handleDragOver}
                 onDragLeave={handleDragLeave}
statusReason: expect(element).toHaveClass("dragging")

Expected the element to have class:
  dragging
Received:
  upload-area

[Survived] StringLiteral
src/pages/documentos.tsx:343:69
 
             <div className="modal-body">
               <div
-                className={`upload-area ${isDragging ? 'dragging' : ''}`}
+                className={`upload-area ${isDragging ? 'dragging' : "Stryker was here!"}`}
                 onDragOver={handleDragOver}
                 onDragLeave={handleDragLeave}

[Survived] ArrowFunction
src/pages/documentos.tsx:347:26
                 onDragOver={handleDragOver}
                 onDragLeave={handleDragLeave}
                 onDrop={handleDrop}
-                onClick={() => document.getElementById('modalFileInput')?.click()}
+                onClick={() => undefined}
               >
                 <div className="upload-icon-circle">

[NoCoverage] OptionalChaining
src/pages/documentos.tsx:347:32
                 onDragOver={handleDragOver}
                 onDragLeave={handleDragLeave}
                 onDrop={handleDrop}
-                onClick={() => document.getElementById('modalFileInput')?.click()}
+                onClick={() => document.getElementById('modalFileInput').click()}
               >
                 <div className="upload-icon-circle">

[Killed] BooleanLiteral
src/pages/documentos.tsx:370:62
               <button className="btn-modal-cancel" onClick={closeUploadModal}>
                 Cancelar
               </button>
-              <button className="btn-modal-submit" disabled={!uploadFile}>
+              <button className="btn-modal-submit" disabled={uploadFile}>
                 Enviar Arquivo
               </button>
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <button
  class="btn-modal-submit"
  disabled=""
/>

[Survived] ObjectLiteral
src/pages/documentos.tsx:380:75
 
       {/* Document Preview Modal */}
       {previewDoc && (
-        <div className="modal-overlay" onClick={closePreviewModal} style={{ zIndex: 1050 }}>
+        <div className="modal-overlay" onClick={closePreviewModal} style={{}}>
           <div className="preview-modal-content" style={{ maxWidth: '1200px', width: '90%' }} onClick={(e) => e.stopPropagation()}>
             <div className="preview-modal-header">

[Survived] ArrowFunction
src/pages/documentos.tsx:381:104
       {/* Document Preview Modal */}
       {previewDoc && (
         <div className="modal-overlay" onClick={closePreviewModal} style={{ zIndex: 1050 }}>
-          <div className="preview-modal-content" style={{ maxWidth: '1200px', width: '90%' }} onClick={(e) => e.stopPropagation()}>
+          <div className="preview-modal-content" style={{ maxWidth: '1200px', width: '90%' }} onClick={() => undefined}>
             <div className="preview-modal-header">
               <div className="d-flex align-items-center gap-3">

[Survived] StringLiteral
src/pages/documentos.tsx:381:86
       {/* Document Preview Modal */}
       {previewDoc && (
         <div className="modal-overlay" onClick={closePreviewModal} style={{ zIndex: 1050 }}>
-          <div className="preview-modal-content" style={{ maxWidth: '1200px', width: '90%' }} onClick={(e) => e.stopPropagation()}>
+          <div className="preview-modal-content" style={{ maxWidth: '1200px', width: "" }} onClick={(e) => e.stopPropagation()}>
             <div className="preview-modal-header">
               <div className="d-flex align-items-center gap-3">

[Survived] StringLiteral
src/pages/documentos.tsx:388:73
                   {previewDoc.type}
                 </span>
                 <div>
-                  <h3 className="m-0" style={{ fontSize: '18px', color: 'var(--ed-text-light)' }}>
+                  <h3 className="m-0" style={{ fontSize: '18px', color: "" }}>
                     {previewDoc.title}
                   </h3>

[Survived] StringLiteral
src/pages/documentos.tsx:391:59
                   <h3 className="m-0" style={{ fontSize: '18px', color: 'var(--ed-text-light)' }}>
                     {previewDoc.title}
                   </h3>
-                  <span style={{ fontSize: '12px', color: 'var(--ed-text-muted)' }}>
+                  <span style={{ fontSize: '12px', color: "" }}>
                     {previewDoc.size} • {previewDoc.project}
                   </span>

[Survived] ArrowFunction
src/pages/documentos.tsx:397:62
                 </div>
               </div>
               <div className="d-flex gap-2">
-                <button className="btn-icon-action" onClick={() => handleDownload(previewDoc.id)}>
+                <button className="btn-icon-action" onClick={() => undefined}>
                   <i className="bi bi-download"></i>
                 </button>

[Survived] ObjectLiteral
src/pages/documentos.tsx:406:56
               </div>
             </div>
 
-            <div className="preview-modal-body" style={{ padding: '0', height: '75vh', display: 'flex', flexDirection: 'row', background: '#e2e8f0' }}>
+            <div className="preview-modal-body" style={{}}>
               
               {/* PDF Viewer Area */}

[Survived] StringLiteral
src/pages/documentos.tsx:409:70
             <div className="preview-modal-body" style={{ padding: '0', height: '75vh', display: 'flex', flexDirection: 'row', background: '#e2e8f0' }}>
               
               {/* PDF Viewer Area */}
-              <div style={{ flex: 1, display: 'flex', flexDirection: 'column' }}>
+              <div style={{ flex: 1, display: 'flex', flexDirection: "" }}>
                 {isPreviewLoading ? (
                   <div style={{ padding: '2rem', textAlign: 'center', color: '#64748B', display: 'flex', alignItems: 'center', justifyContent: 'center', height: '100%' }}>

[Survived] ObjectLiteral
src/pages/documentos.tsx:409:27
             <div className="preview-modal-body" style={{ padding: '0', height: '75vh', display: 'flex', flexDirection: 'row', background: '#e2e8f0' }}>
               
               {/* PDF Viewer Area */}
-              <div style={{ flex: 1, display: 'flex', flexDirection: 'column' }}>
+              <div style={{}}>
                 {isPreviewLoading ? (
                   <div style={{ padding: '2rem', textAlign: 'center', color: '#64748B', display: 'flex', alignItems: 'center', justifyContent: 'center', height: '100%' }}>

[Survived] StringLiteral
src/pages/documentos.tsx:411:98
               {/* PDF Viewer Area */}
               <div style={{ flex: 1, display: 'flex', flexDirection: 'column' }}>
                 {isPreviewLoading ? (
-                  <div style={{ padding: '2rem', textAlign: 'center', color: '#64748B', display: 'flex', alignItems: 'center', justifyContent: 'center', height: '100%' }}>
+                  <div style={{ padding: '2rem', textAlign: 'center', color: '#64748B', display: "", alignItems: 'center', justifyContent: 'center', height: '100%' }}>
                     Carregando visualização do documento...
                   </div>

[Survived] ObjectLiteral
src/pages/documentos.tsx:411:31
               {/* PDF Viewer Area */}
               <div style={{ flex: 1, display: 'flex', flexDirection: 'column' }}>
                 {isPreviewLoading ? (
-                  <div style={{ padding: '2rem', textAlign: 'center', color: '#64748B', display: 'flex', alignItems: 'center', justifyContent: 'center', height: '100%' }}>
+                  <div style={{}}>
                     Carregando visualização do documento...
                   </div>

[Killed] ConditionalExpression
src/pages/documentos.tsx:415:20
                     Carregando visualização do documento...
                   </div>
                 ) : previewUrl ? (
-                  (previewDoc.type === 'CSV' || previewDoc.type === 'JSON') ? (
+                  (false) ? (
                     <DatasetPreview url={previewUrl} type={previewDoc.type} />
                   ) : (
statusReason: Unable to find an element by: [data-testid="dataset-preview"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/documentos.tsx:415:20
                     Carregando visualização do documento...
                   </div>
                 ) : previewUrl ? (
-                  (previewDoc.type === 'CSV' || previewDoc.type === 'JSON') ? (
+                  (false || previewDoc.type === 'JSON') ? (
                     <DatasetPreview url={previewUrl} type={previewDoc.type} />
                   ) : (
statusReason: Unable to find an element by: [data-testid="dataset-preview"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] StringLiteral
src/pages/documentos.tsx:426:78
                     </object>
                   )
                 ) : (
-                  <div style={{ padding: '2rem', textAlign: 'center', color: '#64748B', display: 'flex', alignItems: 'center', justifyContent: 'center', height: '100%' }}>
+                  <div style={{ padding: '2rem', textAlign: 'center', color: "", display: 'flex', alignItems: 'center', justifyContent: 'center', height: '100%' }}>
                     Nenhum preview disponível.
                   </div>

[Survived] StringLiteral
src/pages/documentos.tsx:426:61
                     </object>
                   )
                 ) : (
-                  <div style={{ padding: '2rem', textAlign: 'center', color: '#64748B', display: 'flex', alignItems: 'center', justifyContent: 'center', height: '100%' }}>
+                  <div style={{ padding: '2rem', textAlign: "", color: '#64748B', display: 'flex', alignItems: 'center', justifyContent: 'center', height: '100%' }}>
                     Nenhum preview disponível.
                   </div>

[Survived] StringLiteral
src/pages/documentos.tsx:433:68
               </div>
 
               {/* Chat / Comments Drawer */}
-              <div style={{ width: '350px', flexShrink: 0, height: '100%' }}>
+              <div style={{ width: '350px', flexShrink: 0, height: "" }}>
                 <DocumentComments documentId={previewDoc.id} />
               </div>

[Killed] ConditionalExpression
src/pages/documentos.tsx:443:8
       )}
 
       {/* Premium Toast Notification */}
-      {toastMessage && (
-        <div className="premium-toast">
-          <i className="bi bi-info-circle"></i>
-          <span>{toastMessage}</span>
-        </div>
-      )}
+      {true}
     </DashboardLayout>
   );
statusReason: Unable to find an element with the text: Carregando opções para: Doc 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/documentos.tsx:443:8
       )}
 
       {/* Premium Toast Notification */}
-      {toastMessage && (
-        <div className="premium-toast">
-          <i className="bi bi-info-circle"></i>
-          <span>{toastMessage}</span>
-        </div>
-      )}
+      {false}
     </DashboardLayout>
   );
statusReason: Unable to find an element with the text: Carregando opções para: Doc 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >
