[Survived] StringLiteral
src/pages/register.tsx:9:36
 import styles from './auth.module.css';
 
 function Register() {
-  const [nome, setNome] = useState('');
+  const [nome, setNome] = useState("Stryker was here!");
   const [email, setEmail] = useState('');
   const [senha, setSenha] = useState('');

[Survived] StringLiteral
src/pages/register.tsx:12:56
   const [nome, setNome] = useState('');
   const [email, setEmail] = useState('');
   const [senha, setSenha] = useState('');
-  const [confirmarSenha, setConfirmarSenha] = useState('');
+  const [confirmarSenha, setConfirmarSenha] = useState("Stryker was here!");
   const [erro, setErro] = useState('');
   const [showPassword, setShowPassword] = useState(false);

[Killed] BooleanLiteral
src/pages/register.tsx:14:52
   const [senha, setSenha] = useState('');
   const [confirmarSenha, setConfirmarSenha] = useState('');
   const [erro, setErro] = useState('');
-  const [showPassword, setShowPassword] = useState(false);
+  const [showPassword, setShowPassword] = useState(true);
   const [showConfirmPassword, setShowConfirmPassword] = useState(false);
   const [isShaking, setIsShaking] = useState(false);
killedBy: Register Page toggles password visibility for both password fields
statusReason: expected 'text' to be 'password' // Object.is equality

[Survived] BooleanLiteral
src/pages/register.tsx:16:46
   const [erro, setErro] = useState('');
   const [showPassword, setShowPassword] = useState(false);
   const [showConfirmPassword, setShowConfirmPassword] = useState(false);
-  const [isShaking, setIsShaking] = useState(false);
+  const [isShaking, setIsShaking] = useState(true);
   const [role, setRole] = useState('RESEARCHER');
   const [step, setStep] = useState(1);

[Killed] BlockStatement
src/pages/register.tsx:23:54
 
   const navigate = useNavigate();
 
-  const handleSubmit = async (e: React.FormEvent) => {
-    if (e) e.preventDefault();
-    setErro('');
-    if (senha !== confirmarSenha) {
-      setErro('As senhas não coincidem. Por favor tente novamente');
-      setIsShaking(true);
-      setTimeout(() => setIsShaking(false), 500);
-      return;
-    }
-    try {
-      const resultado = await register(nome, email, senha, role);
-      if (resultado.sucesso === true) {
-        setStep(2);
-      } else {
-        setErro(resultado.mensagem);
-      }
-    } catch (erro) {
-      setErro(erro.message);
-    }
-  };
+  const handleSubmit = async (e: React.FormEvent) => {};
 
   const handleVerify = async (e: React.FormEvent) => {
killedBy: Register Page submits the register form with mismatching passwords
statusReason: Unable to find an element with the text: /As senhas não coincidem/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Survived] ConditionalExpression
src/pages/register.tsx:24:9
   const navigate = useNavigate();
 
   const handleSubmit = async (e: React.FormEvent) => {
-    if (e) e.preventDefault();
+    if (true) e.preventDefault();
     setErro('');
     if (senha !== confirmarSenha) {

[Survived] ConditionalExpression
src/pages/register.tsx:24:9
   const navigate = useNavigate();
 
   const handleSubmit = async (e: React.FormEvent) => {
-    if (e) e.preventDefault();
+    if (false) e.preventDefault();
     setErro('');
     if (senha !== confirmarSenha) {

[Killed] ConditionalExpression
src/pages/register.tsx:26:9
   const handleSubmit = async (e: React.FormEvent) => {
     if (e) e.preventDefault();
     setErro('');
-    if (senha !== confirmarSenha) {
+    if (false) {
       setErro('As senhas não coincidem. Por favor tente novamente');
       setIsShaking(true);
killedBy: Register Page submits the register form with mismatching passwords
statusReason: Unable to find an element with the text: /As senhas não coincidem/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Killed] ConditionalExpression
src/pages/register.tsx:26:9
   const handleSubmit = async (e: React.FormEvent) => {
     if (e) e.preventDefault();
     setErro('');
-    if (senha !== confirmarSenha) {
+    if (true) {
       setErro('As senhas não coincidem. Por favor tente novamente');
       setIsShaking(true);
killedBy: Register Page submits register successfully and moves to step 2, then submits verify successfully
statusReason: Unable to find an element with the placeholder text of: Ex: 123456

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Survived] BooleanLiteral
src/pages/register.tsx:28:20
     setErro('');
     if (senha !== confirmarSenha) {
       setErro('As senhas não coincidem. Por favor tente novamente');
-      setIsShaking(true);
+      setIsShaking(false);
       setTimeout(() => setIsShaking(false), 500);
       return;

[Killed] BlockStatement
src/pages/register.tsx:32:9
       setTimeout(() => setIsShaking(false), 500);
       return;
     }
-    try {
-      const resultado = await register(nome, email, senha, role);
-      if (resultado.sucesso === true) {
-        setStep(2);
-      } else {
-        setErro(resultado.mensagem);
-      }
-    } catch (erro) {
+    try {} catch (erro) {
       setErro(erro.message);
     }
killedBy: Register Page submits register successfully and moves to step 2, then submits verify successfully
statusReason: Unable to find an element with the placeholder text of: Ex: 123456

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Killed] EqualityOperator
src/pages/register.tsx:34:11
     }
     try {
       const resultado = await register(nome, email, senha, role);
-      if (resultado.sucesso === true) {
+      if (resultado.sucesso !== true) {
         setStep(2);
       } else {
killedBy: Register Page submits register successfully and moves to step 2, then submits verify successfully
statusReason: Unable to find an element with the placeholder text of: Ex: 123456

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Killed] BooleanLiteral
src/pages/register.tsx:34:33
     }
     try {
       const resultado = await register(nome, email, senha, role);
-      if (resultado.sucesso === true) {
+      if (resultado.sucesso === false) {
         setStep(2);
       } else {
killedBy: Register Page submits register successfully and moves to step 2, then submits verify successfully
statusReason: Unable to find an element with the placeholder text of: Ex: 123456

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Killed] BlockStatement
src/pages/register.tsx:36:14
       const resultado = await register(nome, email, senha, role);
       if (resultado.sucesso === true) {
         setStep(2);
-      } else {
-        setErro(resultado.mensagem);
-      }
+      } else {}
     } catch (erro) {
       setErro(erro.message);
killedBy: Register Page submits register and handles error
statusReason: Unable to find an element with the text: /Error registering/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Killed] BlockStatement
src/pages/register.tsx:39:20
       } else {
         setErro(resultado.mensagem);
       }
-    } catch (erro) {
-      setErro(erro.message);
-    }
+    } catch (erro) {}
   };
 
killedBy: Register Page handles API throw error in register
statusReason: Unable to find an element with the text: /Network Error/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Killed] BlockStatement
src/pages/register.tsx:44:54
     }
   };
 
-  const handleVerify = async (e: React.FormEvent) => {
-    if (e) e.preventDefault();
-    setErro('');
-    if (otp.length < 6) {
-      setErro('Por favor, insira o código de 6 dígitos.');
-      setIsShaking(true);
-      setTimeout(() => setIsShaking(false), 500);
-      return;
-    }
-    try {
-      const resultado = await verifyRegistration(email, otp);
-      if (resultado.sucesso === true) {
-        navigate('/login');
-      } else {
-        setErro(resultado.mensagem);
-      }
-    } catch (erro) {
-      setErro(erro.message);
-    }
-  };
+  const handleVerify = async (e: React.FormEvent) => {};
 
 
killedBy: Register Page submits register successfully and moves to step 2, then submits verify successfully
statusReason: expected "vi.fn()" to be called with arguments: [ 'test@edu.br', '123456' ]

Number of calls: 0

[Survived] ConditionalExpression
src/pages/register.tsx:45:9
   };
 
   const handleVerify = async (e: React.FormEvent) => {
-    if (e) e.preventDefault();
+    if (false) e.preventDefault();
     setErro('');
     if (otp.length < 6) {

[Survived] ConditionalExpression
src/pages/register.tsx:45:9
   };
 
   const handleVerify = async (e: React.FormEvent) => {
-    if (e) e.preventDefault();
+    if (true) e.preventDefault();
     setErro('');
     if (otp.length < 6) {

[Killed] ConditionalExpression
src/pages/register.tsx:47:9
   const handleVerify = async (e: React.FormEvent) => {
     if (e) e.preventDefault();
     setErro('');
-    if (otp.length < 6) {
+    if (true) {
       setErro('Por favor, insira o código de 6 dígitos.');
       setIsShaking(true);
killedBy: Register Page submits register successfully and moves to step 2, then submits verify successfully
statusReason: expected "vi.fn()" to be called with arguments: [ 'test@edu.br', '123456' ]

Number of calls: 0

[Killed] BlockStatement
src/pages/register.tsx:47:25
   const handleVerify = async (e: React.FormEvent) => {
     if (e) e.preventDefault();
     setErro('');
-    if (otp.length < 6) {
-      setErro('Por favor, insira o código de 6 dígitos.');
-      setIsShaking(true);
-      setTimeout(() => setIsShaking(false), 500);
-      return;
-    }
+    if (otp.length < 6) {}
     try {
       const resultado = await verifyRegistration(email, otp);
killedBy: Register Page shows error if OTP is too short and toggles back to step 1
statusReason: Unable to find an element with the text: /Por favor, insira o código de 6 dígitos./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Killed] StringLiteral
src/pages/register.tsx:48:15
     if (e) e.preventDefault();
     setErro('');
     if (otp.length < 6) {
-      setErro('Por favor, insira o código de 6 dígitos.');
+      setErro("");
       setIsShaking(true);
       setTimeout(() => setIsShaking(false), 500);
killedBy: Register Page shows error if OTP is too short and toggles back to step 1
statusReason: Unable to find an element with the text: /Por favor, insira o código de 6 dígitos./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Survived] BooleanLiteral
src/pages/register.tsx:49:20
     setErro('');
     if (otp.length < 6) {
       setErro('Por favor, insira o código de 6 dígitos.');
-      setIsShaking(true);
+      setIsShaking(false);
       setTimeout(() => setIsShaking(false), 500);
       return;

[Killed] BlockStatement
src/pages/register.tsx:53:9
       setTimeout(() => setIsShaking(false), 500);
       return;
     }
-    try {
-      const resultado = await verifyRegistration(email, otp);
-      if (resultado.sucesso === true) {
-        navigate('/login');
-      } else {
-        setErro(resultado.mensagem);
-      }
-    } catch (erro) {
+    try {} catch (erro) {
       setErro(erro.message);
     }
killedBy: Register Page submits register successfully and moves to step 2, then submits verify successfully
statusReason: expected "vi.fn()" to be called with arguments: [ 'test@edu.br', '123456' ]

Number of calls: 0

[Killed] EqualityOperator
src/pages/register.tsx:55:11
     }
     try {
       const resultado = await verifyRegistration(email, otp);
-      if (resultado.sucesso === true) {
+      if (resultado.sucesso !== true) {
         navigate('/login');
       } else {
killedBy: Register Page submits verify and handles error
statusReason: Unable to find an element with the text: /Wrong OTP/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Killed] BooleanLiteral
src/pages/register.tsx:55:33
     }
     try {
       const resultado = await verifyRegistration(email, otp);
-      if (resultado.sucesso === true) {
+      if (resultado.sucesso === false) {
         navigate('/login');
       } else {
killedBy: Register Page submits verify and handles error
statusReason: Unable to find an element with the text: /Wrong OTP/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Killed] BlockStatement
src/pages/register.tsx:57:14
       const resultado = await verifyRegistration(email, otp);
       if (resultado.sucesso === true) {
         navigate('/login');
-      } else {
-        setErro(resultado.mensagem);
-      }
+      } else {}
     } catch (erro) {
       setErro(erro.message);
killedBy: Register Page submits verify and handles error
statusReason: Unable to find an element with the text: /Wrong OTP/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Killed] ConditionalExpression
src/pages/register.tsx:81:19
       subtitle="Junte-se à principal plataforma de governança acadêmica."
     >
       <form
-        onSubmit={step === 1 ? handleSubmit : handleVerify}
+        onSubmit={true ? handleSubmit : handleVerify}
         onInvalid={(e) => {
           e.preventDefault();
killedBy: Register Page submits register successfully and moves to step 2, then submits verify successfully
statusReason: expected "vi.fn()" to be called with arguments: [ 'test@edu.br', '123456' ]

Number of calls: 0

[Killed] EqualityOperator
src/pages/register.tsx:81:19
       subtitle="Junte-se à principal plataforma de governança acadêmica."
     >
       <form
-        onSubmit={step === 1 ? handleSubmit : handleVerify}
+        onSubmit={step !== 1 ? handleSubmit : handleVerify}
         onInvalid={(e) => {
           e.preventDefault();
killedBy: Register Page submits the register form with mismatching passwords
statusReason: Unable to find an element with the text: /As senhas não coincidem/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[NoCoverage] BlockStatement
src/pages/register.tsx:82:27
     >
       <form
         onSubmit={step === 1 ? handleSubmit : handleVerify}
-        onInvalid={(e) => {
-          e.preventDefault();
-          setIsShaking(true);
-          setTimeout(() => setIsShaking(false), 500);
-        }}
+        onInvalid={(e) => {}}
       >
         {erro && (

[NoCoverage] BooleanLiteral
src/pages/register.tsx:84:24
         onSubmit={step === 1 ? handleSubmit : handleVerify}
         onInvalid={(e) => {
           e.preventDefault();
-          setIsShaking(true);
+          setIsShaking(false);
           setTimeout(() => setIsShaking(false), 500);
         }}

[Killed] ConditionalExpression
src/pages/register.tsx:88:10
           setTimeout(() => setIsShaking(false), 500);
         }}
       >
-        {erro && (
-          <motion.div
-            initial={{ opacity: 0, height: 0 }}
-            animate={{ opacity: 1, height: 'auto' }}
-            className={styles.errorAlert}
-          >
-            <span style={{ marginRight: '8px' }}>⚠️</span>
-            {erro}
-          </motion.div>
-        )}
+        {false}
 
         {step === 1 ? (
killedBy: Register Page submits the register form with mismatching passwords
statusReason: Unable to find an element with the text: /As senhas não coincidem/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Killed] ConditionalExpression
src/pages/register.tsx:88:10
           setTimeout(() => setIsShaking(false), 500);
         }}
       >
-        {erro && (
-          <motion.div
-            initial={{ opacity: 0, height: 0 }}
-            animate={{ opacity: 1, height: 'auto' }}
-            className={styles.errorAlert}
-          >
-            <span style={{ marginRight: '8px' }}>⚠️</span>
-            {erro}
-          </motion.div>
-        )}
+        {true}
 
         {step === 1 ? (
killedBy: Register Page submits the register form with mismatching passwords
statusReason: Unable to find an element with the text: /As senhas não coincidem/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Survived] StringLiteral
src/pages/register.tsx:94:41
             animate={{ opacity: 1, height: 'auto' }}
             className={styles.errorAlert}
           >
-            <span style={{ marginRight: '8px' }}>⚠️</span>
+            <span style={{ marginRight: "" }}>⚠️</span>
             {erro}
           </motion.div>

[Killed] ConditionalExpression
src/pages/register.tsx:99:10
           </motion.div>
         )}
 
-        {step === 1 ? (
+        {true ? (
           <>
             <motion.div variants={itemVariants} className={styles.inputGroup}>
killedBy: Register Page submits register successfully and moves to step 2, then submits verify successfully
statusReason: Unable to find an element with the placeholder text of: Ex: 123456

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Killed] ConditionalExpression
src/pages/register.tsx:99:10
           </motion.div>
         )}
 
-        {step === 1 ? (
+        {false ? (
           <>
             <motion.div variants={itemVariants} className={styles.inputGroup}>
killedBy: Register Page renders register form correctly
statusReason: Unable to find an element with the placeholder text of: ex: Chiquinha Silva

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Survived] ArrowFunction
src/pages/register.tsx:109:29
                 <select
                   className={styles.inputField}
                   value={role}
-                  onChange={(e) => setRole(e.target.value)}
+                  onChange={() => undefined}
                   aria-label="perfil"
                   required

[Killed] ArrowFunction
src/pages/register.tsx:129:25
               className={styles.inputField}
               type="text"
               value={nome}
-              onChange={(e) => setNome(e.target.value)}
+              onChange={() => undefined}
               placeholder="ex: Chiquinha Silva"
               aria-label="nome"
killedBy: Register Page updates input fields on typing
statusReason: expected '' to be 'Chiquinha Silva' // Object.is equality

[Killed] StringLiteral
src/pages/register.tsx:215:54
             <div className={styles.inputWrapper}>
               <input
                 className={styles.inputField}
-                type={showConfirmPassword ? 'text' : 'password'}
+                type={showConfirmPassword ? 'text' : ""}
                 value={confirmarSenha}
                 onChange={(e) => setConfirmarSenha(e.target.value)}
killedBy: Register Page toggles password visibility for both password fields
statusReason: expected 'text' to be 'password' // Object.is equality

[Survived] StringLiteral
src/pages/register.tsx:266:20
           variants={itemVariants}
           style={{
             fontSize: '0.7rem',
-            color: 'var(--text)',
+            color: "",
             marginTop: '-0.5rem',
             marginBottom: '1rem',

[Survived] StringLiteral
src/pages/register.tsx:268:27
             fontSize: '0.7rem',
             color: 'var(--text)',
             marginTop: '-0.5rem',
-            marginBottom: '1rem',
+            marginBottom: "",
           }}
         >

[Survived] StringLiteral
src/pages/register.tsx:277:42
 
         <motion.button
           variants={Object.assign({}, itemVariants, shakeVariants)}
-          animate={isShaking ? 'shake' : 'visible'}
+          animate={isShaking ? 'shake' : ""}
           whileHover={{ scale: 1.02 }}
           whileTap={{ scale: 0.98 }}

[Survived] StringLiteral
src/pages/register.tsx:277:32
 
         <motion.button
           variants={Object.assign({}, itemVariants, shakeVariants)}
-          animate={isShaking ? 'shake' : 'visible'}
+          animate={isShaking ? "" : 'visible'}
           whileHover={{ scale: 1.02 }}
           whileTap={{ scale: 0.98 }}

[Survived] ObjectLiteral
src/pages/register.tsx:279:21
           variants={Object.assign({}, itemVariants, shakeVariants)}
           animate={isShaking ? 'shake' : 'visible'}
           whileHover={{ scale: 1.02 }}
-          whileTap={{ scale: 0.98 }}
+          whileTap={{}}
           type="submit"
           className={styles.submitBtn}

[Survived] StringLiteral
src/pages/register.tsx:295:26
               <motion.p
                 style={{
                   fontSize: '0.85rem',
-                  color: 'var(--text)',
+                  color: "",
                   marginBottom: '1rem',
                 }}

[Killed] ArrowFunction
src/pages/register.tsx:306:29
                   className={styles.inputField}
                   type="text"
                   value={otp}
-                  onChange={(e) => setOtp(e.target.value)}
+                  onChange={() => undefined}
                   placeholder="Ex: 123456"
                   aria-label="código de verificação"
killedBy: Register Page submits register successfully and moves to step 2, then submits verify successfully
statusReason: expected "vi.fn()" to be called with arguments: [ 'test@edu.br', '123456' ]

Number of calls: 0

[Killed] ArrowFunction
src/pages/register.tsx:330:24
               whileHover={{ scale: 1.02 }}
               whileTap={{ scale: 0.98 }}
               type="button"
-              onClick={() => setStep(1)}
+              onClick={() => undefined}
               className={styles.submitBtn}
               style={{
killedBy: Register Page shows error if OTP is too short and toggles back to step 1
statusReason: Unable to find an element with the placeholder text of: ex: Chiquinha Silva

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="_loginWrapper_d61aea"
    >

[Survived] StringLiteral
src/pages/register.tsx:333:28
               onClick={() => setStep(1)}
               className={styles.submitBtn}
               style={{
-                marginTop: '1rem',
+                marginTop: "",
                 backgroundColor: 'transparent',
                 border: '1px solid var(--border)',

[Survived] StringLiteral
src/pages/register.tsx:334:34
               className={styles.submitBtn}
               style={{
                 marginTop: '1rem',
-                backgroundColor: 'transparent',
+                backgroundColor: "",
                 border: '1px solid var(--border)',
                 color: 'var(--text)'

[Survived] StringLiteral
src/pages/register.tsx:335:25
               style={{
                 marginTop: '1rem',
                 backgroundColor: 'transparent',
-                border: '1px solid var(--border)',
+                border: "",
                 color: 'var(--text)'
               }}

[Survived] StringLiteral
src/pages/register.tsx:336:24
                 marginTop: '1rem',
                 backgroundColor: 'transparent',
                 border: '1px solid var(--border)',
-                color: 'var(--text)'
+                color: ""
               }}
             >

[Survived] StringLiteral
src/pages/register.tsx:347:73
 
       <motion.p
         variants={itemVariants}
-        style={{ textAlign: 'center', margin: '1.5rem 0 0 0', fontSize: '0.875rem' }}
+        style={{ textAlign: 'center', margin: '1.5rem 0 0 0', fontSize: "" }}
       >
         Já tem uma conta?{' '}
