[Killed] BooleanLiteral
src/pages/settings.tsx:9:52
 
 const Settings: React.FC = () => {
   const { user } = useAuth();
-  const [reviewEmails, setReviewEmails] = useState(true);
+  const [reviewEmails, setReviewEmails] = useState(false);
   const [strictLgpd, setStrictLgpd] = useState(true);
   
killedBy: Settings Page toggles review emails and strict lgpd
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  type="checkbox"
/>

[Killed] BooleanLiteral
src/pages/settings.tsx:10:48
 const Settings: React.FC = () => {
   const { user } = useAuth();
   const [reviewEmails, setReviewEmails] = useState(true);
-  const [strictLgpd, setStrictLgpd] = useState(true);
+  const [strictLgpd, setStrictLgpd] = useState(false);
   
   const [qrCodeUri, setQrCodeUri] = useState<string | null>(null);
killedBy: Settings Page toggles review emails and strict lgpd
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  type="checkbox"
/>

[Killed] LogicalOperator
src/pages/settings.tsx:14:52
   
   const [qrCodeUri, setQrCodeUri] = useState<string | null>(null);
   const [totpCode, setTotpCode] = useState('');
-  const [is2FaEnabled, setIs2FaEnabled] = useState(user?.mfaEnabled || false);
+  const [is2FaEnabled, setIs2FaEnabled] = useState(user?.mfaEnabled && false);
   const [setupError, setSetupError] = useState('');
 
killedBy: Settings Page renders correctly when 2FA is already enabled
statusReason: Unable to find an element with the text: Ativado. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/settings.tsx:14:52
   
   const [qrCodeUri, setQrCodeUri] = useState<string | null>(null);
   const [totpCode, setTotpCode] = useState('');
-  const [is2FaEnabled, setIs2FaEnabled] = useState(user?.mfaEnabled || false);
+  const [is2FaEnabled, setIs2FaEnabled] = useState(false);
   const [setupError, setSetupError] = useState('');
 
killedBy: Settings Page renders correctly when 2FA is already enabled
statusReason: Unable to find an element with the text: Ativado. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/settings.tsx:17:20
   const [is2FaEnabled, setIs2FaEnabled] = useState(user?.mfaEnabled || false);
   const [setupError, setSetupError] = useState('');
 
-  const userName = user?.name || 'Usuário';
+  const userName = true;
   const userEmail = user?.email || 'usuario@edtech.com';
   const userInitials = userName
killedBy: Settings Page renders the profile and settings sections
statusReason: userName.split is not a function

[Killed] ConditionalExpression
src/pages/settings.tsx:17:20
   const [is2FaEnabled, setIs2FaEnabled] = useState(user?.mfaEnabled || false);
   const [setupError, setSetupError] = useState('');
 
-  const userName = user?.name || 'Usuário';
+  const userName = false;
   const userEmail = user?.email || 'usuario@edtech.com';
   const userInitials = userName
killedBy: Settings Page renders the profile and settings sections
statusReason: userName.split is not a function

[Killed] ConditionalExpression
src/pages/settings.tsx:18:21
   const [setupError, setSetupError] = useState('');
 
   const userName = user?.name || 'Usuário';
-  const userEmail = user?.email || 'usuario@edtech.com';
+  const userEmail = false;
   const userInitials = userName
     .split(' ')
killedBy: Settings Page renders the profile and settings sections
statusReason: Unable to find an element with the text: joao@edtech.com. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] LogicalOperator
src/pages/settings.tsx:18:21
   const [setupError, setSetupError] = useState('');
 
   const userName = user?.name || 'Usuário';
-  const userEmail = user?.email || 'usuario@edtech.com';
+  const userEmail = user?.email && 'usuario@edtech.com';
   const userInitials = userName
     .split(' ')
killedBy: Settings Page renders the profile and settings sections
statusReason: Unable to find an element with the text: joao@edtech.com. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] MethodExpression
src/pages/settings.tsx:19:24
 
   const userName = user?.name || 'Usuário';
   const userEmail = user?.email || 'usuario@edtech.com';
-  const userInitials = userName
-    .split(' ')
-    .map((n: string) => n[0])
-    .join('')
-    .substring(0, 2)
-    .toUpperCase();
+  const userInitials = userName.split(' ').map((n: string) => n[0]).join('').substring(0, 2).toLowerCase();
 
   const handleSetup2Fa = async () => {
killedBy: Settings Page renders the profile and settings sections
statusReason: Unable to find an element with the text: JS. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] MethodExpression
src/pages/settings.tsx:19:24
 
   const userName = user?.name || 'Usuário';
   const userEmail = user?.email || 'usuario@edtech.com';
-  const userInitials = userName
-    .split(' ')
-    .map((n: string) => n[0])
-    .join('')
-    .substring(0, 2)
+  const userInitials = userName.split(' ').map((n: string) => n[0]).join('')
     .toUpperCase();
 

[Killed] ArrowFunction
src/pages/settings.tsx:21:10
   const userEmail = user?.email || 'usuario@edtech.com';
   const userInitials = userName
     .split(' ')
-    .map((n: string) => n[0])
+    .map(() => undefined)
     .join('')
     .substring(0, 2)
killedBy: Settings Page renders the profile and settings sections
statusReason: Unable to find an element with the text: JS. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] StringLiteral
src/pages/settings.tsx:22:11
   const userInitials = userName
     .split(' ')
     .map((n: string) => n[0])
-    .join('')
+    .join("Stryker was here!")
     .substring(0, 2)
     .toUpperCase();

[Killed] BlockStatement
src/pages/settings.tsx:26:38
     .substring(0, 2)
     .toUpperCase();
 
-  const handleSetup2Fa = async () => {
-    setSetupError('');
-    const res = await setup2Fa();
-    if (res.sucesso && res.dados) {
-      setQrCodeUri(res.dados.qrCodeUri);
-    } else {
-      setSetupError(res.mensagem || 'Erro ao gerar QR Code');
-    }
-  };
+  const handleSetup2Fa = async () => {};
 
   const handleEnable2Fa = async () => {
killedBy: Settings Page handles 2FA setup success
statusReason: Unable to find an element with the alt text: QR Code 2FA

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/settings.tsx:29:9
   const handleSetup2Fa = async () => {
     setSetupError('');
     const res = await setup2Fa();
-    if (res.sucesso && res.dados) {
+    if (false) {
       setQrCodeUri(res.dados.qrCodeUri);
     } else {
killedBy: Settings Page handles 2FA setup success
statusReason: Unable to find an element with the alt text: QR Code 2FA

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/settings.tsx:29:35
   const handleSetup2Fa = async () => {
     setSetupError('');
     const res = await setup2Fa();
-    if (res.sucesso && res.dados) {
-      setQrCodeUri(res.dados.qrCodeUri);
-    } else {
+    if (res.sucesso && res.dados) {} else {
       setSetupError(res.mensagem || 'Erro ao gerar QR Code');
     }
killedBy: Settings Page handles 2FA setup success
statusReason: Unable to find an element with the alt text: QR Code 2FA

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] BlockStatement
src/pages/settings.tsx:31:12
     const res = await setup2Fa();
     if (res.sucesso && res.dados) {
       setQrCodeUri(res.dados.qrCodeUri);
-    } else {
-      setSetupError(res.mensagem || 'Erro ao gerar QR Code');
-    }
+    } else {}
   };
 

[Survived] LogicalOperator
src/pages/settings.tsx:32:21
     if (res.sucesso && res.dados) {
       setQrCodeUri(res.dados.qrCodeUri);
     } else {
-      setSetupError(res.mensagem || 'Erro ao gerar QR Code');
+      setSetupError(res.mensagem && 'Erro ao gerar QR Code');
     }
   };

[Survived] ConditionalExpression
src/pages/settings.tsx:32:21
     if (res.sucesso && res.dados) {
       setQrCodeUri(res.dados.qrCodeUri);
     } else {
-      setSetupError(res.mensagem || 'Erro ao gerar QR Code');
+      setSetupError(false);
     }
   };

[Killed] BlockStatement
src/pages/settings.tsx:36:39
     }
   };
 
-  const handleEnable2Fa = async () => {
-    setSetupError('');
-    const res = await enable2Fa(totpCode);
-    if (res.sucesso) {
-      setIs2FaEnabled(true);
-      setQrCodeUri(null);
-      setTotpCode('');
-    } else {
-      setSetupError(res.mensagem || 'Código inválido');
-    }
-  };
+  const handleEnable2Fa = async () => {};
 
   return (
killedBy: Settings Page handles 2FA enable success
statusReason: Unable to find an element with the text: Ativado. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/settings.tsx:39:22
   const handleEnable2Fa = async () => {
     setSetupError('');
     const res = await enable2Fa(totpCode);
-    if (res.sucesso) {
-      setIs2FaEnabled(true);
-      setQrCodeUri(null);
-      setTotpCode('');
-    } else {
+    if (res.sucesso) {} else {
       setSetupError(res.mensagem || 'Código inválido');
     }
killedBy: Settings Page handles 2FA enable success
statusReason: Unable to find an element with the text: Ativado. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/settings.tsx:39:9
   const handleEnable2Fa = async () => {
     setSetupError('');
     const res = await enable2Fa(totpCode);
-    if (res.sucesso) {
+    if (true) {
       setIs2FaEnabled(true);
       setQrCodeUri(null);
killedBy: Settings Page handles 2FA enable error
statusReason: Unable to find an element with the text: Invalid code. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BooleanLiteral
src/pages/settings.tsx:40:23
     setSetupError('');
     const res = await enable2Fa(totpCode);
     if (res.sucesso) {
-      setIs2FaEnabled(true);
+      setIs2FaEnabled(false);
       setQrCodeUri(null);
       setTotpCode('');
killedBy: Settings Page handles 2FA enable success
statusReason: Unable to find an element with the text: Ativado. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/settings.tsx:43:12
       setIs2FaEnabled(true);
       setQrCodeUri(null);
       setTotpCode('');
-    } else {
-      setSetupError(res.mensagem || 'Código inválido');
-    }
+    } else {}
   };
 
killedBy: Settings Page handles 2FA enable error
statusReason: Unable to find an element with the text: Invalid code. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/settings.tsx:44:21
       setQrCodeUri(null);
       setTotpCode('');
     } else {
-      setSetupError(res.mensagem || 'Código inválido');
+      setSetupError(false);
     }
   };
killedBy: Settings Page handles 2FA enable error
statusReason: Unable to find an element with the text: Invalid code. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/settings.tsx:44:21
       setQrCodeUri(null);
       setTotpCode('');
     } else {
-      setSetupError(res.mensagem || 'Código inválido');
+      setSetupError(true);
     }
   };
killedBy: Settings Page handles 2FA enable error
statusReason: Unable to find an element with the text: Invalid code. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ArrowFunction
src/pages/settings.tsx:90:29
                 <input
                   type="checkbox"
                   checked={reviewEmails}
-                  onChange={(e) => setReviewEmails(e.target.checked)}
+                  onChange={() => undefined}
                 />
                 <span className="ed-slider"></span>
killedBy: Settings Page toggles review emails and strict lgpd
statusReason: expect(element).not.toBeChecked()

Received element is checked:
  <input
  checked=""
  type="checkbox"
/>

[Killed] EqualityOperator
src/pages/settings.tsx:133:84
               {is2FaEnabled ? (
                 <span className="settings-badge-active">Ativado</span>
               ) : (
-                <button className="btn-primary" onClick={handleSetup2Fa} disabled={qrCodeUri !== null}>
+                <button className="btn-primary" onClick={handleSetup2Fa} disabled={qrCodeUri === null}>
                   Configurar 2FA
                 </button>
killedBy: Settings Page handles 2FA setup success
statusReason: Unable to find an element with the alt text: QR Code 2FA

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/settings.tsx:133:84
               {is2FaEnabled ? (
                 <span className="settings-badge-active">Ativado</span>
               ) : (
-                <button className="btn-primary" onClick={handleSetup2Fa} disabled={qrCodeUri !== null}>
+                <button className="btn-primary" onClick={handleSetup2Fa} disabled={true}>
                   Configurar 2FA
                 </button>
killedBy: Settings Page handles 2FA setup success
statusReason: Unable to find an element with the alt text: QR Code 2FA

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BooleanLiteral
src/pages/settings.tsx:140:25
             </div>
           </div>
 
-          {qrCodeUri && !is2FaEnabled && (
+          {qrCodeUri && is2FaEnabled && (
             <div className="settings-item no-border" style={{ flexDirection: 'column', alignItems: 'flex-start' }}>
               <div style={{ marginTop: '1rem', padding: '1rem', border: '1px solid #ddd', borderRadius: '8px', width: '100%', display: 'flex', flexDirection: 'column', alignItems: 'center' }}>
killedBy: Settings Page handles 2FA setup success
statusReason: Unable to find an element with the alt text: QR Code 2FA

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/settings.tsx:140:12
             </div>
           </div>
 
-          {qrCodeUri && !is2FaEnabled && (
+          {true && (
             <div className="settings-item no-border" style={{ flexDirection: 'column', alignItems: 'flex-start' }}>
               <div style={{ marginTop: '1rem', padding: '1rem', border: '1px solid #ddd', borderRadius: '8px', width: '100%', display: 'flex', flexDirection: 'column', alignItems: 'center' }}>
killedBy: Settings Page handles 2FA enable success
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <img
  alt="QR Code 2FA"
  style="width: 200px; height: 200px; margin-bottom: 1rem;"
/> instead

Ignored nodes: comments, script, style

[Survived] ObjectLiteral
src/pages/settings.tsx:141:61
           </div>
 
           {qrCodeUri && !is2FaEnabled && (
-            <div className="settings-item no-border" style={{ flexDirection: 'column', alignItems: 'flex-start' }}>
+            <div className="settings-item no-border" style={{}}>
               <div style={{ marginTop: '1rem', padding: '1rem', border: '1px solid #ddd', borderRadius: '8px', width: '100%', display: 'flex', flexDirection: 'column', alignItems: 'center' }}>
                 <p style={{ marginBottom: '1rem', fontWeight: 500 }}>

[Survived] StringLiteral
src/pages/settings.tsx:141:100
           </div>
 
           {qrCodeUri && !is2FaEnabled && (
-            <div className="settings-item no-border" style={{ flexDirection: 'column', alignItems: 'flex-start' }}>
+            <div className="settings-item no-border" style={{ flexDirection: 'column', alignItems: "" }}>
               <div style={{ marginTop: '1rem', padding: '1rem', border: '1px solid #ddd', borderRadius: '8px', width: '100%', display: 'flex', flexDirection: 'column', alignItems: 'center' }}>
                 <p style={{ marginBottom: '1rem', fontWeight: 500 }}>

[Survived] StringLiteral
src/pages/settings.tsx:142:57
 
           {qrCodeUri && !is2FaEnabled && (
             <div className="settings-item no-border" style={{ flexDirection: 'column', alignItems: 'flex-start' }}>
-              <div style={{ marginTop: '1rem', padding: '1rem', border: '1px solid #ddd', borderRadius: '8px', width: '100%', display: 'flex', flexDirection: 'column', alignItems: 'center' }}>
+              <div style={{ marginTop: '1rem', padding: "", border: '1px solid #ddd', borderRadius: '8px', width: '100%', display: 'flex', flexDirection: 'column', alignItems: 'center' }}>
                 <p style={{ marginBottom: '1rem', fontWeight: 500 }}>
                   1. Escaneie este QR Code no seu aplicativo Autenticador

[Survived] StringLiteral
src/pages/settings.tsx:142:159
 
           {qrCodeUri && !is2FaEnabled && (
             <div className="settings-item no-border" style={{ flexDirection: 'column', alignItems: 'flex-start' }}>
-              <div style={{ marginTop: '1rem', padding: '1rem', border: '1px solid #ddd', borderRadius: '8px', width: '100%', display: 'flex', flexDirection: 'column', alignItems: 'center' }}>
+              <div style={{ marginTop: '1rem', padding: '1rem', border: '1px solid #ddd', borderRadius: '8px', width: '100%', display: 'flex', flexDirection: "", alignItems: 'center' }}>
                 <p style={{ marginBottom: '1rem', fontWeight: 500 }}>
                   1. Escaneie este QR Code no seu aplicativo Autenticador

[Survived] ObjectLiteral
src/pages/settings.tsx:143:27
           {qrCodeUri && !is2FaEnabled && (
             <div className="settings-item no-border" style={{ flexDirection: 'column', alignItems: 'flex-start' }}>
               <div style={{ marginTop: '1rem', padding: '1rem', border: '1px solid #ddd', borderRadius: '8px', width: '100%', display: 'flex', flexDirection: 'column', alignItems: 'center' }}>
-                <p style={{ marginBottom: '1rem', fontWeight: 500 }}>
+                <p style={{}}>
                   1. Escaneie este QR Code no seu aplicativo Autenticador
                 </p>

[Survived] StringLiteral
src/pages/settings.tsx:151:70
                 <p style={{ marginBottom: '1rem', fontWeight: 500 }}>
                   2. Insira o código de 6 dígitos gerado
                 </p>
-                <div style={{ display: 'flex', gap: '0.5rem', width: '100%', maxWidth: '300px' }}>
+                <div style={{ display: 'flex', gap: '0.5rem', width: "", maxWidth: '300px' }}>
                   <input
                     type="text"

[Killed] ArrowFunction
src/pages/settings.tsx:158:31
                     placeholder="000000"
                     maxLength={6}
                     value={totpCode}
-                    onChange={(e) => setTotpCode(e.target.value.replace(/\D/g, ''))}
+                    onChange={() => undefined}
                   />
                   <button className="btn-primary" onClick={handleEnable2Fa} disabled={totpCode.length !== 6}>
killedBy: Settings Page handles 2FA enable success
statusReason: Unable to find an element with the text: Ativado. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] EqualityOperator
src/pages/settings.tsx:160:87
                     value={totpCode}
                     onChange={(e) => setTotpCode(e.target.value.replace(/\D/g, ''))}
                   />
-                  <button className="btn-primary" onClick={handleEnable2Fa} disabled={totpCode.length !== 6}>
+                  <button className="btn-primary" onClick={handleEnable2Fa} disabled={totpCode.length === 6}>
                     Ativar
                   </button>
killedBy: Settings Page handles 2FA enable success
statusReason: Unable to find an element with the text: Ativado. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/settings.tsx:160:87
                     value={totpCode}
                     onChange={(e) => setTotpCode(e.target.value.replace(/\D/g, ''))}
                   />
-                  <button className="btn-primary" onClick={handleEnable2Fa} disabled={totpCode.length !== 6}>
+                  <button className="btn-primary" onClick={handleEnable2Fa} disabled={true}>
                     Ativar
                   </button>
killedBy: Settings Page handles 2FA enable success
statusReason: Unable to find an element with the text: Ativado. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/settings.tsx:164:18
                     Ativar
                   </button>
                 </div>
-                {setupError && <p style={{ color: '#d32f2f', marginTop: '0.5rem', fontSize: '0.875rem' }}>{setupError}</p>}
+                {false}
               </div>
             </div>
killedBy: Settings Page handles 2FA enable error
statusReason: Unable to find an element with the text: Invalid code. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/settings.tsx:164:18
                     Ativar
                   </button>
                 </div>
-                {setupError && <p style={{ color: '#d32f2f', marginTop: '0.5rem', fontSize: '0.875rem' }}>{setupError}</p>}
+                {true}
               </div>
             </div>
killedBy: Settings Page handles 2FA enable error
statusReason: Unable to find an element with the text: Invalid code. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ArrowFunction
src/pages/settings.tsx:189:29
                 <input
                   type="checkbox"
                   checked={strictLgpd}
-                  onChange={(e) => setStrictLgpd(e.target.checked)}
+                  onChange={() => undefined}
                 />
                 <span className="ed-slider"></span>
killedBy: Settings Page toggles review emails and strict lgpd
statusReason: expect(element).not.toBeChecked()

Received element is checked:
  <input
  checked=""
  type="checkbox"
/>
