[Killed] ArrayDeclaration
src/pages/submissions.tsx:10:53
 
 export default function Submissions() {
   const { user: _user } = useAuth();
-  const [documents, setDocuments] = useState<any[]>([]);
+  const [documents, setDocuments] = useState<any[]>(["Stryker was here"]);
   const [_stats, setStats] = useState<any>(null);
   
killedBy: Submissions Page handles empty document list
statusReason: Unable to find an element with the text: Nenhuma submissão pendente no momento.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] StringLiteral
src/pages/submissions.tsx:15:56
   
   // Modals state
   const [selectedDoc, setSelectedDoc] = useState<any>(null);
-  const [previewUrl, setPreviewUrl] = useState<string>('');
+  const [previewUrl, setPreviewUrl] = useState<string>("Stryker was here!");
   const [showAnalysisModal, setShowAnalysisModal] = useState(false);
   const [showRejectionModal, setShowRejectionModal] = useState(false);

[Survived] BooleanLiteral
src/pages/submissions.tsx:16:62
   // Modals state
   const [selectedDoc, setSelectedDoc] = useState<any>(null);
   const [previewUrl, setPreviewUrl] = useState<string>('');
-  const [showAnalysisModal, setShowAnalysisModal] = useState(false);
+  const [showAnalysisModal, setShowAnalysisModal] = useState(true);
   const [showRejectionModal, setShowRejectionModal] = useState(false);
   const [rejectionFeedback, setRejectionFeedback] = useState('');

[Survived] BooleanLiteral
src/pages/submissions.tsx:17:64
   const [selectedDoc, setSelectedDoc] = useState<any>(null);
   const [previewUrl, setPreviewUrl] = useState<string>('');
   const [showAnalysisModal, setShowAnalysisModal] = useState(false);
-  const [showRejectionModal, setShowRejectionModal] = useState(false);
+  const [showRejectionModal, setShowRejectionModal] = useState(true);
   const [rejectionFeedback, setRejectionFeedback] = useState('');
 

[Killed] BlockStatement
src/pages/submissions.tsx:20:32
   const [showRejectionModal, setShowRejectionModal] = useState(false);
   const [rejectionFeedback, setRejectionFeedback] = useState('');
 
-  const loadData = async () => {
-    try {
-      const statsResponse = await getDashboardStats();
-      setStats(statsResponse);
-
-      // Fetch pending documents (we pass status='PENDING_REVIEW' directly if API supports it, 
-      // or we just fetch and filter locally depending on the implementation)
-      const docsResponse = await getDocuments(undefined, undefined, 'PENDING_REVIEW');
-      if (docsResponse.sucesso) {
-        setDocuments(docsResponse.dados.content || []);
-      }
-    } catch (error) {
-      console.error('Failed to load data', error);
-    }
-  };
+  const loadData = async () => {};
 
   useEffect(() => {
killedBy: Submissions Page renders documents and stats
statusReason: Unable to find an element with the text: Doc 1.pdf. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/submissions.tsx:21:9
   const [rejectionFeedback, setRejectionFeedback] = useState('');
 
   const loadData = async () => {
-    try {
-      const statsResponse = await getDashboardStats();
-      setStats(statsResponse);
-
-      // Fetch pending documents (we pass status='PENDING_REVIEW' directly if API supports it, 
-      // or we just fetch and filter locally depending on the implementation)
-      const docsResponse = await getDocuments(undefined, undefined, 'PENDING_REVIEW');
-      if (docsResponse.sucesso) {
-        setDocuments(docsResponse.dados.content || []);
-      }
-    } catch (error) {
+    try {} catch (error) {
       console.error('Failed to load data', error);
     }
killedBy: Submissions Page renders documents and stats
statusReason: Unable to find an element with the text: Doc 1.pdf. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/submissions.tsx:28:11
       // Fetch pending documents (we pass status='PENDING_REVIEW' directly if API supports it, 
       // or we just fetch and filter locally depending on the implementation)
       const docsResponse = await getDocuments(undefined, undefined, 'PENDING_REVIEW');
-      if (docsResponse.sucesso) {
+      if (false) {
         setDocuments(docsResponse.dados.content || []);
       }
killedBy: Submissions Page renders documents and stats
statusReason: Unable to find an element with the text: Doc 1.pdf. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/submissions.tsx:28:33
       // Fetch pending documents (we pass status='PENDING_REVIEW' directly if API supports it, 
       // or we just fetch and filter locally depending on the implementation)
       const docsResponse = await getDocuments(undefined, undefined, 'PENDING_REVIEW');
-      if (docsResponse.sucesso) {
-        setDocuments(docsResponse.dados.content || []);
-      }
+      if (docsResponse.sucesso) {}
     } catch (error) {
       console.error('Failed to load data', error);
killedBy: Submissions Page renders documents and stats
statusReason: Unable to find an element with the text: Doc 1.pdf. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/submissions.tsx:29:22
       // or we just fetch and filter locally depending on the implementation)
       const docsResponse = await getDocuments(undefined, undefined, 'PENDING_REVIEW');
       if (docsResponse.sucesso) {
-        setDocuments(docsResponse.dados.content || []);
+        setDocuments(false);
       }
     } catch (error) {
killedBy: Submissions Page renders documents and stats
statusReason: Unable to find an element with the text: Doc 1.pdf. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/pages/submissions.tsx:29:22
       // or we just fetch and filter locally depending on the implementation)
       const docsResponse = await getDocuments(undefined, undefined, 'PENDING_REVIEW');
       if (docsResponse.sucesso) {
-        setDocuments(docsResponse.dados.content || []);
+        setDocuments(true);
       }
     } catch (error) {
killedBy: Submissions Page renders documents and stats
statusReason: Unable to find an element with the text: Doc 1.pdf. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BlockStatement
src/pages/submissions.tsx:31:21
       if (docsResponse.sucesso) {
         setDocuments(docsResponse.dados.content || []);
       }
-    } catch (error) {
-      console.error('Failed to load data', error);
-    }
+    } catch (error) {}
   };
 
killedBy: Submissions Page handles API errors during load gracefully
statusReason: expected "error" to be called with arguments: [ 'Failed to load data', Any<Error> ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
src/pages/submissions.tsx:36:19
     }
   };
 
-  useEffect(() => {
-    loadData();
-  }, []);
+  useEffect(() => {}, []);
 
   const handleApprove = async (docParam?: any) => {
killedBy: Submissions Page renders documents and stats
statusReason: Unable to find an element with the text: Doc 1.pdf. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/submissions.tsx:40:51
     loadData();
   }, []);
 
-  const handleApprove = async (docParam?: any) => {
-    const targetDoc = docParam?.id ? docParam : selectedDoc;
-    if (!targetDoc) return;
-    const response = await reviewDocument(targetDoc.id, 'APPROVED');
-    if (response.sucesso) {
-      setShowAnalysisModal(false);
-      setSelectedDoc(null);
-      loadData();
-    } else {
-      alert('Erro ao aprovar documento: ' + response.mensagem);
-    }
-  };
+  const handleApprove = async (docParam?: any) => {};
 
   const handleReject = async () => {
killedBy: Submissions Page approves document from analysis modal
statusReason: expected "vi.fn()" to be called with arguments: [ '1', 'APPROVED' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Survived] OptionalChaining
src/pages/submissions.tsx:41:23
   }, []);
 
   const handleApprove = async (docParam?: any) => {
-    const targetDoc = docParam?.id ? docParam : selectedDoc;
+    const targetDoc = docParam.id ? docParam : selectedDoc;
     if (!targetDoc) return;
     const response = await reviewDocument(targetDoc.id, 'APPROVED');

[Killed] ConditionalExpression
src/pages/submissions.tsx:42:9
 
   const handleApprove = async (docParam?: any) => {
     const targetDoc = docParam?.id ? docParam : selectedDoc;
-    if (!targetDoc) return;
+    if (true) return;
     const response = await reviewDocument(targetDoc.id, 'APPROVED');
     if (response.sucesso) {
killedBy: Submissions Page approves document from analysis modal
statusReason: expected "vi.fn()" to be called with arguments: [ '1', 'APPROVED' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BooleanLiteral
src/pages/submissions.tsx:42:9
 
   const handleApprove = async (docParam?: any) => {
     const targetDoc = docParam?.id ? docParam : selectedDoc;
-    if (!targetDoc) return;
+    if (targetDoc) return;
     const response = await reviewDocument(targetDoc.id, 'APPROVED');
     if (response.sucesso) {
killedBy: Submissions Page approves document from analysis modal
statusReason: expected "vi.fn()" to be called with arguments: [ '1', 'APPROVED' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
src/pages/submissions.tsx:44:9
     const targetDoc = docParam?.id ? docParam : selectedDoc;
     if (!targetDoc) return;
     const response = await reviewDocument(targetDoc.id, 'APPROVED');
-    if (response.sucesso) {
+    if (false) {
       setShowAnalysisModal(false);
       setSelectedDoc(null);
killedBy: Submissions Page approves document from analysis modal
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/pages/submissions.tsx:44:27
     const targetDoc = docParam?.id ? docParam : selectedDoc;
     if (!targetDoc) return;
     const response = await reviewDocument(targetDoc.id, 'APPROVED');
-    if (response.sucesso) {
-      setShowAnalysisModal(false);
-      setSelectedDoc(null);
-      loadData();
-    } else {
+    if (response.sucesso) {} else {
       alert('Erro ao aprovar documento: ' + response.mensagem);
     }
killedBy: Submissions Page approves document from analysis modal
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Survived] BooleanLiteral
src/pages/submissions.tsx:45:28
     if (!targetDoc) return;
     const response = await reviewDocument(targetDoc.id, 'APPROVED');
     if (response.sucesso) {
-      setShowAnalysisModal(false);
+      setShowAnalysisModal(true);
       setSelectedDoc(null);
       loadData();

[Killed] BlockStatement
src/pages/submissions.tsx:48:12
       setShowAnalysisModal(false);
       setSelectedDoc(null);
       loadData();
-    } else {
-      alert('Erro ao aprovar documento: ' + response.mensagem);
-    }
+    } else {}
   };
 
killedBy: Submissions Page handles approve document error
statusReason: expected "bound " to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
src/pages/submissions.tsx:53:36
     }
   };
 
-  const handleReject = async () => {
-    if (!selectedDoc || !rejectionFeedback.trim()) return;
-    const response = await reviewDocument(selectedDoc.id, 'REJECTED', rejectionFeedback);
-    if (response.sucesso) {
-      setShowRejectionModal(false);
-      setRejectionFeedback('');
-      setSelectedDoc(null);
-      loadData();
-    } else {
-      alert('Erro ao rejeitar documento: ' + response.mensagem);
-    }
-  };
+  const handleReject = async () => {};
 
   const openRejectionModal = (doc: any) => {
killedBy: Submissions Page rejects document from analysis modal
statusReason: expected "vi.fn()" to be called with arguments: [ '1', 'REJECTED', 'Needs work' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
src/pages/submissions.tsx:54:9
   };
 
   const handleReject = async () => {
-    if (!selectedDoc || !rejectionFeedback.trim()) return;
+    if (true) return;
     const response = await reviewDocument(selectedDoc.id, 'REJECTED', rejectionFeedback);
     if (response.sucesso) {
killedBy: Submissions Page rejects document from analysis modal
statusReason: expected "vi.fn()" to be called with arguments: [ '1', 'REJECTED', 'Needs work' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
src/pages/submissions.tsx:54:9
   };
 
   const handleReject = async () => {
-    if (!selectedDoc || !rejectionFeedback.trim()) return;
+    if (false) return;
     const response = await reviewDocument(selectedDoc.id, 'REJECTED', rejectionFeedback);
     if (response.sucesso) {
killedBy: Submissions Page rejects document directly from list
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "1",

[Killed] StringLiteral
src/pages/submissions.tsx:55:59
 
   const handleReject = async () => {
     if (!selectedDoc || !rejectionFeedback.trim()) return;
-    const response = await reviewDocument(selectedDoc.id, 'REJECTED', rejectionFeedback);
+    const response = await reviewDocument(selectedDoc.id, "", rejectionFeedback);
     if (response.sucesso) {
       setShowRejectionModal(false);
killedBy: Submissions Page rejects document from analysis modal
statusReason: expected "vi.fn()" to be called with arguments: [ '1', 'REJECTED', 'Needs work' ]

Received:

  1st vi.fn() call:

  [
    "1",

[Killed] ConditionalExpression
src/pages/submissions.tsx:56:9
   const handleReject = async () => {
     if (!selectedDoc || !rejectionFeedback.trim()) return;
     const response = await reviewDocument(selectedDoc.id, 'REJECTED', rejectionFeedback);
-    if (response.sucesso) {
+    if (true) {
       setShowRejectionModal(false);
       setRejectionFeedback('');
killedBy: Submissions Page handles reject document error
statusReason: expected "bound " to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Survived] BlockStatement
src/pages/submissions.tsx:56:27
   const handleReject = async () => {
     if (!selectedDoc || !rejectionFeedback.trim()) return;
     const response = await reviewDocument(selectedDoc.id, 'REJECTED', rejectionFeedback);
-    if (response.sucesso) {
-      setShowRejectionModal(false);
-      setRejectionFeedback('');
-      setSelectedDoc(null);
-      loadData();
-    } else {
+    if (response.sucesso) {} else {
       alert('Erro ao rejeitar documento: ' + response.mensagem);
     }

[Survived] BooleanLiteral
src/pages/submissions.tsx:57:29
     if (!selectedDoc || !rejectionFeedback.trim()) return;
     const response = await reviewDocument(selectedDoc.id, 'REJECTED', rejectionFeedback);
     if (response.sucesso) {
-      setShowRejectionModal(false);
+      setShowRejectionModal(true);
       setRejectionFeedback('');
       setSelectedDoc(null);

[Survived] StringLiteral
src/pages/submissions.tsx:58:28
     const response = await reviewDocument(selectedDoc.id, 'REJECTED', rejectionFeedback);
     if (response.sucesso) {
       setShowRejectionModal(false);
-      setRejectionFeedback('');
+      setRejectionFeedback("Stryker was here!");
       setSelectedDoc(null);
       loadData();

[Killed] BlockStatement
src/pages/submissions.tsx:61:12
       setRejectionFeedback('');
       setSelectedDoc(null);
       loadData();
-    } else {
-      alert('Erro ao rejeitar documento: ' + response.mensagem);
-    }
+    } else {}
   };
 
killedBy: Submissions Page handles reject document error
statusReason: expected "bound " to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
src/pages/submissions.tsx:66:44
     }
   };
 
-  const openRejectionModal = (doc: any) => {
-    setSelectedDoc(doc);
-    setShowAnalysisModal(false);
-    setShowRejectionModal(true);
-  };
+  const openRejectionModal = (doc: any) => {};
 
   const handleAnalyze = async (doc: any) => {
killedBy: Submissions Page rejects document from analysis modal
statusReason: Unable to find an element with the text: Confirmar Rejeição. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] BooleanLiteral
src/pages/submissions.tsx:68:26
 
   const openRejectionModal = (doc: any) => {
     setSelectedDoc(doc);
-    setShowAnalysisModal(false);
+    setShowAnalysisModal(true);
     setShowRejectionModal(true);
   };

[Killed] BooleanLiteral
src/pages/submissions.tsx:69:27
   const openRejectionModal = (doc: any) => {
     setSelectedDoc(doc);
     setShowAnalysisModal(false);
-    setShowRejectionModal(true);
+    setShowRejectionModal(false);
   };
 
killedBy: Submissions Page rejects document from analysis modal
statusReason: Unable to find an element with the text: Confirmar Rejeição. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/submissions.tsx:72:45
     setShowRejectionModal(true);
   };
 
-  const handleAnalyze = async (doc: any) => {
-    setSelectedDoc(doc);
-    setPreviewUrl('');
-    setShowAnalysisModal(true);
-    
-    // Fetch the download URL (presigned GCS URL) to preview
-    import('../services/api').then(async ({ getDownloadUrl }) => {
-      const resp = await getDownloadUrl(doc.id);
-      if (resp.sucesso) {
-        setPreviewUrl(resp.dados.downloadUrl);
-      }
-    });
-  };
+  const handleAnalyze = async (doc: any) => {};
 
   const formatSize = (_url: string) => {
killedBy: Submissions Page opens and closes analysis modal with PDF
statusReason: Unable to find an element with the text: /Carregando visualização/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BooleanLiteral
src/pages/submissions.tsx:75:26
   const handleAnalyze = async (doc: any) => {
     setSelectedDoc(doc);
     setPreviewUrl('');
-    setShowAnalysisModal(true);
+    setShowAnalysisModal(false);
     
     // Fetch the download URL (presigned GCS URL) to preview
killedBy: Submissions Page opens and closes analysis modal with PDF
statusReason: Unable to find an element with the text: /Carregando visualização/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/submissions.tsx:78:66
     setShowAnalysisModal(true);
     
     // Fetch the download URL (presigned GCS URL) to preview
-    import('../services/api').then(async ({ getDownloadUrl }) => {
-      const resp = await getDownloadUrl(doc.id);
-      if (resp.sucesso) {
-        setPreviewUrl(resp.dados.downloadUrl);
-      }
-    });
+    import('../services/api').then(async ({ getDownloadUrl }) => {});
   };
 
killedBy: Submissions Page opens and closes analysis modal with PDF
statusReason: expect(received).toHaveAttribute()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
src/pages/submissions.tsx:80:25
     // Fetch the download URL (presigned GCS URL) to preview
     import('../services/api').then(async ({ getDownloadUrl }) => {
       const resp = await getDownloadUrl(doc.id);
-      if (resp.sucesso) {
-        setPreviewUrl(resp.dados.downloadUrl);
-      }
+      if (resp.sucesso) {}
     });
   };
killedBy: Submissions Page opens and closes analysis modal with PDF
statusReason: expect(received).toHaveAttribute()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

Ignored nodes: comments, script, style
<html>

[Killed] ConditionalExpression
src/pages/submissions.tsx:80:11
     // Fetch the download URL (presigned GCS URL) to preview
     import('../services/api').then(async ({ getDownloadUrl }) => {
       const resp = await getDownloadUrl(doc.id);
-      if (resp.sucesso) {
+      if (false) {
         setPreviewUrl(resp.dados.downloadUrl);
       }
killedBy: Submissions Page opens and closes analysis modal with PDF
statusReason: expect(received).toHaveAttribute()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

Ignored nodes: comments, script, style
<html>

[Survived] BlockStatement
src/pages/submissions.tsx:86:40
     });
   };
 
-  const formatSize = (_url: string) => {
-    return '2.4 MB'; // Mock placeholder, since we don't return size from backend yet
-  };
+  const formatSize = (_url: string) => {};
 
   const getInitials = (name: string) => {

[Killed] BlockStatement
src/pages/submissions.tsx:90:41
     return '2.4 MB'; // Mock placeholder, since we don't return size from backend yet
   };
 
-  const getInitials = (name: string) => {
-    if (!name) return '??';
-    return name.split(' ').map((n) => n[0]).join('').substring(0, 2).toUpperCase();
-  };
+  const getInitials = (name: string) => {};
 
   return (
killedBy: Submissions Page renders documents and stats
statusReason: Unable to find an element with the text: AO. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BooleanLiteral
src/pages/submissions.tsx:91:9
   };
 
   const getInitials = (name: string) => {
-    if (!name) return '??';
+    if (name) return '??';
     return name.split(' ').map((n) => n[0]).join('').substring(0, 2).toUpperCase();
   };
killedBy: Submissions Page renders documents and stats
statusReason: Unable to find an element with the text: AO. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/submissions.tsx:91:9
   };
 
   const getInitials = (name: string) => {
-    if (!name) return '??';
+    if (true) return '??';
     return name.split(' ').map((n) => n[0]).join('').substring(0, 2).toUpperCase();
   };
killedBy: Submissions Page renders documents and stats
statusReason: Unable to find an element with the text: AO. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] MethodExpression
src/pages/submissions.tsx:92:12
 
   const getInitials = (name: string) => {
     if (!name) return '??';
-    return name.split(' ').map((n) => n[0]).join('').substring(0, 2).toUpperCase();
+    return name.split(' ').map(n => n[0]).join('').substring(0, 2).toLowerCase();
   };
 
killedBy: Submissions Page renders documents and stats
statusReason: Unable to find an element with the text: AO. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ArrowFunction
src/pages/submissions.tsx:92:32
 
   const getInitials = (name: string) => {
     if (!name) return '??';
-    return name.split(' ').map((n) => n[0]).join('').substring(0, 2).toUpperCase();
+    return name.split(' ').map(() => undefined).join('').substring(0, 2).toUpperCase();
   };
 
killedBy: Submissions Page renders documents and stats
statusReason: Unable to find an element with the text: AO. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] StringLiteral
src/pages/submissions.tsx:99:21
     <DashboardLayout
       title="Painel do Orientador"
       subtitle=""
-      breadcrumbs={['EdTech', 'Painel do Orientador']}
+      breadcrumbs={["", 'Painel do Orientador']}
     >
 

[Survived] StringLiteral
src/pages/submissions.tsx:139:29
         <div className={styles.statCard}>
           <div className={styles.statHeader}>
             <span className={styles.statTitle}>Aprovados este mês</span>
-            <div className={`${styles.statIcon} ${styles.green}`}>
+            <div className={``}>
               <svg width="20" height="20" fill="none" viewBox="0 0 24 24" stroke="currentColor">
                 <path strokeLinecap="round" strokeLinejoin="round" strokeWidth={2} d="M9 12l2 2 4-4m6 2a9 9 0 11-18 0 9 9 0 0118 0z" />

[Killed] ConditionalExpression
src/pages/submissions.tsx:174:87
               <tr key={doc.id}>
                 <td>
                   <div className={styles.researcherCell}>
-                    <div className={`${styles.avatar} ${styles.purple}`}>{getInitials(doc.author?.name || 'User')}</div>
+                    <div className={`${styles.avatar} ${styles.purple}`}>{getInitials(true)}</div>
                     <div className={styles.researcherInfo}>
                       <span className={styles.researcherName}>{doc.author?.name || 'Dr. Pesquisador'}</span>
killedBy: Submissions Page renders documents and stats
statusReason: Unable to find an element with the text: Doc 1.pdf. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/pages/submissions.tsx:174:87
               <tr key={doc.id}>
                 <td>
                   <div className={styles.researcherCell}>
-                    <div className={`${styles.avatar} ${styles.purple}`}>{getInitials(doc.author?.name || 'User')}</div>
+                    <div className={`${styles.avatar} ${styles.purple}`}>{getInitials(false)}</div>
                     <div className={styles.researcherInfo}>
                       <span className={styles.researcherName}>{doc.author?.name || 'Dr. Pesquisador'}</span>
killedBy: Submissions Page renders documents and stats
statusReason: Unable to find an element with the text: AO. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >
