[Killed] LogicalOperator
src/pages/submissions.tsx:176:64
                   <div className={styles.researcherCell}>
                     <div className={`${styles.avatar} ${styles.purple}`}>{getInitials(doc.author?.name || 'User')}</div>
                     <div className={styles.researcherInfo}>
-                      <span className={styles.researcherName}>{doc.author?.name || 'Dr. Pesquisador'}</span>
+                      <span className={styles.researcherName}>{doc.author?.name && 'Dr. Pesquisador'}</span>
                       <span className={styles.researcherEmail}>{doc.author?.email || 'email@usp.br'}</span>
                     </div>
killedBy: Submissions Page renders documents and stats
statusReason: Unable to find an element with the text: Auth One. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/submissions.tsx:176:64
                   <div className={styles.researcherCell}>
                     <div className={`${styles.avatar} ${styles.purple}`}>{getInitials(doc.author?.name || 'User')}</div>
                     <div className={styles.researcherInfo}>
-                      <span className={styles.researcherName}>{doc.author?.name || 'Dr. Pesquisador'}</span>
+                      <span className={styles.researcherName}>{true}</span>
                       <span className={styles.researcherEmail}>{doc.author?.email || 'email@usp.br'}</span>
                     </div>
killedBy: Submissions Page renders documents and stats
statusReason: Unable to find an element with the text: Auth One. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] OptionalChaining
src/pages/submissions.tsx:177:65
                     <div className={`${styles.avatar} ${styles.purple}`}>{getInitials(doc.author?.name || 'User')}</div>
                     <div className={styles.researcherInfo}>
                       <span className={styles.researcherName}>{doc.author?.name || 'Dr. Pesquisador'}</span>
-                      <span className={styles.researcherEmail}>{doc.author?.email || 'email@usp.br'}</span>
+                      <span className={styles.researcherEmail}>{doc.author.email || 'email@usp.br'}</span>
                     </div>
                   </div>

[Survived] LogicalOperator
src/pages/submissions.tsx:177:65
                     <div className={`${styles.avatar} ${styles.purple}`}>{getInitials(doc.author?.name || 'User')}</div>
                     <div className={styles.researcherInfo}>
                       <span className={styles.researcherName}>{doc.author?.name || 'Dr. Pesquisador'}</span>
-                      <span className={styles.researcherEmail}>{doc.author?.email || 'email@usp.br'}</span>
+                      <span className={styles.researcherEmail}>{doc.author?.email && 'email@usp.br'}</span>
                     </div>
                   </div>

[Survived] StringLiteral
src/pages/submissions.tsx:197:36
                 <td className={styles.projectCell}>Análise LGPD</td>
                 <td className={styles.dateCell}>{new Date(doc.createdAt).toLocaleDateString()}</td>
                 <td>
-                  <span className={`${styles.priorityBadge} ${styles.alta}`}>
+                  <span className={``}>
                     <svg width="12" height="12" fill="none" viewBox="0 0 24 24" stroke="currentColor">

[Killed] ArrowFunction
src/pages/submissions.tsx:208:32
                   <div className={styles.actionsCell}>
                     <button 
                       className={styles.btnAnalisar} 
-                      onClick={() => handleAnalyze(doc)}
+                      onClick={() => undefined}
                     >
                       <svg width="16" height="16" fill="none" viewBox="0 0 24 24" stroke="currentColor">
killedBy: Submissions Page opens and closes analysis modal with PDF
statusReason: Unable to find an element with the text: /Carregando visualização/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/submissions.tsx:218:38
                     </button>
                     <button 
                       className={`${styles.btnAction} ${styles.btnApprove}`}
-                      onClick={() => { handleApprove(doc); }}
+                      onClick={() => {}}
                     >
                       <svg width="16" height="16" fill="none" viewBox="0 0 24 24" stroke="currentColor">
killedBy: Submissions Page approves document directly from list
statusReason: expected "vi.fn()" to be called with arguments: [ '1', 'APPROVED' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
src/pages/submissions.tsx:225:34
                       </svg>
                     </button>
                     <button 
-                      className={`${styles.btnAction} ${styles.btnReject}`}
+                      className={``}
                       onClick={() => openRejectionModal(doc)}
                     >
killedBy: Submissions Page rejects document directly from list
statusReason: Unable to fire a "click" event - please provide a DOM element.

[Killed] ArrowFunction
src/pages/submissions.tsx:226:32
                     </button>
                     <button 
                       className={`${styles.btnAction} ${styles.btnReject}`}
-                      onClick={() => openRejectionModal(doc)}
+                      onClick={() => undefined}
                     >
                       <svg width="16" height="16" fill="none" viewBox="0 0 24 24" stroke="currentColor">
killedBy: Submissions Page rejects document directly from list
statusReason: Unable to find an element with the text: Confirmar Rejeição. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/submissions.tsx:236:14
                 </td>
               </tr>
             ))}
-            {documents.length === 0 && (
-              <tr>
-                <td colSpan={6} style={{ textAlign: 'center', padding: '2rem', color: '#64748B' }}>
-                  Nenhuma submissão pendente no momento.
-                </td>
-              </tr>
-            )}
+            {true}
           </tbody>
         </table>
killedBy: Submissions Page handles empty document list
statusReason: Unable to find an element with the text: Nenhuma submissão pendente no momento.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] LogicalOperator
src/pages/submissions.tsx:236:14
                 </td>
               </tr>
             ))}
-            {documents.length === 0 && (
-              <tr>
-                <td colSpan={6} style={{ textAlign: 'center', padding: '2rem', color: '#64748B' }}>
-                  Nenhuma submissão pendente no momento.
-                </td>
-              </tr>
-            )}
+            {documents.length === 0 || <tr>
+                <td colSpan={6} style={{
+    textAlign: 'center',
+    padding: '2rem',
+    color: '#64748B'
+  }}>
+                  Nenhuma submissão pendente no momento.
+                </td>
+              </tr>}
           </tbody>
         </table>
killedBy: Submissions Page handles empty document list
statusReason: Unable to find an element with the text: Nenhuma submissão pendente no momento.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/submissions.tsx:248:8
       </div>
 
       {/* Analysis Modal */}
-      {showAnalysisModal && selectedDoc && (
+      {true && (
         <div className={styles.modalOverlay}>
           <div className={`${styles.modalContent} ${styles.large}`}>
killedBy: Submissions Page renders documents and stats
statusReason: Cannot read properties of null (reading 'title')

[Survived] LogicalOperator
src/pages/submissions.tsx:248:8
       </div>
 
       {/* Analysis Modal */}
-      {showAnalysisModal && selectedDoc && (
+      {showAnalysisModal || selectedDoc && (
         <div className={styles.modalOverlay}>
           <div className={`${styles.modalContent} ${styles.large}`}>

[Survived] StringLiteral
src/pages/submissions.tsx:252:64
         <div className={styles.modalOverlay}>
           <div className={`${styles.modalContent} ${styles.large}`}>
             <div className={styles.modalHeader}>
-              <div className={styles.fileIcon} style={{ width: '48px', height: '48px' }}>
+              <div className={styles.fileIcon} style={{ width: "", height: '48px' }}>
                 <svg width="24" height="24" fill="none" viewBox="0 0 24 24" stroke="currentColor">
                   <path strokeLinecap="round" strokeLinejoin="round" strokeWidth={2} d="M7 21h10a2 2 0 002-2V9.414a1 1 0 00-.293-.707l-5.414-5.414A1 1 0 0012.586 3H7a2 2 0 00-2 2v14a2 2 0 002 2z" />

[Survived] ConditionalExpression
src/pages/submissions.tsx:260:20
               <div style={{ flex: 1 }}>
                 <h3 className={styles.modalTitle}>{selectedDoc.title}</h3>
                 <div className={styles.modalSubtitle}>
-                  {selectedDoc.author?.name || 'Dr. Renata Silva'} • Análise LGPD • 2.4 MB • enviado Hoje
+                  {true} • Análise LGPD • 2.4 MB • enviado Hoje
                 </div>
               </div>

[Survived] ConditionalExpression
src/pages/submissions.tsx:260:20
               <div style={{ flex: 1 }}>
                 <h3 className={styles.modalTitle}>{selectedDoc.title}</h3>
                 <div className={styles.modalSubtitle}>
-                  {selectedDoc.author?.name || 'Dr. Renata Silva'} • Análise LGPD • 2.4 MB • enviado Hoje
+                  {false} • Análise LGPD • 2.4 MB • enviado Hoje
                 </div>
               </div>

[Survived] BooleanLiteral
src/pages/submissions.tsx:263:89
                   {selectedDoc.author?.name || 'Dr. Renata Silva'} • Análise LGPD • 2.4 MB • enviado Hoje
                 </div>
               </div>
-              <button className={styles.modalClose} onClick={() => setShowAnalysisModal(false)}>
+              <button className={styles.modalClose} onClick={() => setShowAnalysisModal(true)}>
                 <svg width="24" height="24" fill="none" viewBox="0 0 24 24" stroke="currentColor">
                   <path strokeLinecap="round" strokeLinejoin="round" strokeWidth={2} d="M6 18L18 6M6 6l12 12" />

[Survived] ArrowFunction
src/pages/submissions.tsx:263:62
                   {selectedDoc.author?.name || 'Dr. Renata Silva'} • Análise LGPD • 2.4 MB • enviado Hoje
                 </div>
               </div>
-              <button className={styles.modalClose} onClick={() => setShowAnalysisModal(false)}>
+              <button className={styles.modalClose} onClick={() => undefined}>
                 <svg width="24" height="24" fill="none" viewBox="0 0 24 24" stroke="currentColor">
                   <path strokeLinecap="round" strokeLinejoin="round" strokeWidth={2} d="M6 18L18 6M6 6l12 12" />

[Survived] StringLiteral
src/pages/submissions.tsx:270:147
               </button>
             </div>
             
-            <div className={styles.documentPreview} style={{ padding: '0', height: '60vh', background: '#e2e8f0', display: 'flex', flexDirection: 'column' }}>
+            <div className={styles.documentPreview} style={{ padding: '0', height: '60vh', background: '#e2e8f0', display: 'flex', flexDirection: "" }}>
               {previewUrl ? (
                 (selectedDoc.type === 'CSV' || selectedDoc.type === 'JSON') ? (

[Killed] LogicalOperator
src/pages/submissions.tsx:272:18
             
             <div className={styles.documentPreview} style={{ padding: '0', height: '60vh', background: '#e2e8f0', display: 'flex', flexDirection: 'column' }}>
               {previewUrl ? (
-                (selectedDoc.type === 'CSV' || selectedDoc.type === 'JSON') ? (
+                (selectedDoc.type === 'CSV' && selectedDoc.type === 'JSON') ? (
                   <DatasetPreview url={previewUrl} type={selectedDoc.type} />
                 ) : (
killedBy: Submissions Page opens analysis modal with DatasetPreview for CSV
statusReason: Unable to find an element by: [data-testid="dataset-preview"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/submissions.tsx:272:18
             
             <div className={styles.documentPreview} style={{ padding: '0', height: '60vh', background: '#e2e8f0', display: 'flex', flexDirection: 'column' }}>
               {previewUrl ? (
-                (selectedDoc.type === 'CSV' || selectedDoc.type === 'JSON') ? (
+                (true) ? (
                   <DatasetPreview url={previewUrl} type={selectedDoc.type} />
                 ) : (
killedBy: Submissions Page opens and closes analysis modal with PDF
statusReason: expect(received).toHaveAttribute()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

Ignored nodes: comments, script, style
<html>

[Survived] StringLiteral
src/pages/submissions.tsx:275:112
                 (selectedDoc.type === 'CSV' || selectedDoc.type === 'JSON') ? (
                   <DatasetPreview url={previewUrl} type={selectedDoc.type} />
                 ) : (
-                  <object data={previewUrl} type="application/pdf" width="100%" height="100%" style={{ border: 'none', flex: 1 }}>
+                  <object data={previewUrl} type="application/pdf" width="100%" height="100%" style={{ border: "", flex: 1 }}>
                     <div style={{ padding: '2rem', textAlign: 'center' }}>
                       Seu navegador não suporta a visualização nativa de PDFs. <br/><br/>

[Survived] ObjectLiteral
src/pages/submissions.tsx:276:33
                   <DatasetPreview url={previewUrl} type={selectedDoc.type} />
                 ) : (
                   <object data={previewUrl} type="application/pdf" width="100%" height="100%" style={{ border: 'none', flex: 1 }}>
-                    <div style={{ padding: '2rem', textAlign: 'center' }}>
+                    <div style={{}}>
                       Seu navegador não suporta a visualização nativa de PDFs. <br/><br/>
                       <a href={previewUrl} target="_blank" rel="noopener noreferrer" style={{ color: 'var(--ed-purple)' }}>Clique aqui para baixar</a>

[Survived] StringLiteral
src/pages/submissions.tsx:276:44
                   <DatasetPreview url={previewUrl} type={selectedDoc.type} />
                 ) : (
                   <object data={previewUrl} type="application/pdf" width="100%" height="100%" style={{ border: 'none', flex: 1 }}>
-                    <div style={{ padding: '2rem', textAlign: 'center' }}>
+                    <div style={{ padding: "", textAlign: 'center' }}>
                       Seu navegador não suporta a visualização nativa de PDFs. <br/><br/>
                       <a href={previewUrl} target="_blank" rel="noopener noreferrer" style={{ color: 'var(--ed-purple)' }}>Clique aqui para baixar</a>

[Survived] StringLiteral
src/pages/submissions.tsx:283:40
                   </object>
                 )
               ) : (
-                <div style={{ padding: '2rem', textAlign: 'center', color: '#64748B', display: 'flex', alignItems: 'center', justifyContent: 'center', height: '100%' }}>
+                <div style={{ padding: "", textAlign: 'center', color: '#64748B', display: 'flex', alignItems: 'center', justifyContent: 'center', height: '100%' }}>
                   Carregando visualização do documento...
                 </div>

[Killed] ArrowFunction
src/pages/submissions.tsx:292:70
             <div className={styles.modalFooter}>
               <span className={styles.modalFooterText}>Revise o conteúdo antes de decidir.</span>
               <div style={{ display: 'flex', gap: '1rem' }}>
-                <button className={styles.btnRejectOutline} onClick={() => openRejectionModal(selectedDoc)}>
+                <button className={styles.btnRejectOutline} onClick={() => undefined}>
                   <svg width="16" height="16" fill="none" viewBox="0 0 24 24" stroke="currentColor" style={{ display: 'inline', marginRight: '0.25rem', verticalAlign: 'text-top' }}>
                     <path strokeLinecap="round" strokeLinejoin="round" strokeWidth={2} d="M6 18L18 6M6 6l12 12" />
killedBy: Submissions Page rejects document from analysis modal
statusReason: Unable to find an element with the text: Confirmar Rejeição. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] StringLiteral
src/pages/submissions.tsx:299:142
                   Rejeitar
                 </button>
                 <button className={styles.btnConfirmApprove} onClick={handleApprove}>
-                  <svg width="16" height="16" fill="none" viewBox="0 0 24 24" stroke="currentColor" style={{ display: 'inline', marginRight: '0.25rem', verticalAlign: 'text-top' }}>
+                  <svg width="16" height="16" fill="none" viewBox="0 0 24 24" stroke="currentColor" style={{ display: 'inline', marginRight: "", verticalAlign: 'text-top' }}>
                     <path strokeLinecap="round" strokeLinejoin="round" strokeWidth={2} d="M5 13l4 4L19 7" />
                   </svg>

[Survived] ObjectLiteral
src/pages/submissions.tsx:299:108
                   Rejeitar
                 </button>
                 <button className={styles.btnConfirmApprove} onClick={handleApprove}>
-                  <svg width="16" height="16" fill="none" viewBox="0 0 24 24" stroke="currentColor" style={{ display: 'inline', marginRight: '0.25rem', verticalAlign: 'text-top' }}>
+                  <svg width="16" height="16" fill="none" viewBox="0 0 24 24" stroke="currentColor" style={{}}>
                     <path strokeLinecap="round" strokeLinejoin="round" strokeWidth={2} d="M5 13l4 4L19 7" />
                   </svg>

[Killed] LogicalOperator
src/pages/submissions.tsx:311:8
       )}
 
       {/* Rejection Modal */}
-      {showRejectionModal && selectedDoc && (
+      {showRejectionModal || selectedDoc && (
         <div className={styles.modalOverlay}>
           <div className={styles.modalContent}>
killedBy: Submissions Page cancels rejection modal
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="_btnCancel_e1e8ec"
>
  Cancelar
</button> instead

[Killed] ConditionalExpression
src/pages/submissions.tsx:311:8
       )}
 
       {/* Rejection Modal */}
-      {showRejectionModal && selectedDoc && (
+      {true && (
         <div className={styles.modalOverlay}>
           <div className={styles.modalContent}>
killedBy: Submissions Page renders documents and stats
statusReason: Cannot read properties of null (reading 'title')

[Killed] ArrowFunction
src/pages/submissions.tsx:330:25
               className={styles.textarea}
               placeholder="Descreva os ajustes necessários ao pesquisador..."
               value={rejectionFeedback}
-              onChange={(e) => setRejectionFeedback(e.target.value)}
+              onChange={() => undefined}
             />
             
killedBy: Submissions Page rejects document from analysis modal
statusReason: expected "vi.fn()" to be called with arguments: [ '1', 'REJECTED', 'Needs work' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BooleanLiteral
src/pages/submissions.tsx:334:89
             />
             
             <div className={styles.modalActions}>
-              <button className={styles.btnCancel} onClick={() => setShowRejectionModal(false)}>
+              <button className={styles.btnCancel} onClick={() => setShowRejectionModal(true)}>
                 Cancelar
               </button>
killedBy: Submissions Page cancels rejection modal
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="_btnCancel_e1e8ec"
>
  Cancelar
</button> instead

[Killed] ArrowFunction
src/pages/submissions.tsx:334:61
             />
             
             <div className={styles.modalActions}>
-              <button className={styles.btnCancel} onClick={() => setShowRejectionModal(false)}>
+              <button className={styles.btnCancel} onClick={() => undefined}>
                 Cancelar
               </button>
killedBy: Submissions Page cancels rejection modal
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="_btnCancel_e1e8ec"
>
  Cancelar
</button> instead
