[NoCoverage] StringLiteral
src/pages/upload.tsx:9:60
 import { Project } from '../types';
 import { useAuth } from '../context/authContext';
 
-const ALLOWED_FILE_TYPES = ['application/pdf', 'text/csv', 'application/json'];
+const ALLOWED_FILE_TYPES = ['application/pdf', 'text/csv', ""];
 const ALLOWED_FILE_EXTENSIONS = ['.pdf', '.csv', '.json'];
 

[NoCoverage] StringLiteral
src/pages/upload.tsx:9:48
 import { Project } from '../types';
 import { useAuth } from '../context/authContext';
 
-const ALLOWED_FILE_TYPES = ['application/pdf', 'text/csv', 'application/json'];
+const ALLOWED_FILE_TYPES = ['application/pdf', "", 'application/json'];
 const ALLOWED_FILE_EXTENSIONS = ['.pdf', '.csv', '.json'];
 

[NoCoverage] StringLiteral
src/pages/upload.tsx:10:50
 import { useAuth } from '../context/authContext';
 
 const ALLOWED_FILE_TYPES = ['application/pdf', 'text/csv', 'application/json'];
-const ALLOWED_FILE_EXTENSIONS = ['.pdf', '.csv', '.json'];
+const ALLOWED_FILE_EXTENSIONS = ['.pdf', '.csv', ""];
 
 const getFileExtension = (filename: string) => {

[Killed] BlockStatement
src/pages/upload.tsx:12:48
 const ALLOWED_FILE_TYPES = ['application/pdf', 'text/csv', 'application/json'];
 const ALLOWED_FILE_EXTENSIONS = ['.pdf', '.csv', '.json'];
 
-const getFileExtension = (filename: string) => {
-  const lastDotIndex = filename.lastIndexOf('.');
-  return lastDotIndex >= 0 ? filename.substring(lastDotIndex).toLowerCase() : '';
-};
+const getFileExtension = (filename: string) => {};
 
 const isAllowedFile = (file: File) => {
killedBy: Upload Page handles valid file drop
statusReason: Unable to find an element with the text: test.pdf. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] StringLiteral
src/pages/upload.tsx:13:45
 const ALLOWED_FILE_EXTENSIONS = ['.pdf', '.csv', '.json'];
 
 const getFileExtension = (filename: string) => {
-  const lastDotIndex = filename.lastIndexOf('.');
+  const lastDotIndex = filename.lastIndexOf("");
   return lastDotIndex >= 0 ? filename.substring(lastDotIndex).toLowerCase() : '';
 };
killedBy: Upload Page handles valid file drop
statusReason: Unable to find an element with the text: test.pdf. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] MethodExpression
src/pages/upload.tsx:14:30
 
 const getFileExtension = (filename: string) => {
   const lastDotIndex = filename.lastIndexOf('.');
-  return lastDotIndex >= 0 ? filename.substring(lastDotIndex).toLowerCase() : '';
+  return lastDotIndex >= 0 ? filename.toLowerCase() : '';
 };
 
killedBy: Upload Page handles valid file drop
statusReason: Unable to find an element with the text: test.pdf. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] EqualityOperator
src/pages/upload.tsx:14:10
 
 const getFileExtension = (filename: string) => {
   const lastDotIndex = filename.lastIndexOf('.');
-  return lastDotIndex >= 0 ? filename.substring(lastDotIndex).toLowerCase() : '';
+  return lastDotIndex < 0 ? filename.substring(lastDotIndex).toLowerCase() : '';
 };
 
killedBy: Upload Page handles valid file drop
statusReason: Unable to find an element with the text: test.pdf. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/upload.tsx:17:39
   return lastDotIndex >= 0 ? filename.substring(lastDotIndex).toLowerCase() : '';
 };
 
-const isAllowedFile = (file: File) => {
-  const extension = getFileExtension(file.name);
-  const hasAllowedExtension = ALLOWED_FILE_EXTENSIONS.includes(extension);
-  const hasAllowedMimeType = !file.type || ALLOWED_FILE_TYPES.includes(file.type);
-  return hasAllowedExtension && hasAllowedMimeType;
-};
+const isAllowedFile = (file: File) => {};
 const Upload: React.FC = () => {
   const navigate = useNavigate();
killedBy: Upload Page handles valid file drop
statusReason: Unable to find an element with the text: test.pdf. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] LogicalOperator
src/pages/upload.tsx:20:30
 const isAllowedFile = (file: File) => {
   const extension = getFileExtension(file.name);
   const hasAllowedExtension = ALLOWED_FILE_EXTENSIONS.includes(extension);
-  const hasAllowedMimeType = !file.type || ALLOWED_FILE_TYPES.includes(file.type);
+  const hasAllowedMimeType = !file.type && ALLOWED_FILE_TYPES.includes(file.type);
   return hasAllowedExtension && hasAllowedMimeType;
 };
killedBy: Upload Page handles valid file drop
statusReason: Unable to find an element with the text: test.pdf. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/upload.tsx:20:30
 const isAllowedFile = (file: File) => {
   const extension = getFileExtension(file.name);
   const hasAllowedExtension = ALLOWED_FILE_EXTENSIONS.includes(extension);
-  const hasAllowedMimeType = !file.type || ALLOWED_FILE_TYPES.includes(file.type);
+  const hasAllowedMimeType = false;
   return hasAllowedExtension && hasAllowedMimeType;
 };
killedBy: Upload Page handles valid file drop
statusReason: Unable to find an element with the text: test.pdf. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/upload.tsx:21:10
   const extension = getFileExtension(file.name);
   const hasAllowedExtension = ALLOWED_FILE_EXTENSIONS.includes(extension);
   const hasAllowedMimeType = !file.type || ALLOWED_FILE_TYPES.includes(file.type);
-  return hasAllowedExtension && hasAllowedMimeType;
+  return false;
 };
 const Upload: React.FC = () => {
killedBy: Upload Page handles valid file drop
statusReason: Unable to find an element with the text: test.pdf. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/upload.tsx:21:10
   const extension = getFileExtension(file.name);
   const hasAllowedExtension = ALLOWED_FILE_EXTENSIONS.includes(extension);
   const hasAllowedMimeType = !file.type || ALLOWED_FILE_TYPES.includes(file.type);
-  return hasAllowedExtension && hasAllowedMimeType;
+  return true;
 };
 const Upload: React.FC = () => {
killedBy: Upload Page handles invalid file drop
statusReason: Unable to find an element with the text: Formato inválido. Envie apenas arquivos PDF, CSV ou JSON.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/upload.tsx:26:21
 const Upload: React.FC = () => {
   const navigate = useNavigate();
   const { user } = useAuth();
-  const firstName = user?.name?.split(' ')[0] || 'Usuário';
+  const firstName = false;
 
   const { data: projects = [] } = useProjects();
killedBy: Upload Page renders correctly with user name
statusReason: Unable to find an element with the text: Bom dia, John. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[NoCoverage] ArrayDeclaration
src/pages/upload.tsx:28:28
   const { user } = useAuth();
   const firstName = user?.name?.split(' ')[0] || 'Usuário';
 
-  const { data: projects = [] } = useProjects();
+  const { data: projects = ["Stryker was here"] } = useProjects();
   const { mutateAsync: uploadDoc } = useUploadDocument();
 

[Survived] BooleanLiteral
src/pages/upload.tsx:39:48
   const [uploadError, setUploadError] = useState('');
   const [uploadSuccess, setUploadSuccess] = useState('');
   const [uploadProgress, setUploadProgress] = useState(0);
-  const [isDragging, setIsDragging] = useState(false);
+  const [isDragging, setIsDragging] = useState(true);
 
   const handleDragOver = (e: React.DragEvent) => {

[Killed] BlockStatement
src/pages/upload.tsx:51:44
     setIsDragging(false);
   };
 
-  const selectUploadFile = (file: File) => {
-    setUploadError('');
-
-    if (!isAllowedFile(file)) {
-      setUploadFile(null);
-      setUploadError('Formato inválido. Envie apenas arquivos PDF, CSV ou JSON.');
-      return;
-    }
-
-    setUploadFile(file);
-  };
+  const selectUploadFile = (file: File) => {};
 
   const handleDrop = (e: React.DragEvent) => {
killedBy: Upload Page handles invalid file drop
statusReason: Unable to find an element with the text: Formato inválido. Envie apenas arquivos PDF, CSV ou JSON.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/upload.tsx:54:9
   const selectUploadFile = (file: File) => {
     setUploadError('');
 
-    if (!isAllowedFile(file)) {
+    if (false) {
       setUploadFile(null);
       setUploadError('Formato inválido. Envie apenas arquivos PDF, CSV ou JSON.');
killedBy: Upload Page handles invalid file drop
statusReason: Unable to find an element with the text: Formato inválido. Envie apenas arquivos PDF, CSV ou JSON.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/upload.tsx:54:31
   const selectUploadFile = (file: File) => {
     setUploadError('');
 
-    if (!isAllowedFile(file)) {
-      setUploadFile(null);
-      setUploadError('Formato inválido. Envie apenas arquivos PDF, CSV ou JSON.');
-      return;
-    }
+    if (!isAllowedFile(file)) {}
 
     setUploadFile(file);
killedBy: Upload Page handles invalid file drop
statusReason: Unable to find an element with the text: Formato inválido. Envie apenas arquivos PDF, CSV ou JSON.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/upload.tsx:63:46
     setUploadFile(file);
   };
 
-  const handleDrop = (e: React.DragEvent) => {
-    e.preventDefault();
-    setIsDragging(false);
-    if (e.dataTransfer.files && e.dataTransfer.files[0]) {
-      selectUploadFile(e.dataTransfer.files[0]);
-    }
-  };
+  const handleDrop = (e: React.DragEvent) => {};
 
   const handleFileInput = (e: React.ChangeEvent<HTMLInputElement>) => {
killedBy: Upload Page handles invalid file drop
statusReason: Unable to find an element with the text: Formato inválido. Envie apenas arquivos PDF, CSV ou JSON.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/upload.tsx:66:58
   const handleDrop = (e: React.DragEvent) => {
     e.preventDefault();
     setIsDragging(false);
-    if (e.dataTransfer.files && e.dataTransfer.files[0]) {
-      selectUploadFile(e.dataTransfer.files[0]);
-    }
+    if (e.dataTransfer.files && e.dataTransfer.files[0]) {}
   };
 
killedBy: Upload Page handles invalid file drop
statusReason: Unable to find an element with the text: Formato inválido. Envie apenas arquivos PDF, CSV ou JSON.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/upload.tsx:71:71
     }
   };
 
-  const handleFileInput = (e: React.ChangeEvent<HTMLInputElement>) => {
-    if (e.target.files && e.target.files.length > 0) {
-      selectUploadFile(e.target.files[0]);
-    }
-  };
+  const handleFileInput = (e: React.ChangeEvent<HTMLInputElement>) => {};
 
   const handleUpload = async (e: React.FormEvent) => {
killedBy: Upload Page handles file input change
statusReason: Unable to find an element with the text: data.json. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/upload.tsx:72:9
   };
 
   const handleFileInput = (e: React.ChangeEvent<HTMLInputElement>) => {
-    if (e.target.files && e.target.files.length > 0) {
+    if (false) {
       selectUploadFile(e.target.files[0]);
     }
killedBy: Upload Page handles file input change
statusReason: Unable to find an element with the text: data.json. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] StringLiteral
src/pages/upload.tsx:80:22
   const handleUpload = async (e: React.FormEvent) => {
     e.preventDefault();
     setUploadError('');
-    setUploadSuccess('');
+    setUploadSuccess("Stryker was here!");
     setUploadProgress(0);
 

[Killed] BooleanLiteral
src/pages/upload.tsx:83:24
     setUploadSuccess('');
     setUploadProgress(0);
 
-    if (!uploadFile || !uploadTitle || !uploadProjectId) {
+    if (!uploadFile || uploadTitle || !uploadProjectId) {
       setUploadError(
         'Por favor, preencha todos os campos obrigatórios (Título, Projeto e Arquivo).',
killedBy: Upload Page shows error if file is allowed initially but somehow changes to invalid before submit
statusReason: Unable to find an element with the text: Formato inválido. Envie apenas arquivos PDF, CSV ou JSON.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/upload.tsx:83:9
     setUploadSuccess('');
     setUploadProgress(0);
 
-    if (!uploadFile || !uploadTitle || !uploadProjectId) {
+    if (false) {
       setUploadError(
         'Por favor, preencha todos os campos obrigatórios (Título, Projeto e Arquivo).',
killedBy: Upload Page shows error when required fields are missing on submit
statusReason: Unable to find an element with the text: Por favor, preencha todos os campos obrigatórios (Título, Projeto e Arquivo).. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/upload.tsx:90:37
       return;
     }
 
-    if (!isAllowedFile(uploadFile)) {
-      setUploadError('Formato inválido. Envie apenas arquivos PDF, CSV ou JSON.');
-      return;
-    }
+    if (!isAllowedFile(uploadFile)) {}
 
     try {
killedBy: Upload Page shows error if file is allowed initially but somehow changes to invalid before submit
statusReason: Unable to find an element with the text: Formato inválido. Envie apenas arquivos PDF, CSV ou JSON.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/upload.tsx:90:9
       return;
     }
 
-    if (!isAllowedFile(uploadFile)) {
+    if (false) {
       setUploadError('Formato inválido. Envie apenas arquivos PDF, CSV ou JSON.');
       return;
killedBy: Upload Page shows error if file is allowed initially but somehow changes to invalid before submit
statusReason: Unable to find an element with the text: Formato inválido. Envie apenas arquivos PDF, CSV ou JSON.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/upload.tsx:95:9
       return;
     }
 
-    try {
-      await uploadDoc({
-        file: uploadFile,
-        title: uploadTitle,
-        projectId: uploadProjectId,
-        onProgress: (progressEvent) => {
-          const percentCompleted = Math.round((progressEvent.loaded * 100) / progressEvent.total);
-          setUploadProgress(percentCompleted);
-        },
-      });
-
-      setUploadSuccess('Documento enviado com sucesso! Redirecionando para o Workspace...');
-      setTimeout(() => {
-        navigate('/documentos');
-      }, 2000);
-    } catch (error: any) {
+    try {} catch (error: any) {
       setUploadError(error.message);
       setUploadProgress(0);
killedBy: Upload Page handles successful upload and redirects
statusReason: Unable to find an element with the text: 50%. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/upload.tsx:100:40
         file: uploadFile,
         title: uploadTitle,
         projectId: uploadProjectId,
-        onProgress: (progressEvent) => {
-          const percentCompleted = Math.round((progressEvent.loaded * 100) / progressEvent.total);
-          setUploadProgress(percentCompleted);
-        },
+        onProgress: (progressEvent) => {},
       });
 
killedBy: Upload Page handles successful upload and redirects
statusReason: Unable to find an element with the text: 50%. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ArithmeticOperator
src/pages/upload.tsx:101:48
         title: uploadTitle,
         projectId: uploadProjectId,
         onProgress: (progressEvent) => {
-          const percentCompleted = Math.round((progressEvent.loaded * 100) / progressEvent.total);
+          const percentCompleted = Math.round((progressEvent.loaded / 100) / progressEvent.total);
           setUploadProgress(percentCompleted);
         },
killedBy: Upload Page handles successful upload and redirects
statusReason: Unable to find an element with the text: 50%. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ArithmeticOperator
src/pages/upload.tsx:101:47
         title: uploadTitle,
         projectId: uploadProjectId,
         onProgress: (progressEvent) => {
-          const percentCompleted = Math.round((progressEvent.loaded * 100) / progressEvent.total);
+          const percentCompleted = Math.round(progressEvent.loaded * 100 * progressEvent.total);
           setUploadProgress(percentCompleted);
         },
killedBy: Upload Page handles successful upload and redirects
statusReason: Unable to find an element with the text: 50%. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] StringLiteral
src/pages/upload.tsx:106:24
         },
       });
 
-      setUploadSuccess('Documento enviado com sucesso! Redirecionando para o Workspace...');
+      setUploadSuccess("");
       setTimeout(() => {
         navigate('/documentos');

[Killed] BlockStatement
src/pages/upload.tsx:107:24
       });
 
       setUploadSuccess('Documento enviado com sucesso! Redirecionando para o Workspace...');
-      setTimeout(() => {
-        navigate('/documentos');
-      }, 2000);
+      setTimeout(() => {}, 2000);
     } catch (error: any) {
       setUploadError(error.message);
killedBy: Upload Page handles successful upload and redirects
statusReason: expected "vi.fn()" to be called with arguments: [ '/documentos' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
src/pages/upload.tsx:110:26
       setTimeout(() => {
         navigate('/documentos');
       }, 2000);
-    } catch (error: any) {
-      setUploadError(error.message);
-      setUploadProgress(0);
-    }
+    } catch (error: any) {}
   };
 
killedBy: Upload Page handles upload failure
statusReason: Unable to find an element with the text: Upload failed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] ArrayDeclaration
src/pages/upload.tsx:120:20
     <DashboardLayout
       title={`Bom dia, ${firstName}`}
       subtitle="Adicione novos metadados e envie arquivos para os seus projetos"
-      breadcrumbs={['EdTech', 'Enviar Documento']}
+      breadcrumbs={[]}
     >
       <div

[Survived] StringLiteral
src/pages/upload.tsx:124:52
     >
       <div
         className="dashboard-card"
-        style={{ padding: '32px', backgroundColor: 'var(--bg)', border: '1px solid var(--border)' }}
+        style={{ padding: '32px', backgroundColor: "", border: '1px solid var(--border)' }}
       >
         {uploadError && (

[Killed] ConditionalExpression
src/pages/upload.tsx:126:10
         className="dashboard-card"
         style={{ padding: '32px', backgroundColor: 'var(--bg)', border: '1px solid var(--border)' }}
       >
-        {uploadError && (
-          <div
-            className="governance-alert"
-            style={{ background: 'var(--ed-status-danger)', marginBottom: '24px' }}
-          >
-            <div className="alert-content">
-              <div className="alert-icon">
-                <i className="bi bi-exclamation-triangle"></i>
-              </div>
-              <div className="alert-text-container">
-                <span className="alert-title">ERRO NO UPLOAD</span>
-                <span className="alert-desc">{uploadError}</span>
-              </div>
-            </div>
-          </div>
-        )}
+        {true}
 
         {uploadSuccess && (
killedBy: Upload Page handles invalid file drop
statusReason: Unable to find an element with the text: Formato inválido. Envie apenas arquivos PDF, CSV ou JSON.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/upload.tsx:126:10
         className="dashboard-card"
         style={{ padding: '32px', backgroundColor: 'var(--bg)', border: '1px solid var(--border)' }}
       >
-        {uploadError && (
-          <div
-            className="governance-alert"
-            style={{ background: 'var(--ed-status-danger)', marginBottom: '24px' }}
-          >
-            <div className="alert-content">
-              <div className="alert-icon">
-                <i className="bi bi-exclamation-triangle"></i>
-              </div>
-              <div className="alert-text-container">
-                <span className="alert-title">ERRO NO UPLOAD</span>
-                <span className="alert-desc">{uploadError}</span>
-              </div>
-            </div>
-          </div>
-        )}
+        {false}
 
         {uploadSuccess && (
killedBy: Upload Page handles invalid file drop
statusReason: Unable to find an element with the text: Formato inválido. Envie apenas arquivos PDF, CSV ou JSON.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] StringLiteral
src/pages/upload.tsx:129:34
         {uploadError && (
           <div
             className="governance-alert"
-            style={{ background: 'var(--ed-status-danger)', marginBottom: '24px' }}
+            style={{ background: "", marginBottom: '24px' }}
           >
             <div className="alert-content">

[Survived] ConditionalExpression
src/pages/upload.tsx:143:10
           </div>
         )}
 
-        {uploadSuccess && (
-          <div
-            className="governance-alert"
-            style={{ background: 'var(--ed-status-success)', marginBottom: '24px' }}
-          >
-            <div className="alert-content">
-              <div className="alert-icon">
-                <i className="bi bi-check-circle"></i>
-              </div>
-              <div className="alert-text-container">
-                <span className="alert-title">SUCESSO</span>
-                <span className="alert-desc">{uploadSuccess}</span>
-              </div>
-            </div>
-          </div>
-        )}
+        {false}
 
         <form onSubmit={handleUpload} className="upload-advanced-form">

[Survived] LogicalOperator
src/pages/upload.tsx:143:10
           </div>
         )}
 
-        {uploadSuccess && (
-          <div
-            className="governance-alert"
-            style={{ background: 'var(--ed-status-success)', marginBottom: '24px' }}
-          >
-            <div className="alert-content">
-              <div className="alert-icon">
-                <i className="bi bi-check-circle"></i>
-              </div>
-              <div className="alert-text-container">
-                <span className="alert-title">SUCESSO</span>
-                <span className="alert-desc">{uploadSuccess}</span>
-              </div>
-            </div>
-          </div>
-        )}
+        {uploadSuccess || <div className="governance-alert" style={{
+  background: 'var(--ed-status-success)',
+  marginBottom: '24px'
+}}>
+            <div className="alert-content">
+              <div className="alert-icon">
+                <i className="bi bi-check-circle"></i>
+              </div>
+              <div className="alert-text-container">
+                <span className="alert-title">SUCESSO</span>
+                <span className="alert-desc">{uploadSuccess}</span>
+              </div>
+            </div>
+          </div>}
 
         <form onSubmit={handleUpload} className="upload-advanced-form">

[Survived] StringLiteral
src/pages/upload.tsx:146:76
         {uploadSuccess && (
           <div
             className="governance-alert"
-            style={{ background: 'var(--ed-status-success)', marginBottom: '24px' }}
+            style={{ background: 'var(--ed-status-success)', marginBottom: "" }}
           >
             <div className="alert-content">

[Survived] StringLiteral
src/pages/upload.tsx:146:34
         {uploadSuccess && (
           <div
             className="governance-alert"
-            style={{ background: 'var(--ed-status-success)', marginBottom: '24px' }}
+            style={{ background: "", marginBottom: '24px' }}
           >
             <div className="alert-content">
