[Survived] ObjectLiteral
src/pages/upload.tsx:178:26
 
               <div className="form-group">
                 <label
-                  style={{
-                    display: 'block',
-                    fontSize: '13px',
-                    fontWeight: 600,
-                    marginBottom: '8px',
-                    color: 'var(--ed-text-dark)',
-                  }}
+                  style={{}}
                 >
                   Título do Documento *

[Survived] StringLiteral
src/pages/upload.tsx:179:30
               <div className="form-group">
                 <label
                   style={{
-                    display: 'block',
+                    display: "",
                     fontSize: '13px',
                     fontWeight: 600,

[Survived] StringLiteral
src/pages/upload.tsx:183:28
                     fontSize: '13px',
                     fontWeight: 600,
                     marginBottom: '8px',
-                    color: 'var(--ed-text-dark)',
+                    color: "",
                   }}
                 >

[Killed] ArrowFunction
src/pages/upload.tsx:192:29
                   type="text"
                   placeholder="Ex: Metodologia Qualitativa v3"
                   value={uploadTitle}
-                  onChange={(e) => setUploadTitle(e.target.value)}
+                  onChange={() => undefined}
                   style={{
                     width: '100%',
killedBy: Upload Page handles form field changes
statusReason: expect(element).toHaveValue(My Title)

Expected the element to have value:
  My Title
Received:

[Survived] ObjectLiteral
src/pages/upload.tsx:193:26
                   placeholder="Ex: Metodologia Qualitativa v3"
                   value={uploadTitle}
                   onChange={(e) => setUploadTitle(e.target.value)}
-                  style={{
-                    width: '100%',
-                    padding: '12px 14px',
-                    borderRadius: '6px',
-                    border: '1px solid var(--border)',
-                    background: 'rgba(0,0,0,0.1)',
-                    color: 'var(--ed-text-dark)',
-                    fontSize: '14px',
-                    outline: 'none',
-                  }}
+                  style={{}}
                 />
               </div>

[Survived] StringLiteral
src/pages/upload.tsx:195:30
                   onChange={(e) => setUploadTitle(e.target.value)}
                   style={{
                     width: '100%',
-                    padding: '12px 14px',
+                    padding: "",
                     borderRadius: '6px',
                     border: '1px solid var(--border)',

[Killed] ArrowFunction
src/pages/upload.tsx:220:29
                 </label>
                 <select
                   value={uploadProjectId}
-                  onChange={(e) => setUploadProjectId(e.target.value)}
+                  onChange={() => undefined}
                   style={{
                     width: '100%',
killedBy: Upload Page handles form field changes
statusReason: expect(element).toHaveValue(1)

Expected the element to have value:
  1
Received:

[Survived] StringLiteral
src/pages/upload.tsx:226:33
                     padding: '12px 14px',
                     borderRadius: '6px',
                     border: '1px solid var(--border)',
-                    background: 'rgba(0,0,0,0.1)',
+                    background: "",
                     color: 'var(--ed-text-dark)',
                     fontSize: '14px',

[Survived] StringLiteral
src/pages/upload.tsx:227:28
                     borderRadius: '6px',
                     border: '1px solid var(--border)',
                     background: 'rgba(0,0,0,0.1)',
-                    color: 'var(--ed-text-dark)',
+                    color: "",
                     fontSize: '14px',
                     outline: 'none',

[Killed] ArrowFunction
src/pages/upload.tsx:233:33
                   }}
                 >
                   <option value="">Selecione o Projeto...</option>
-                  {projects.map((p: Project) => (
-                    <option key={p.id} value={p.id}>
-                      {p.name}
-                    </option>
-                  ))}
+                  {projects.map(() => undefined)}
                 </select>
               </div>
killedBy: Upload Page handles form field changes
statusReason: expect(element).toHaveValue(1)

Expected the element to have value:
  1
Received:

[Killed] ArrowFunction
src/pages/upload.tsx:255:29
                 </label>
                 <select
                   value={uploadCategory}
-                  onChange={(e) => setUploadCategory(e.target.value)}
+                  onChange={() => undefined}
                   style={{
                     width: '100%',
killedBy: Upload Page handles form field changes
statusReason: expect(element).toHaveValue(Metodologia)

Expected the element to have value:
  Metodologia
Received:

[Survived] StringLiteral
src/pages/upload.tsx:257:28
                   value={uploadCategory}
                   onChange={(e) => setUploadCategory(e.target.value)}
                   style={{
-                    width: '100%',
+                    width: "",
                     padding: '12px 14px',
                     borderRadius: '6px',

[Survived] StringLiteral
src/pages/upload.tsx:259:35
                   style={{
                     width: '100%',
                     padding: '12px 14px',
-                    borderRadius: '6px',
+                    borderRadius: "",
                     border: '1px solid var(--border)',
                     background: 'rgba(0,0,0,0.1)',

[Survived] StringLiteral
src/pages/upload.tsx:263:31
                     border: '1px solid var(--border)',
                     background: 'rgba(0,0,0,0.1)',
                     color: 'var(--ed-text-dark)',
-                    fontSize: '14px',
+                    fontSize: "",
                     outline: 'none',
                   }}

[Survived] StringLiteral
src/pages/upload.tsx:264:30
                     background: 'rgba(0,0,0,0.1)',
                     color: 'var(--ed-text-dark)',
                     fontSize: '14px',
-                    outline: 'none',
+                    outline: "",
                   }}
                 >

[Survived] StringLiteral
src/pages/upload.tsx:280:31
                 <label
                   style={{
                     display: 'block',
-                    fontSize: '13px',
+                    fontSize: "",
                     fontWeight: 600,
                     marginBottom: '8px',

[Killed] ArrowFunction
src/pages/upload.tsx:292:29
                   type="text"
                   placeholder="Ex: LGPD, IA, Dados Sensíveis"
                   value={uploadTags}
-                  onChange={(e) => setUploadTags(e.target.value)}
+                  onChange={() => undefined}
                   style={{
                     width: '100%',
killedBy: Upload Page handles form field changes
statusReason: expect(element).toHaveValue(Tag1, Tag2)

Expected the element to have value:
  Tag1, Tag2
Received:

[Survived] StringLiteral
src/pages/upload.tsx:308:74
             </div>
 
             {/* Coluna 2: Arquivo */}
-            <div style={{ display: 'flex', flexDirection: 'column', gap: '24px' }}>
+            <div style={{ display: 'flex', flexDirection: 'column', gap: "" }}>
               <h4
                 style={{

[Survived] ObjectLiteral
src/pages/upload.tsx:308:25
             </div>
 
             {/* Coluna 2: Arquivo */}
-            <div style={{ display: 'flex', flexDirection: 'column', gap: '24px' }}>
+            <div style={{}}>
               <h4
                 style={{

[Survived] ObjectLiteral
src/pages/upload.tsx:310:24
             {/* Coluna 2: Arquivo */}
             <div style={{ display: 'flex', flexDirection: 'column', gap: '24px' }}>
               <h4
-                style={{
-                  fontSize: '15px',
-                  fontWeight: 600,
-                  color: 'var(--ed-purple-light)',
-                  opacity: 0.9,
-                  marginBottom: '4px',
-                }}
+                style={{}}
               >
                 2. Arquivo do Documento

[Survived] StringLiteral
src/pages/upload.tsx:313:26
                 style={{
                   fontSize: '15px',
                   fontWeight: 600,
-                  color: 'var(--ed-purple-light)',
+                  color: "",
                   opacity: 0.9,
                   marginBottom: '4px',

[Survived] ArrowFunction
src/pages/upload.tsx:325:26
                 onDragOver={handleDragOver}
                 onDragLeave={handleDragLeave}
                 onDrop={handleDrop}
-                onClick={() => document.getElementById('advancedFileInput')?.click()}
+                onClick={() => undefined}
                 style={{
                   flex: 1,

[NoCoverage] OptionalChaining
src/pages/upload.tsx:325:32
                 onDragOver={handleDragOver}
                 onDragLeave={handleDragLeave}
                 onDrop={handleDrop}
-                onClick={() => document.getElementById('advancedFileInput')?.click()}
+                onClick={() => document.getElementById('advancedFileInput').click()}
                 style={{
                   flex: 1,

[Survived] StringLiteral
src/pages/upload.tsx:340:53
                 }}
               >
                 <div
-                  style={{ fontSize: '24px', color: 'var(--ed-text-dark)', marginBottom: '16px' }}
+                  style={{ fontSize: '24px', color: "", marginBottom: '16px' }}
                 >
                   {uploadFile ? (

[Survived] ObjectLiteral
src/pages/upload.tsx:349:26
                   )}
                 </div>
                 <p
-                  style={{
-                    fontSize: '15px',
-                    color: 'var(--ed-text-dark)',
-                    fontWeight: 600,
-                    margin: '0 0 8px 0',
-                  }}
+                  style={{}}
                 >
                   {uploadFile ? uploadFile.name : 'Arraste e solte seu arquivo aqui'}

[Survived] StringLiteral
src/pages/upload.tsx:351:28
                 <p
                   style={{
                     fontSize: '15px',
-                    color: 'var(--ed-text-dark)',
+                    color: "",
                     fontWeight: 600,
                     margin: '0 0 8px 0',

[Survived] StringLiteral
src/pages/upload.tsx:353:29
                     fontSize: '15px',
                     color: 'var(--ed-text-dark)',
                     fontWeight: 600,
-                    margin: '0 0 8px 0',
+                    margin: "",
                   }}
                 >

[Survived] StringLiteral
src/pages/upload.tsx:358:54
                 >
                   {uploadFile ? uploadFile.name : 'Arraste e solte seu arquivo aqui'}
                 </p>
-                <p style={{ fontSize: '13px', color: 'var(--ed-text-muted)', margin: 0 }}>
+                <p style={{ fontSize: '13px', color: "", margin: 0 }}>
                   ou clique para procurar no seu computador
                 </p>

[Survived] StringLiteral
src/pages/upload.tsx:358:39
                 >
                   {uploadFile ? uploadFile.name : 'Arraste e solte seu arquivo aqui'}
                 </p>
-                <p style={{ fontSize: '13px', color: 'var(--ed-text-muted)', margin: 0 }}>
+                <p style={{ fontSize: "", color: 'var(--ed-text-muted)', margin: 0 }}>
                   ou clique para procurar no seu computador
                 </p>

[Survived] StringLiteral
src/pages/upload.tsx:363:31
                 </p>
                 <p
                   style={{
-                    fontSize: '12px',
+                    fontSize: "",
                     marginTop: '24px',
                     color: 'var(--ed-text-muted)',

[Survived] StringLiteral
src/pages/upload.tsx:364:32
                 <p
                   style={{
                     fontSize: '12px',
-                    marginTop: '24px',
+                    marginTop: "",
                     color: 'var(--ed-text-muted)',
                     margin: '24px 0 0 0',

[Killed] LogicalOperator
src/pages/upload.tsx:380:16
                 />
               </div>
 
-              {uploadProgress > 0 && (
-                <div className="progress-item mt-2">
-                  <div className="progress-header">
-                    <span>Enviando {uploadFile?.name}...</span>
-                    <span>{uploadProgress}%</span>
-                  </div>
-                  <div className="progress-bar-bg">
-                    <div
-                      className="progress-bar-fill fill-purple"
-                      style={{ width: `${uploadProgress}%`, transition: 'width 0.3s' }}
-                    ></div>
-                  </div>
-                </div>
-              )}
+              {uploadProgress > 0 || <div className="progress-item mt-2">
+                  <div className="progress-header">
+                    <span>Enviando {uploadFile?.name}...</span>
+                    <span>{uploadProgress}%</span>
+                  </div>
+                  <div className="progress-bar-bg">
+                    <div className="progress-bar-fill fill-purple" style={{
+      width: `${uploadProgress}%`,
+      transition: 'width 0.3s'
+    }}></div>
+                  </div>
+                </div>}
             </div>
           </div>
killedBy: Upload Page handles successful upload and redirects
statusReason: Unable to find an element with the text: 50%. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] EqualityOperator
src/pages/upload.tsx:380:16
                 />
               </div>
 
-              {uploadProgress > 0 && (
+              {uploadProgress <= 0 && (
                 <div className="progress-item mt-2">
                   <div className="progress-header">
killedBy: Upload Page handles successful upload and redirects
statusReason: Unable to find an element with the text: 50%. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] OptionalChaining
src/pages/upload.tsx:383:37
               {uploadProgress > 0 && (
                 <div className="progress-item mt-2">
                   <div className="progress-header">
-                    <span>Enviando {uploadFile?.name}...</span>
+                    <span>Enviando {uploadFile.name}...</span>
                     <span>{uploadProgress}%</span>
                   </div>

[Survived] StringLiteral
src/pages/upload.tsx:389:39
                   <div className="progress-bar-bg">
                     <div
                       className="progress-bar-fill fill-purple"
-                      style={{ width: `${uploadProgress}%`, transition: 'width 0.3s' }}
+                      style={{ width: ``, transition: 'width 0.3s' }}
                     ></div>
                   </div>

[Survived] StringLiteral
src/pages/upload.tsx:389:73
                   <div className="progress-bar-bg">
                     <div
                       className="progress-bar-fill fill-purple"
-                      style={{ width: `${uploadProgress}%`, transition: 'width 0.3s' }}
+                      style={{ width: `${uploadProgress}%`, transition: "" }}
                     ></div>
                   </div>

[Survived] StringLiteral
src/pages/upload.tsx:403:27
               justifyContent: 'flex-end',
               gap: '16px',
               marginTop: '48px',
-              paddingTop: '32px',
+              paddingTop: "",
               borderTop: '1px solid var(--border)',
             }}

[Survived] ObjectLiteral
src/pages/upload.tsx:410:22
             <button
               type="button"
               onClick={() => navigate(-1)}
-              style={{
-                padding: '12px 32px',
-                background: 'transparent',
-                border: '1px solid var(--ed-text-muted)',
-                color: 'var(--ed-text-dark)',
-                borderRadius: '6px',
-                fontSize: '14px',
-                fontWeight: 500,
-                cursor: 'pointer',
-                transition: 'all 0.2s',
-              }}
+              style={{}}
             >
               Cancelar

[Survived] StringLiteral
src/pages/upload.tsx:416:27
                 border: '1px solid var(--ed-text-muted)',
                 color: 'var(--ed-text-dark)',
                 borderRadius: '6px',
-                fontSize: '14px',
+                fontSize: "",
                 fontWeight: 500,
                 cursor: 'pointer',

[Survived] StringLiteral
src/pages/upload.tsx:418:25
                 borderRadius: '6px',
                 fontSize: '14px',
                 fontWeight: 500,
-                cursor: 'pointer',
+                cursor: "",
                 transition: 'all 0.2s',
               }}

[Killed] EqualityOperator
src/pages/upload.tsx:426:40
             </button>
             <button
               type="submit"
-              disabled={!uploadFile || uploadProgress > 0}
+              disabled={!uploadFile || uploadProgress <= 0}
               style={{
                 padding: '12px 48px',
killedBy: Upload Page shows error when required fields are missing on submit
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <button
  disabled=""
  style="padding: 12px 48px; background-color: var(--ed-purple-main); color: white; border: medium; border-radius: 6px; font-size: 14px; font-weight: 500; cursor: pointer; transition: all 0.2s;"
  type="submit"
/>

[Killed] ConditionalExpression
src/pages/upload.tsx:426:25
             </button>
             <button
               type="submit"
-              disabled={!uploadFile || uploadProgress > 0}
+              disabled={true}
               style={{
                 padding: '12px 48px',
killedBy: Upload Page shows error when required fields are missing on submit
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <button
  disabled=""
  style="padding: 12px 48px; background-color: var(--ed-purple-main); color: white; border: medium; border-radius: 6px; font-size: 14px; font-weight: 500; cursor: pointer; transition: all 0.2s;"
  type="submit"
/>

[Survived] ObjectLiteral
src/pages/upload.tsx:427:22
             <button
               type="submit"
               disabled={!uploadFile || uploadProgress > 0}
-              style={{
-                padding: '12px 48px',
-                backgroundColor: uploadFile ? 'var(--ed-purple-main)' : 'rgba(255,255,255,0.03)',
-                color: uploadFile ? 'white' : 'rgba(255,255,255,0.3)',
-                border: 'none',
-                borderRadius: '6px',
-                fontSize: '14px',
-                fontWeight: 500,
-                cursor: uploadFile ? 'pointer' : 'not-allowed',
-                transition: 'all 0.2s',
-              }}
+              style={{}}
             >
               {uploadProgress > 0 && uploadProgress < 100 ? 'Enviando...' : 'Confirmar Envio'}

[Survived] StringLiteral
src/pages/upload.tsx:429:47
               disabled={!uploadFile || uploadProgress > 0}
               style={{
                 padding: '12px 48px',
-                backgroundColor: uploadFile ? 'var(--ed-purple-main)' : 'rgba(255,255,255,0.03)',
+                backgroundColor: uploadFile ? "" : 'rgba(255,255,255,0.03)',
                 color: uploadFile ? 'white' : 'rgba(255,255,255,0.3)',
                 border: 'none',

[Survived] StringLiteral
src/pages/upload.tsx:431:25
                 padding: '12px 48px',
                 backgroundColor: uploadFile ? 'var(--ed-purple-main)' : 'rgba(255,255,255,0.03)',
                 color: uploadFile ? 'white' : 'rgba(255,255,255,0.3)',
-                border: 'none',
+                border: "",
                 borderRadius: '6px',
                 fontSize: '14px',

[Survived] StringLiteral
src/pages/upload.tsx:435:50
                 borderRadius: '6px',
                 fontSize: '14px',
                 fontWeight: 500,
-                cursor: uploadFile ? 'pointer' : 'not-allowed',
+                cursor: uploadFile ? 'pointer' : "",
                 transition: 'all 0.2s',
               }}

[Killed] EqualityOperator
src/pages/upload.tsx:439:16
                 transition: 'all 0.2s',
               }}
             >
-              {uploadProgress > 0 && uploadProgress < 100 ? 'Enviando...' : 'Confirmar Envio'}
+              {uploadProgress <= 0 && uploadProgress < 100 ? 'Enviando...' : 'Confirmar Envio'}
             </button>
           </div>
killedBy: Upload Page shows error when required fields are missing on submit
statusReason: Unable to find an accessible element with the role "button" and name "Confirmar Envio"

Here are the accessible roles:

  heading:

  Name "Bom dia, John":
  <h1 />

[Killed] ConditionalExpression
src/pages/upload.tsx:439:16
                 transition: 'all 0.2s',
               }}
             >
-              {uploadProgress > 0 && uploadProgress < 100 ? 'Enviando...' : 'Confirmar Envio'}
+              {true ? 'Enviando...' : 'Confirmar Envio'}
             </button>
           </div>
killedBy: Upload Page shows error when required fields are missing on submit
statusReason: Unable to find an accessible element with the role "button" and name "Confirmar Envio"

Here are the accessible roles:

  heading:

  Name "Bom dia, John":
  <h1 />
