[Killed] ArrowFunction
src/App.tsx:9:26
 import GlobalLoader from './components/GlobalLoader';
 
 // Lazy load rotas
-const Login = React.lazy(() => import('./pages/login'));
+const Login = React.lazy(() => undefined);
 const Register = React.lazy(() => import('./pages/register'));
 const Recovery = React.lazy(() => import('./pages/Recovery'));
killedBy: App Component renders without crashing
statusReason: Cannot read properties of undefined (reading 'then')

[Survived] ArrowFunction
src/App.tsx:10:29
 
 // Lazy load rotas
 const Login = React.lazy(() => import('./pages/login'));
-const Register = React.lazy(() => import('./pages/register'));
+const Register = React.lazy(() => undefined);
 const Recovery = React.lazy(() => import('./pages/Recovery'));
 const Dashboard = React.lazy(() => import('./pages/dashboard'));

[Survived] ArrowFunction
src/App.tsx:11:29
 // Lazy load rotas
 const Login = React.lazy(() => import('./pages/login'));
 const Register = React.lazy(() => import('./pages/register'));
-const Recovery = React.lazy(() => import('./pages/Recovery'));
+const Recovery = React.lazy(() => undefined);
 const Dashboard = React.lazy(() => import('./pages/dashboard'));
 const Documentos = React.lazy(() => import('./pages/documentos'));

[Survived] ArrowFunction
src/App.tsx:12:30
 const Login = React.lazy(() => import('./pages/login'));
 const Register = React.lazy(() => import('./pages/register'));
 const Recovery = React.lazy(() => import('./pages/Recovery'));
-const Dashboard = React.lazy(() => import('./pages/dashboard'));
+const Dashboard = React.lazy(() => undefined);
 const Documentos = React.lazy(() => import('./pages/documentos'));
 const Trail = React.lazy(() => import('./pages/trail'));

[Survived] ArrowFunction
src/App.tsx:13:31
 const Register = React.lazy(() => import('./pages/register'));
 const Recovery = React.lazy(() => import('./pages/Recovery'));
 const Dashboard = React.lazy(() => import('./pages/dashboard'));
-const Documentos = React.lazy(() => import('./pages/documentos'));
+const Documentos = React.lazy(() => undefined);
 const Trail = React.lazy(() => import('./pages/trail'));
 const Upload = React.lazy(() => import('./pages/upload'));

[Survived] ArrowFunction
src/App.tsx:14:26
 const Recovery = React.lazy(() => import('./pages/Recovery'));
 const Dashboard = React.lazy(() => import('./pages/dashboard'));
 const Documentos = React.lazy(() => import('./pages/documentos'));
-const Trail = React.lazy(() => import('./pages/trail'));
+const Trail = React.lazy(() => undefined);
 const Upload = React.lazy(() => import('./pages/upload'));
 const Settings = React.lazy(() => import('./pages/settings'));

[Survived] ArrowFunction
src/App.tsx:15:27
 const Dashboard = React.lazy(() => import('./pages/dashboard'));
 const Documentos = React.lazy(() => import('./pages/documentos'));
 const Trail = React.lazy(() => import('./pages/trail'));
-const Upload = React.lazy(() => import('./pages/upload'));
+const Upload = React.lazy(() => undefined);
 const Settings = React.lazy(() => import('./pages/settings'));
 const About = React.lazy(() => import('./pages/About'));

[Survived] ArrowFunction
src/App.tsx:16:29
 const Documentos = React.lazy(() => import('./pages/documentos'));
 const Trail = React.lazy(() => import('./pages/trail'));
 const Upload = React.lazy(() => import('./pages/upload'));
-const Settings = React.lazy(() => import('./pages/settings'));
+const Settings = React.lazy(() => undefined);
 const About = React.lazy(() => import('./pages/About'));
 const Submissions = React.lazy(() => import('./pages/submissions'));

[Survived] ArrowFunction
src/App.tsx:17:26
 const Trail = React.lazy(() => import('./pages/trail'));
 const Upload = React.lazy(() => import('./pages/upload'));
 const Settings = React.lazy(() => import('./pages/settings'));
-const About = React.lazy(() => import('./pages/About'));
+const About = React.lazy(() => undefined);
 const Submissions = React.lazy(() => import('./pages/submissions'));
 const Analytics = React.lazy(() => import('./pages/analytics'));

[Survived] ArrowFunction
src/App.tsx:18:32
 const Upload = React.lazy(() => import('./pages/upload'));
 const Settings = React.lazy(() => import('./pages/settings'));
 const About = React.lazy(() => import('./pages/About'));
-const Submissions = React.lazy(() => import('./pages/submissions'));
+const Submissions = React.lazy(() => undefined);
 const Analytics = React.lazy(() => import('./pages/analytics'));
 const ComplianceCenter = React.lazy(() => import('./pages/compliance'));

[Survived] ArrowFunction
src/App.tsx:19:30
 const Settings = React.lazy(() => import('./pages/settings'));
 const About = React.lazy(() => import('./pages/About'));
 const Submissions = React.lazy(() => import('./pages/submissions'));
-const Analytics = React.lazy(() => import('./pages/analytics'));
+const Analytics = React.lazy(() => undefined);
 const ComplianceCenter = React.lazy(() => import('./pages/compliance'));
 const AuditLogs = React.lazy(() => import('./pages/auditLogs'));

[Survived] ArrowFunction
src/App.tsx:20:37
 const About = React.lazy(() => import('./pages/About'));
 const Submissions = React.lazy(() => import('./pages/submissions'));
 const Analytics = React.lazy(() => import('./pages/analytics'));
-const ComplianceCenter = React.lazy(() => import('./pages/compliance'));
+const ComplianceCenter = React.lazy(() => undefined);
 const AuditLogs = React.lazy(() => import('./pages/auditLogs'));
 const Projects = React.lazy(() => import('./pages/projects'));

[Survived] ArrowFunction
src/App.tsx:21:30
 const Submissions = React.lazy(() => import('./pages/submissions'));
 const Analytics = React.lazy(() => import('./pages/analytics'));
 const ComplianceCenter = React.lazy(() => import('./pages/compliance'));
-const AuditLogs = React.lazy(() => import('./pages/auditLogs'));
+const AuditLogs = React.lazy(() => undefined);
 const Projects = React.lazy(() => import('./pages/projects'));
 

[Survived] ArrowFunction
src/App.tsx:22:29
 const Analytics = React.lazy(() => import('./pages/analytics'));
 const ComplianceCenter = React.lazy(() => import('./pages/compliance'));
 const AuditLogs = React.lazy(() => import('./pages/auditLogs'));
-const Projects = React.lazy(() => import('./pages/projects'));
+const Projects = React.lazy(() => undefined);
 
 const queryClient = new QueryClient();

[Survived] ArrowFunction
src/App.tsx:26:18
 
 const queryClient = new QueryClient();
 
-const NotFound = () => (
-  <div style={{ padding: '2rem', textAlign: 'center', marginTop: '10vh' }}>
-    <h2>404 - Página não encontrada</h2>
-    <p>A rota que você tentou acessar não existe.</p>
-    <a href="/">Voltar para o início</a>
-  </div>
-);
+const NotFound = () => undefined;
 
 function App() {

[Survived] StringLiteral
src/App.tsx:27:26
 const queryClient = new QueryClient();
 
 const NotFound = () => (
-  <div style={{ padding: '2rem', textAlign: 'center', marginTop: '10vh' }}>
+  <div style={{ padding: "", textAlign: 'center', marginTop: '10vh' }}>
     <h2>404 - Página não encontrada</h2>
     <p>A rota que você tentou acessar não existe.</p>

[Survived] ObjectLiteral
src/App.tsx:27:15
 const queryClient = new QueryClient();
 
 const NotFound = () => (
-  <div style={{ padding: '2rem', textAlign: 'center', marginTop: '10vh' }}>
+  <div style={{}}>
     <h2>404 - Página não encontrada</h2>
     <p>A rota que você tentou acessar não existe.</p>

[Survived] StringLiteral
src/App.tsx:39:34
     <QueryClientProvider client={queryClient}>
       <AuthProvider>
         <BrowserRouter>
-          <div style={{ display: 'flex', flexDirection: 'column', minHeight: '100svh' }}>
+          <div style={{ display: "", flexDirection: 'column', minHeight: '100svh' }}>
             <GlobalLoader />
             <Suspense

[Survived] ArrayDeclaration
src/App.tsx:69:49
                 <Route
                   path="/submissions"
                   element={
-                    <PrivateRoute allowedRoles={['ADVISOR']}>
+                    <PrivateRoute allowedRoles={[]}>
                       <Submissions />
                     </PrivateRoute>

[Survived] StringLiteral
src/App.tsx:109:50
                 <Route
                   path="/compliance-center"
                   element={
-                    <PrivateRoute allowedRoles={['AUDITOR']}>
+                    <PrivateRoute allowedRoles={[""]}>
                       <ComplianceCenter />
                     </PrivateRoute>

[Survived] ArrayDeclaration
src/App.tsx:117:49
                 <Route
                   path="/audit-logs"
                   element={
-                    <PrivateRoute allowedRoles={['AUDITOR']}>
+                    <PrivateRoute allowedRoles={[]}>
                       <AuditLogs />
                     </PrivateRoute>
