[Survived] ObjectLiteral
src/components/ErrorBoundary.tsx:12:25
 }
 
 class ErrorBoundary extends Component<Props, State> {
-  public state: State = {
-    hasError: false
-  };
+  public state: State = {};
 
   public static getDerivedStateFromError(_: Error): State {

[Killed] BooleanLiteral
src/components/ErrorBoundary.tsx:13:15
 
 class ErrorBoundary extends Component<Props, State> {
   public state: State = {
-    hasError: false
+    hasError: true
   };
 
killedBy: ErrorBoundary renders children if no error
statusReason: Unable to find an element with the text: Safe. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="padding: 2rem; text-align: center; font-family: sans-serif; margin-top: 10%;"
    >

[Killed] BlockStatement
src/components/ErrorBoundary.tsx:16:59
     hasError: false
   };
 
-  public static getDerivedStateFromError(_: Error): State {
-    return { hasError: true };
-  }
+  public static getDerivedStateFromError(_: Error): State {}
 
   public componentDidCatch(error: Error, errorInfo: ErrorInfo) {
killedBy: ErrorBoundary catches error and renders fallback
statusReason: Kaboom

[Killed] BooleanLiteral
src/components/ErrorBoundary.tsx:17:24
   };
 
   public static getDerivedStateFromError(_: Error): State {
-    return { hasError: true };
+    return { hasError: false };
   }
 
killedBy: ErrorBoundary catches error and renders fallback
statusReason: Kaboom

[Survived] BlockStatement
src/components/ErrorBoundary.tsx:20:64
     return { hasError: true };
   }
 
-  public componentDidCatch(error: Error, errorInfo: ErrorInfo) {
-    console.error('Uncaught error:', error, errorInfo);
-  }
+  public componentDidCatch(error: Error, errorInfo: ErrorInfo) {}
 
   public render() {

[Killed] BlockStatement
src/components/ErrorBoundary.tsx:24:19
     console.error('Uncaught error:', error, errorInfo);
   }
 
-  public render() {
-    if (this.state.hasError) {
-      return (
-        <div style={{ padding: '2rem', textAlign: 'center', fontFamily: 'sans-serif', marginTop: '10%' }}>
-          <h2>Oops! Algo deu errado.</h2>
-          <p className="text-muted">Nossa equipe já foi notificada. Por favor, recarregue a página.</p>
-          <button 
-            className="btn btn-primary mt-3"
-            onClick={() => window.location.reload()}
-          >
-            Recarregar
-          </button>
-        </div>
-      );
-    }
-
-    return this.props.children;
-  }
+  public render() {}
 }
 
killedBy: ErrorBoundary renders children if no error
statusReason: Unable to find an element with the text: Safe. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
src/components/ErrorBoundary.tsx:25:9
   }
 
   public render() {
-    if (this.state.hasError) {
+    if (false) {
       return (
         <div style={{ padding: '2rem', textAlign: 'center', fontFamily: 'sans-serif', marginTop: '10%' }}>
killedBy: ErrorBoundary catches error and renders fallback
statusReason: Kaboom

[Killed] BlockStatement
src/components/ErrorBoundary.tsx:25:30
   }
 
   public render() {
-    if (this.state.hasError) {
-      return (
-        <div style={{ padding: '2rem', textAlign: 'center', fontFamily: 'sans-serif', marginTop: '10%' }}>
-          <h2>Oops! Algo deu errado.</h2>
-          <p className="text-muted">Nossa equipe já foi notificada. Por favor, recarregue a página.</p>
-          <button 
-            className="btn btn-primary mt-3"
-            onClick={() => window.location.reload()}
-          >
-            Recarregar
-          </button>
-        </div>
-      );
-    }
+    if (this.state.hasError) {}
 
     return this.props.children;
killedBy: ErrorBoundary catches error and renders fallback
statusReason: Kaboom

[Survived] StringLiteral
src/components/ErrorBoundary.tsx:27:73
   public render() {
     if (this.state.hasError) {
       return (
-        <div style={{ padding: '2rem', textAlign: 'center', fontFamily: 'sans-serif', marginTop: '10%' }}>
+        <div style={{ padding: '2rem', textAlign: 'center', fontFamily: "", marginTop: '10%' }}>
           <h2>Oops! Algo deu errado.</h2>
           <p className="text-muted">Nossa equipe já foi notificada. Por favor, recarregue a página.</p>

[Killed] ArrowFunction
src/components/ErrorBoundary.tsx:32:22
           <p className="text-muted">Nossa equipe já foi notificada. Por favor, recarregue a página.</p>
           <button 
             className="btn btn-primary mt-3"
-            onClick={() => window.location.reload()}
+            onClick={() => undefined}
           >
             Recarregar
killedBy: ErrorBoundary reloads page on click
statusReason: expected "vi.fn()" to be called at least once
