[Survived] StringLiteral
src/pages/About.tsx:5:18
   return (
     <div
       style={{
-        padding: '40px 20px',
+        padding: "",
         maxWidth: '800px',
         margin: '0 auto',

[Survived] StringLiteral
src/pages/About.tsx:16:25
         href="/"
         style={{
           display: 'inline-block',
-          marginBottom: '24px',
+          marginBottom: "",
           color: 'var(--accent)',
           textDecoration: 'none',

[Survived] ObjectLiteral
src/pages/About.tsx:26:17
       </a>
 
       <h1>Sobre o Projeto EdTech</h1>
-      <p style={{ fontSize: '18px', lineHeight: '1.6', marginBottom: '40px' }}>
+      <p style={{}}>
         O EdTech é uma plataforma moderna desenvolvida para simplificar o envio, análise
         e aprovação de documentos acadêmicos entre orientadores e pesquisadores, promovendo um fluxo

[Survived] StringLiteral
src/pages/About.tsx:26:70
       </a>
 
       <h1>Sobre o Projeto EdTech</h1>
-      <p style={{ fontSize: '18px', lineHeight: '1.6', marginBottom: '40px' }}>
+      <p style={{ fontSize: '18px', lineHeight: '1.6', marginBottom: "" }}>
         O EdTech é uma plataforma moderna desenvolvida para simplificar o envio, análise
         e aprovação de documentos acadêmicos entre orientadores e pesquisadores, promovendo um fluxo

[Survived] StringLiteral
src/pages/About.tsx:33:30
       </p>
 
       <h2>Equipe AILAB Makers</h2>
-      <div style={{ display: 'flex', flexDirection: 'column', gap: '20px', marginTop: '20px' }}>
+      <div style={{ display: "", flexDirection: 'column', gap: '20px', marginTop: '20px' }}>
         <div
           style={{

[Survived] StringLiteral
src/pages/About.tsx:37:21
         <div
           style={{
             padding: '16px',
-            border: '1px solid var(--border)',
+            border: "",
             borderRadius: '8px',
             backgroundColor: 'var(--code-bg)',

[Survived] ObjectLiteral
src/pages/About.tsx:42:22
             backgroundColor: 'var(--code-bg)',
           }}
         >
-          <h3 style={{ margin: '0 0 8px 0', color: 'var(--text-h)' }}>Pedro Henrique P. Santos</h3>
+          <h3 style={{}}>Pedro Henrique P. Santos</h3>
           <p style={{ margin: 0, fontSize: '14px', color: 'var(--accent)' }}>Tech Lead</p>
         </div>

[Survived] ObjectLiteral
src/pages/About.tsx:43:21
           }}
         >
           <h3 style={{ margin: '0 0 8px 0', color: 'var(--text-h)' }}>Pedro Henrique P. Santos</h3>
-          <p style={{ margin: 0, fontSize: '14px', color: 'var(--accent)' }}>Tech Lead</p>
+          <p style={{}}>Tech Lead</p>
         </div>
 

[Survived] StringLiteral
src/pages/About.tsx:46:89
           <p style={{ margin: 0, fontSize: '14px', color: 'var(--accent)' }}>Tech Lead</p>
         </div>
 
-        <div style={{ padding: '16px', border: '1px solid var(--border)', borderRadius: '8px' }}>
+        <div style={{ padding: '16px', border: '1px solid var(--border)', borderRadius: "" }}>
           <h3 style={{ margin: '0 0 8px 0', color: 'var(--text-h)' }}>
             Arthur Leite (arthurlleite)

[Survived] StringLiteral
src/pages/About.tsx:46:48
           <p style={{ margin: 0, fontSize: '14px', color: 'var(--accent)' }}>Tech Lead</p>
         </div>
 
-        <div style={{ padding: '16px', border: '1px solid var(--border)', borderRadius: '8px' }}>
+        <div style={{ padding: '16px', border: "", borderRadius: '8px' }}>
           <h3 style={{ margin: '0 0 8px 0', color: 'var(--text-h)' }}>
             Arthur Leite (arthurlleite)

[Survived] ObjectLiteral
src/pages/About.tsx:47:22
         </div>
 
         <div style={{ padding: '16px', border: '1px solid var(--border)', borderRadius: '8px' }}>
-          <h3 style={{ margin: '0 0 8px 0', color: 'var(--text-h)' }}>
+          <h3 style={{}}>
             Arthur Leite (arthurlleite)
           </h3>

[Survived] StringLiteral
src/pages/About.tsx:47:52
         </div>
 
         <div style={{ padding: '16px', border: '1px solid var(--border)', borderRadius: '8px' }}>
-          <h3 style={{ margin: '0 0 8px 0', color: 'var(--text-h)' }}>
+          <h3 style={{ margin: '0 0 8px 0', color: "" }}>
             Arthur Leite (arthurlleite)
           </h3>

[Survived] StringLiteral
src/pages/About.tsx:53:32
           <p style={{ margin: 0, fontSize: '14px' }}>Padawan - FullStack</p>
         </div>
 
-        <div style={{ padding: '16px', border: '1px solid var(--border)', borderRadius: '8px' }}>
+        <div style={{ padding: "", border: '1px solid var(--border)', borderRadius: '8px' }}>
           <h3 style={{ margin: '0 0 8px 0', color: 'var(--text-h)' }}>
             Alana Feitosa (alanafeitosa-ui)

[Survived] ObjectLiteral
src/pages/About.tsx:60:21
           <p style={{ margin: 0, fontSize: '14px' }}>Padawan - FullStack</p>
         </div>
 
-        <div style={{ padding: '16px', border: '1px solid var(--border)', borderRadius: '8px' }}>
+        <div style={{}}>
           <h3 style={{ margin: '0 0 8px 0', color: 'var(--text-h)' }}>
             Mateus Araújo (mateusaraujo2006)

[Survived] ObjectLiteral
src/pages/About.tsx:64:21
           <h3 style={{ margin: '0 0 8px 0', color: 'var(--text-h)' }}>
             Mateus Araújo (mateusaraujo2006)
           </h3>
-          <p style={{ margin: 0, fontSize: '14px' }}>Padawan - FullStack</p>
+          <p style={{}}>Padawan - FullStack</p>
         </div>
 

[Survived] StringLiteral
src/pages/About.tsx:68:32
         </div>
 
         <div style={{ padding: '16px', border: '1px solid var(--border)', borderRadius: '8px' }}>
-          <h3 style={{ margin: '0 0 8px 0', color: 'var(--text-h)' }}>
+          <h3 style={{ margin: "", color: 'var(--text-h)' }}>
             Mariana Farias (mariana-farias12)
           </h3>
