[Survived] StringLiteral
src/pages/analytics.tsx:7:63
 
 export default function Analytics() {
   const customTopbar = (
-    <div style={{ display: 'flex', alignItems: 'center', gap: '8px' }}>
+    <div style={{ display: 'flex', alignItems: 'center', gap: "" }}>
       <button 
         style={{ 

[Survived] StringLiteral
src/pages/analytics.tsx:12:20
         style={{ 
           background: 'transparent', 
           border: '1px solid var(--border)', 
-          padding: '6px 12px', 
+          padding: "", 
           borderRadius: '8px',
           fontSize: '13px',

[Survived] ObjectLiteral
src/pages/analytics.tsx:22:66
           cursor: 'pointer'
         }}
       >
-        Últimos 6 meses <i className="bi bi-chevron-down" style={{ fontSize: '10px' }}></i>
+        Últimos 6 meses <i className="bi bi-chevron-down" style={{}}></i>
       </button>
     </div>

[Survived] StringLiteral
src/pages/analytics.tsx:56:32
             </div>
             <div className={styles.kpiBody}>
               <span className={styles.kpiValue}>15%</span>
-              <span className={`${styles.kpiTrend} ${styles.positive}`}>-17 pts</span>
+              <span className={``}>-17 pts</span>
             </div>
           </div>

[Survived] StringLiteral
src/pages/analytics.tsx:63:67
           <div className={styles.kpiCard}>
             <div className={styles.kpiHeader}>
               <span>Pesquisadores ativos</span>
-              <i className="bi bi-people kpiIcon" style={{ color: 'var(--ed-status-info)' }}></i>
+              <i className="bi bi-people kpiIcon" style={{ color: "" }}></i>
             </div>
             <div className={styles.kpiBody}>

[Survived] ObjectLiteral
src/pages/analytics.tsx:63:58
           <div className={styles.kpiCard}>
             <div className={styles.kpiHeader}>
               <span>Pesquisadores ativos</span>
-              <i className="bi bi-people kpiIcon" style={{ color: 'var(--ed-status-info)' }}></i>
+              <i className="bi bi-people kpiIcon" style={{}}></i>
             </div>
             <div className={styles.kpiBody}>

[Survived] StringLiteral
src/pages/analytics.tsx:67:128
             </div>
             <div className={styles.kpiBody}>
               <span className={styles.kpiValue}>42</span>
-              <span className={`${styles.kpiTrend} ${styles.positive}`} style={{ background: 'rgba(59, 130, 246, 0.1)', color: 'var(--ed-status-info)' }}>+6</span>
+              <span className={`${styles.kpiTrend} ${styles.positive}`} style={{ background: 'rgba(59, 130, 246, 0.1)', color: "" }}>+6</span>
             </div>
           </div>

[Survived] ObjectLiteral
src/pages/analytics.tsx:77:56
               <i className="bi bi-exclamation-triangle kpiIcon" style={{ color: 'var(--ed-orange)' }}></i>
             </div>
             <div className={styles.kpiBody}>
-              <span className={styles.kpiValue} style={{ fontSize: '24px' }}>Revisão</span>
+              <span className={styles.kpiValue} style={{}}>Revisão</span>
               <span className={`${styles.kpiTrend} ${styles.warning}`}>78% carga</span>
             </div>

[Survived] StringLiteral
src/pages/analytics.tsx:212:98
               <div className={styles.barRow}>
                 <span className={styles.barLabel}>J. Mendes</span>
                 <div className={styles.barTrack}>
-                  <div className={`${styles.barFill} ${styles.fillPurpleLight}`} style={{ width: '70%' }}></div>
+                  <div className={`${styles.barFill} ${styles.fillPurpleLight}`} style={{ width: "" }}></div>
                 </div>
               </div>

[Survived] StringLiteral
src/pages/analytics.tsx:224:98
               <div className={styles.barRow}>
                 <span className={styles.barLabel}>L. Rocha</span>
                 <div className={styles.barTrack}>
-                  <div className={`${styles.barFill} ${styles.fillPurpleLight}`} style={{ width: '45%' }}></div>
+                  <div className={`${styles.barFill} ${styles.fillPurpleLight}`} style={{ width: "" }}></div>
                 </div>
               </div>

[Survived] ObjectLiteral
src/pages/analytics.tsx:234:27
                 </div>
               </div>
               
-              <div style={{ display: 'flex', justifyContent: 'space-between', paddingLeft: '96px', marginTop: '10px' }}>
+              <div style={{}}>
                 <span className={styles.svgAxisText}>0</span>
                 <span className={styles.svgAxisText}>5</span>

[Survived] StringLiteral
src/pages/analytics.tsx:234:62
                 </div>
               </div>
               
-              <div style={{ display: 'flex', justifyContent: 'space-between', paddingLeft: '96px', marginTop: '10px' }}>
+              <div style={{ display: 'flex', justifyContent: "", paddingLeft: '96px', marginTop: '10px' }}>
                 <span className={styles.svgAxisText}>0</span>
                 <span className={styles.svgAxisText}>5</span>

[Survived] StringLiteral
src/pages/analytics.tsx:255:107
             
             <div className={styles.barChartContainer}>
               <div className={styles.barRow}>
-                <span className={styles.barLabel} style={{ width: '130px', textAlign: 'left', fontWeight: '500' }}>Rascunho → Submissão</span>
+                <span className={styles.barLabel} style={{ width: '130px', textAlign: 'left', fontWeight: "" }}>Rascunho → Submissão</span>
                 <div className={styles.barTrack}>
                   <div className={`${styles.barFill} ${styles.fillPurpleLight}`} style={{ width: '20%' }}></div>

[Survived] ObjectLiteral
src/pages/analytics.tsx:255:58
             
             <div className={styles.barChartContainer}>
               <div className={styles.barRow}>
-                <span className={styles.barLabel} style={{ width: '130px', textAlign: 'left', fontWeight: '500' }}>Rascunho → Submissão</span>
+                <span className={styles.barLabel} style={{}}>Rascunho → Submissão</span>
                 <div className={styles.barTrack}>
                   <div className={`${styles.barFill} ${styles.fillPurpleLight}`} style={{ width: '20%' }}></div>

[Survived] StringLiteral
src/pages/analytics.tsx:257:35
               <div className={styles.barRow}>
                 <span className={styles.barLabel} style={{ width: '130px', textAlign: 'left', fontWeight: '500' }}>Rascunho → Submissão</span>
                 <div className={styles.barTrack}>
-                  <div className={`${styles.barFill} ${styles.fillPurpleLight}`} style={{ width: '20%' }}></div>
+                  <div className={``} style={{ width: '20%' }}></div>
                 </div>
                 <span className={styles.svgAxisText} style={{ width: '40px' }}>1.2 dias</span>

[Survived] ObjectLiteral
src/pages/analytics.tsx:263:58
               </div>
               
               <div className={styles.barRow}>
-                <span className={styles.barLabel} style={{ width: '130px', textAlign: 'left', fontWeight: '500' }}>Submissão → Revisão</span>
+                <span className={styles.barLabel} style={{}}>Submissão → Revisão</span>
                 <div className={styles.barTrack}>
                   <div className={`${styles.barFill} ${styles.fillOrange}`} style={{ width: '80%' }}></div>

[Survived] StringLiteral
src/pages/analytics.tsx:263:107
               </div>
               
               <div className={styles.barRow}>
-                <span className={styles.barLabel} style={{ width: '130px', textAlign: 'left', fontWeight: '500' }}>Submissão → Revisão</span>
+                <span className={styles.barLabel} style={{ width: '130px', textAlign: 'left', fontWeight: "" }}>Submissão → Revisão</span>
                 <div className={styles.barTrack}>
                   <div className={`${styles.barFill} ${styles.fillOrange}`} style={{ width: '80%' }}></div>

[Survived] StringLiteral
src/pages/analytics.tsx:271:107
               </div>
               
               <div className={styles.barRow}>
-                <span className={styles.barLabel} style={{ width: '130px', textAlign: 'left', fontWeight: '500' }}>Revisão → Aprovação</span>
+                <span className={styles.barLabel} style={{ width: '130px', textAlign: 'left', fontWeight: "" }}>Revisão → Aprovação</span>
                 <div className={styles.barTrack}>
                   <div className={`${styles.barFill} ${styles.fillOrange}`} style={{ width: '50%' }}></div>

[Survived] StringLiteral
src/pages/analytics.tsx:273:93
               <div className={styles.barRow}>
                 <span className={styles.barLabel} style={{ width: '130px', textAlign: 'left', fontWeight: '500' }}>Revisão → Aprovação</span>
                 <div className={styles.barTrack}>
-                  <div className={`${styles.barFill} ${styles.fillOrange}`} style={{ width: '50%' }}></div>
+                  <div className={`${styles.barFill} ${styles.fillOrange}`} style={{ width: "" }}></div>
                 </div>
                 <span className={styles.svgAxisText} style={{ width: '40px' }}>2.1 dias</span>

[Survived] StringLiteral
src/pages/analytics.tsx:273:35
               <div className={styles.barRow}>
                 <span className={styles.barLabel} style={{ width: '130px', textAlign: 'left', fontWeight: '500' }}>Revisão → Aprovação</span>
                 <div className={styles.barTrack}>
-                  <div className={`${styles.barFill} ${styles.fillOrange}`} style={{ width: '50%' }}></div>
+                  <div className={``} style={{ width: '50%' }}></div>
                 </div>
                 <span className={styles.svgAxisText} style={{ width: '40px' }}>2.1 dias</span>

[Survived] ObjectLiteral
src/pages/analytics.tsx:279:58
               </div>
               
               <div className={styles.barRow}>
-                <span className={styles.barLabel} style={{ width: '130px', textAlign: 'left', fontWeight: '500' }}>Aprovação → Arquivo</span>
+                <span className={styles.barLabel} style={{}}>Aprovação → Arquivo</span>
                 <div className={styles.barTrack}>
                   <div className={`${styles.barFill} ${styles.fillPurpleLight}`} style={{ width: '10%' }}></div>

[Survived] StringLiteral
src/pages/analytics.tsx:281:35
               <div className={styles.barRow}>
                 <span className={styles.barLabel} style={{ width: '130px', textAlign: 'left', fontWeight: '500' }}>Aprovação → Arquivo</span>
                 <div className={styles.barTrack}>
-                  <div className={`${styles.barFill} ${styles.fillPurpleLight}`} style={{ width: '10%' }}></div>
+                  <div className={``} style={{ width: '10%' }}></div>
                 </div>
                 <span className={styles.svgAxisText} style={{ width: '40px' }}>0.4 dias</span>

[Survived] ObjectLiteral
src/pages/analytics.tsx:281:89
               <div className={styles.barRow}>
                 <span className={styles.barLabel} style={{ width: '130px', textAlign: 'left', fontWeight: '500' }}>Aprovação → Arquivo</span>
                 <div className={styles.barTrack}>
-                  <div className={`${styles.barFill} ${styles.fillPurpleLight}`} style={{ width: '10%' }}></div>
+                  <div className={`${styles.barFill} ${styles.fillPurpleLight}`} style={{}}></div>
                 </div>
                 <span className={styles.svgAxisText} style={{ width: '40px' }}>0.4 dias</span>

[Survived] StringLiteral
src/pages/analytics.tsx:283:70
                 <div className={styles.barTrack}>
                   <div className={`${styles.barFill} ${styles.fillPurpleLight}`} style={{ width: '10%' }}></div>
                 </div>
-                <span className={styles.svgAxisText} style={{ width: '40px' }}>0.4 dias</span>
+                <span className={styles.svgAxisText} style={{ width: "" }}>0.4 dias</span>
               </div>
             </div>
