[Killed] BlockStatement
src/pages/compliance.tsx:9:19
 const ComplianceCenter: React.FC = () => {
   const [stats, setStats] = useState<any>(null);
 
-  useEffect(() => {
-    const fetchStats = async () => {
-      const data = await getComplianceStats();
-      if (data) setStats(data);
-    };
-    fetchStats();
-  }, []);
+  useEffect(() => {}, []);
 
   if (!stats) return null; // or a loader
killedBy: ComplianceCenter Page renders compliance stats after loading
statusReason: Unable to find an element by: [data-testid="dashboard-layout"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BlockStatement
src/pages/compliance.tsx:10:36
   const [stats, setStats] = useState<any>(null);
 
   useEffect(() => {
-    const fetchStats = async () => {
-      const data = await getComplianceStats();
-      if (data) setStats(data);
-    };
+    const fetchStats = async () => {};
     fetchStats();
   }, []);
killedBy: ComplianceCenter Page renders compliance stats after loading
statusReason: Unable to find an element by: [data-testid="dashboard-layout"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/pages/compliance.tsx:12:11
   useEffect(() => {
     const fetchStats = async () => {
       const data = await getComplianceStats();
-      if (data) setStats(data);
+      if (false) setStats(data);
     };
     fetchStats();
killedBy: ComplianceCenter Page renders compliance stats after loading
statusReason: Unable to find an element by: [data-testid="dashboard-layout"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Survived] ConditionalExpression
src/pages/compliance.tsx:12:11
   useEffect(() => {
     const fetchStats = async () => {
       const data = await getComplianceStats();
-      if (data) setStats(data);
+      if (true) setStats(data);
     };
     fetchStats();

[Survived] ArrayDeclaration
src/pages/compliance.tsx:15:6
       if (data) setStats(data);
     };
     fetchStats();
-  }, []);
+  }, ["Stryker was here"]);
 
   if (!stats) return null; // or a loader

[Killed] BooleanLiteral
src/pages/compliance.tsx:17:7
     fetchStats();
   }, []);
 
-  if (!stats) return null; // or a loader
+  if (stats) return null; // or a loader
 
   return (
killedBy: ComplianceCenter Page renders nothing initially when stats are not loaded
statusReason: Cannot read properties of null (reading 'score')

[Killed] ConditionalExpression
src/pages/compliance.tsx:17:7
     fetchStats();
   }, []);
 
-  if (!stats) return null; // or a loader
+  if (true) return null; // or a loader
 
   return (
killedBy: ComplianceCenter Page renders compliance stats after loading
statusReason: Unable to find an element by: [data-testid="dashboard-layout"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Survived] StringLiteral
src/pages/compliance.tsx:25:67
       subtitle="Conformidade institucional, LGPD e ética em pesquisa"
       breadcrumbs={['EdTech', 'Centro de Conformidade']}
       customTopbarElement={
-        <div style={{ display: 'flex', alignItems: 'center', gap: '16px' }}>
+        <div style={{ display: 'flex', alignItems: 'center', gap: "" }}>
           <button className="audit-btn audit-btn-outline">
             <i className="bi bi-download"></i> Relatório de conformidade

[Survived] ObjectLiteral
src/pages/compliance.tsx:25:21
       subtitle="Conformidade institucional, LGPD e ética em pesquisa"
       breadcrumbs={['EdTech', 'Centro de Conformidade']}
       customTopbarElement={
-        <div style={{ display: 'flex', alignItems: 'center', gap: '16px' }}>
+        <div style={{}}>
           <button className="audit-btn audit-btn-outline">
             <i className="bi bi-download"></i> Relatório de conformidade

[Killed] ArrowFunction
src/pages/compliance.tsx:85:31
         <p className="compliance-section-subtitle">Cobertura por política regulatória</p>
         
         <div className="policy-list">
-          {stats.policies.map((policy: any, index: number) => (
-            <div className="policy-item" key={index}>
-              <div className="policy-header">
-                <div className="policy-name-wrapper">
-                  <span className="policy-name">{policy.name}</span>
-                  <span className={`policy-badge ${policy.status}`}>
-                    {policy.status === 'conforme' && <i className="bi bi-check-circle"></i>}
-                    {policy.status === 'parcial' && <i className="bi bi-exclamation-circle"></i>}
-                    {policy.status === 'pendente' && <i className="bi bi-x-circle"></i>}
-                    {' '}{policy.status.charAt(0).toUpperCase() + policy.status.slice(1)}
-                  </span>
-                </div>
-                <div className="policy-stats">
-                  <span className="percent">{policy.percentage}%</span>
-                  <span className="subtext">{policy.text}</span>
-                </div>
-              </div>
-              <div className="policy-progress-bar-bg">
-                <div className={`policy-progress-bar-fill ${policy.status}`} style={{ width: `${policy.percentage}%` }}></div>
-              </div>
-            </div>
-          ))}
+          {stats.policies.map(() => undefined)}
         </div>
       </div>
killedBy: ComplianceCenter Page renders compliance stats after loading
statusReason: Unable to find an element with the text: Policy 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] ConditionalExpression
src/pages/compliance.tsx:91:22
                 <div className="policy-name-wrapper">
                   <span className="policy-name">{policy.name}</span>
                   <span className={`policy-badge ${policy.status}`}>
-                    {policy.status === 'conforme' && <i className="bi bi-check-circle"></i>}
+                    {false}
                     {policy.status === 'parcial' && <i className="bi bi-exclamation-circle"></i>}
                     {policy.status === 'pendente' && <i className="bi bi-x-circle"></i>}

[Survived] LogicalOperator
src/pages/compliance.tsx:91:22
                 <div className="policy-name-wrapper">
                   <span className="policy-name">{policy.name}</span>
                   <span className={`policy-badge ${policy.status}`}>
-                    {policy.status === 'conforme' && <i className="bi bi-check-circle"></i>}
+                    {policy.status === 'conforme' || <i className="bi bi-check-circle"></i>}
                     {policy.status === 'parcial' && <i className="bi bi-exclamation-circle"></i>}
                     {policy.status === 'pendente' && <i className="bi bi-x-circle"></i>}

[Survived] ConditionalExpression
src/pages/compliance.tsx:92:22
                   <span className="policy-name">{policy.name}</span>
                   <span className={`policy-badge ${policy.status}`}>
                     {policy.status === 'conforme' && <i className="bi bi-check-circle"></i>}
-                    {policy.status === 'parcial' && <i className="bi bi-exclamation-circle"></i>}
+                    {true}
                     {policy.status === 'pendente' && <i className="bi bi-x-circle"></i>}
                     {' '}{policy.status.charAt(0).toUpperCase() + policy.status.slice(1)}

[Survived] ConditionalExpression
src/pages/compliance.tsx:92:22
                   <span className="policy-name">{policy.name}</span>
                   <span className={`policy-badge ${policy.status}`}>
                     {policy.status === 'conforme' && <i className="bi bi-check-circle"></i>}
-                    {policy.status === 'parcial' && <i className="bi bi-exclamation-circle"></i>}
+                    {true && <i className="bi bi-exclamation-circle"></i>}
                     {policy.status === 'pendente' && <i className="bi bi-x-circle"></i>}
                     {' '}{policy.status.charAt(0).toUpperCase() + policy.status.slice(1)}

[Survived] ConditionalExpression
src/pages/compliance.tsx:93:22
                   <span className={`policy-badge ${policy.status}`}>
                     {policy.status === 'conforme' && <i className="bi bi-check-circle"></i>}
                     {policy.status === 'parcial' && <i className="bi bi-exclamation-circle"></i>}
-                    {policy.status === 'pendente' && <i className="bi bi-x-circle"></i>}
+                    {true}
                     {' '}{policy.status.charAt(0).toUpperCase() + policy.status.slice(1)}
                   </span>

[Survived] ConditionalExpression
src/pages/compliance.tsx:93:22
                   <span className={`policy-badge ${policy.status}`}>
                     {policy.status === 'conforme' && <i className="bi bi-check-circle"></i>}
                     {policy.status === 'parcial' && <i className="bi bi-exclamation-circle"></i>}
-                    {policy.status === 'pendente' && <i className="bi bi-x-circle"></i>}
+                    {true && <i className="bi bi-x-circle"></i>}
                     {' '}{policy.status.charAt(0).toUpperCase() + policy.status.slice(1)}
                   </span>

[Survived] MethodExpression
src/pages/compliance.tsx:94:67
                     {policy.status === 'conforme' && <i className="bi bi-check-circle"></i>}
                     {policy.status === 'parcial' && <i className="bi bi-exclamation-circle"></i>}
                     {policy.status === 'pendente' && <i className="bi bi-x-circle"></i>}
-                    {' '}{policy.status.charAt(0).toUpperCase() + policy.status.slice(1)}
+                    {' '}{policy.status.charAt(0).toUpperCase() + policy.status}
                   </span>
                 </div>

[Survived] MethodExpression
src/pages/compliance.tsx:94:27
                     {policy.status === 'conforme' && <i className="bi bi-check-circle"></i>}
                     {policy.status === 'parcial' && <i className="bi bi-exclamation-circle"></i>}
                     {policy.status === 'pendente' && <i className="bi bi-x-circle"></i>}
-                    {' '}{policy.status.charAt(0).toUpperCase() + policy.status.slice(1)}
+                    {' '}{policy.status.charAt(0).toLowerCase() + policy.status.slice(1)}
                   </span>
                 </div>

[Survived] StringLiteral
src/pages/compliance.tsx:103:33
                 </div>
               </div>
               <div className="policy-progress-bar-bg">
-                <div className={`policy-progress-bar-fill ${policy.status}`} style={{ width: `${policy.percentage}%` }}></div>
+                <div className={``} style={{ width: `${policy.percentage}%` }}></div>
               </div>
             </div>

[Survived] ObjectLiteral
src/pages/compliance.tsx:103:85
                 </div>
               </div>
               <div className="policy-progress-bar-bg">
-                <div className={`policy-progress-bar-fill ${policy.status}`} style={{ width: `${policy.percentage}%` }}></div>
+                <div className={`policy-progress-bar-fill ${policy.status}`} style={{}}></div>
               </div>
             </div>
