[Survived] BooleanLiteral
src/pages/projects.tsx:8:42
 
 export default function Projects() {
   const [projects, setProjects] = useState<Project[]>([]);
-  const [loading, setLoading] = useState(true);
+  const [loading, setLoading] = useState(false);
   const [toastMessage, setToastMessage] = useState('');
 

[Survived] StringLiteral
src/pages/projects.tsx:9:52
 export default function Projects() {
   const [projects, setProjects] = useState<Project[]>([]);
   const [loading, setLoading] = useState(true);
-  const [toastMessage, setToastMessage] = useState('');
+  const [toastMessage, setToastMessage] = useState("Stryker was here!");
 
   const loadProjects = async () => {

[Killed] BlockStatement
src/pages/projects.tsx:11:36
   const [loading, setLoading] = useState(true);
   const [toastMessage, setToastMessage] = useState('');
 
-  const loadProjects = async () => {
-    setLoading(true);
-    const resp = await getProjects();
-    if (resp.sucesso) {
-      setProjects(resp.dados || []);
-    }
-    setLoading(false);
-  };
+  const loadProjects = async () => {};
 
   useEffect(() => {
killedBy: Projects Page renders no projects message when empty
statusReason: Unable to find an element with the text: Nenhum projeto encontrado.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BooleanLiteral
src/pages/projects.tsx:12:16
   const [toastMessage, setToastMessage] = useState('');
 
   const loadProjects = async () => {
-    setLoading(true);
+    setLoading(false);
     const resp = await getProjects();
     if (resp.sucesso) {
killedBy: Projects Page shows loading state initially
statusReason: Unable to find an element with the text: Carregando projetos.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/projects.tsx:14:23
   const loadProjects = async () => {
     setLoading(true);
     const resp = await getProjects();
-    if (resp.sucesso) {
-      setProjects(resp.dados || []);
-    }
+    if (resp.sucesso) {}
     setLoading(false);
   };
killedBy: Projects Page renders projects and handles join success
statusReason: Unable to find an element with the text: Project 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/projects.tsx:14:9
   const loadProjects = async () => {
     setLoading(true);
     const resp = await getProjects();
-    if (resp.sucesso) {
+    if (false) {
       setProjects(resp.dados || []);
     }
killedBy: Projects Page renders projects and handles join success
statusReason: Unable to find an element with the text: Project 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/projects.tsx:15:19
     setLoading(true);
     const resp = await getProjects();
     if (resp.sucesso) {
-      setProjects(resp.dados || []);
+      setProjects(false);
     }
     setLoading(false);
killedBy: Projects Page shows loading state initially
statusReason: projects.map is not a function

[Killed] LogicalOperator
src/pages/projects.tsx:15:19
     setLoading(true);
     const resp = await getProjects();
     if (resp.sucesso) {
-      setProjects(resp.dados || []);
+      setProjects(resp.dados && []);
     }
     setLoading(false);
killedBy: Projects Page renders fallback to empty array if dados is undefined
statusReason: Unable to find an element with the text: Nenhum projeto encontrado.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BooleanLiteral
src/pages/projects.tsx:17:16
     if (resp.sucesso) {
       setProjects(resp.dados || []);
     }
-    setLoading(false);
+    setLoading(true);
   };
 
killedBy: Projects Page renders no projects message when empty
statusReason: Unable to find an element with the text: Nenhum projeto encontrado.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/projects.tsx:20:19
     setLoading(false);
   };
 
-  useEffect(() => {
-    loadProjects();
-  }, []);
+  useEffect(() => {}, []);
 
   const showToast = (message: string) => {
killedBy: Projects Page renders no projects message when empty
statusReason: Unable to find an element with the text: Nenhum projeto encontrado.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/projects.tsx:29:51
     setTimeout(() => setToastMessage(''), 3000);
   };
 
-  const handleJoin = async (projectId: string) => {
-    const resp = await joinProject(projectId);
-    if (resp.sucesso) {
-      showToast('Associado ao projeto com sucesso!');
-      loadProjects();
-    } else {
-      showToast('Erro: ' + resp.mensagem);
-    }
-  };
+  const handleJoin = async (projectId: string) => {};
 
   return (
killedBy: Projects Page renders projects and handles join success
statusReason: expected "vi.fn()" to be called with arguments: [ '1' ]

Number of calls: 0

[Killed] ConditionalExpression
src/pages/projects.tsx:31:9
 
   const handleJoin = async (projectId: string) => {
     const resp = await joinProject(projectId);
-    if (resp.sucesso) {
+    if (true) {
       showToast('Associado ao projeto com sucesso!');
       loadProjects();
killedBy: Projects Page handles join failure
statusReason: Unable to find an element with the text: Erro: Error joining. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/projects.tsx:31:9
 
   const handleJoin = async (projectId: string) => {
     const resp = await joinProject(projectId);
-    if (resp.sucesso) {
+    if (false) {
       showToast('Associado ao projeto com sucesso!');
       loadProjects();
killedBy: Projects Page renders projects and handles join success
statusReason: Unable to find an element with the text: Associado ao projeto com sucesso!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] StringLiteral
src/pages/projects.tsx:32:17
   const handleJoin = async (projectId: string) => {
     const resp = await joinProject(projectId);
     if (resp.sucesso) {
-      showToast('Associado ao projeto com sucesso!');
+      showToast("");
       loadProjects();
     } else {
killedBy: Projects Page renders projects and handles join success
statusReason: Unable to find an element with the text: Associado ao projeto com sucesso!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] BlockStatement
src/pages/projects.tsx:34:12
     if (resp.sucesso) {
       showToast('Associado ao projeto com sucesso!');
       loadProjects();
-    } else {
-      showToast('Erro: ' + resp.mensagem);
-    }
+    } else {}
   };
 
killedBy: Projects Page handles join failure
statusReason: Unable to find an element with the text: Erro: Error joining. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] ArrayDeclaration
src/pages/projects.tsx:43:20
     <DashboardLayout
       title="Projetos"
       subtitle="Descubra e associe-se a projetos de pesquisa ativos"
-      breadcrumbs={['EdTech', 'Projetos']}
+      breadcrumbs={[]}
     >
       <div className="dashboard-card p-4">

[Survived] StringLiteral
src/pages/projects.tsx:50:70
           Projetos Disponíveis
         </h3>
         {loading ? (
-          <div style={{ padding: '2rem', textAlign: 'center', color: 'var(--ed-text-muted)' }}>Carregando projetos...</div>
+          <div style={{ padding: '2rem', textAlign: 'center', color: "" }}>Carregando projetos...</div>
         ) : projects.length === 0 ? (
           <div style={{ padding: '2rem', textAlign: 'center', color: 'var(--ed-text-muted)' }}>Nenhum projeto encontrado.</div>

[Survived] ObjectLiteral
src/pages/projects.tsx:50:23
           Projetos Disponíveis
         </h3>
         {loading ? (
-          <div style={{ padding: '2rem', textAlign: 'center', color: 'var(--ed-text-muted)' }}>Carregando projetos...</div>
+          <div style={{}}>Carregando projetos...</div>
         ) : projects.length === 0 ? (
           <div style={{ padding: '2rem', textAlign: 'center', color: 'var(--ed-text-muted)' }}>Nenhum projeto encontrado.</div>

[Killed] ConditionalExpression
src/pages/projects.tsx:51:13
         </h3>
         {loading ? (
           <div style={{ padding: '2rem', textAlign: 'center', color: 'var(--ed-text-muted)' }}>Carregando projetos...</div>
-        ) : projects.length === 0 ? (
+        ) : false ? (
           <div style={{ padding: '2rem', textAlign: 'center', color: 'var(--ed-text-muted)' }}>Nenhum projeto encontrado.</div>
         ) : (
killedBy: Projects Page renders no projects message when empty
statusReason: Unable to find an element with the text: Nenhum projeto encontrado.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/projects.tsx:51:13
         </h3>
         {loading ? (
           <div style={{ padding: '2rem', textAlign: 'center', color: 'var(--ed-text-muted)' }}>Carregando projetos...</div>
-        ) : projects.length === 0 ? (
+        ) : true ? (
           <div style={{ padding: '2rem', textAlign: 'center', color: 'var(--ed-text-muted)' }}>Nenhum projeto encontrado.</div>
         ) : (
killedBy: Projects Page renders projects and handles join success
statusReason: Unable to find an element with the text: Project 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] ObjectLiteral
src/pages/projects.tsx:52:23
         {loading ? (
           <div style={{ padding: '2rem', textAlign: 'center', color: 'var(--ed-text-muted)' }}>Carregando projetos...</div>
         ) : projects.length === 0 ? (
-          <div style={{ padding: '2rem', textAlign: 'center', color: 'var(--ed-text-muted)' }}>Nenhum projeto encontrado.</div>
+          <div style={{}}>Nenhum projeto encontrado.</div>
         ) : (
           <div style={{ display: 'grid', gridTemplateColumns: 'repeat(auto-fill, minmax(300px, 1fr))', gap: '1.5rem' }}>

[Survived] StringLiteral
src/pages/projects.tsx:52:34
         {loading ? (
           <div style={{ padding: '2rem', textAlign: 'center', color: 'var(--ed-text-muted)' }}>Carregando projetos...</div>
         ) : projects.length === 0 ? (
-          <div style={{ padding: '2rem', textAlign: 'center', color: 'var(--ed-text-muted)' }}>Nenhum projeto encontrado.</div>
+          <div style={{ padding: "", textAlign: 'center', color: 'var(--ed-text-muted)' }}>Nenhum projeto encontrado.</div>
         ) : (
           <div style={{ display: 'grid', gridTemplateColumns: 'repeat(auto-fill, minmax(300px, 1fr))', gap: '1.5rem' }}>

[Survived] StringLiteral
src/pages/projects.tsx:54:34
         ) : projects.length === 0 ? (
           <div style={{ padding: '2rem', textAlign: 'center', color: 'var(--ed-text-muted)' }}>Nenhum projeto encontrado.</div>
         ) : (
-          <div style={{ display: 'grid', gridTemplateColumns: 'repeat(auto-fill, minmax(300px, 1fr))', gap: '1.5rem' }}>
+          <div style={{ display: "", gridTemplateColumns: 'repeat(auto-fill, minmax(300px, 1fr))', gap: '1.5rem' }}>
             {projects.map((project) => (
               <div key={project.id} style={{

[Survived] ObjectLiteral
src/pages/projects.tsx:56:44
         ) : (
           <div style={{ display: 'grid', gridTemplateColumns: 'repeat(auto-fill, minmax(300px, 1fr))', gap: '1.5rem' }}>
             {projects.map((project) => (
-              <div key={project.id} style={{
-                background: 'var(--ed-white)',
-                border: '1px solid var(--border)',
-                borderRadius: '12px',
-                padding: '1.5rem',
-                display: 'flex',
-                flexDirection: 'column',
-                gap: '1rem',
-                boxShadow: '0 2px 4px rgba(0,0,0,0.02)'
-              }}>
+              <div key={project.id} style={{}}>
                 <div style={{ display: 'flex', justifyContent: 'space-between', alignItems: 'flex-start' }}>
                   <div style={{ display: 'flex', alignItems: 'center', gap: '12px' }}>

[Survived] StringLiteral
src/pages/projects.tsx:59:31
               <div key={project.id} style={{
                 background: 'var(--ed-white)',
                 border: '1px solid var(--border)',
-                borderRadius: '12px',
+                borderRadius: "",
                 padding: '1.5rem',
                 display: 'flex',

[Survived] StringLiteral
src/pages/projects.tsx:60:26
                 background: 'var(--ed-white)',
                 border: '1px solid var(--border)',
                 borderRadius: '12px',
-                padding: '1.5rem',
+                padding: "",
                 display: 'flex',
                 flexDirection: 'column',

[Survived] StringLiteral
src/pages/projects.tsx:61:26
                 border: '1px solid var(--border)',
                 borderRadius: '12px',
                 padding: '1.5rem',
-                display: 'flex',
+                display: "",
                 flexDirection: 'column',
                 gap: '1rem',

[Survived] StringLiteral
src/pages/projects.tsx:64:28
                 display: 'flex',
                 flexDirection: 'column',
                 gap: '1rem',
-                boxShadow: '0 2px 4px rgba(0,0,0,0.02)'
+                boxShadow: ""
               }}>
                 <div style={{ display: 'flex', justifyContent: 'space-between', alignItems: 'flex-start' }}>

[Survived] StringLiteral
src/pages/projects.tsx:66:93
                 gap: '1rem',
                 boxShadow: '0 2px 4px rgba(0,0,0,0.02)'
               }}>
-                <div style={{ display: 'flex', justifyContent: 'space-between', alignItems: 'flex-start' }}>
+                <div style={{ display: 'flex', justifyContent: 'space-between', alignItems: "" }}>
                   <div style={{ display: 'flex', alignItems: 'center', gap: '12px' }}>

[Survived] ObjectLiteral
src/pages/projects.tsx:67:31
                 boxShadow: '0 2px 4px rgba(0,0,0,0.02)'
               }}>
                 <div style={{ display: 'flex', justifyContent: 'space-between', alignItems: 'flex-start' }}>
-                  <div style={{ display: 'flex', alignItems: 'center', gap: '12px' }}>
+                  <div style={{}}>
                       <i className="bi bi-briefcase"></i>

[Survived] ObjectLiteral
src/pages/projects.tsx:72:34
                       <i className="bi bi-briefcase"></i>
                     </div>
                     <div>
-                      <h4 style={{ margin: 0, fontSize: '1rem', fontWeight: 600, color: 'var(--ed-text-dark)' }}>{project.name}</h4>
+                      <h4 style={{}}>{project.name}</h4>
                       <span style={{ fontSize: '12px', color: 'var(--ed-text-muted)' }}>Criado em {project.createdAt ? new Date(project.createdAt).toLocaleDateString() : 'N/A'}</span>
                     </div>

[Killed] StringLiteral
src/pages/projects.tsx:73:171
                     </div>
                     <div>
                       <h4 style={{ margin: 0, fontSize: '1rem', fontWeight: 600, color: 'var(--ed-text-dark)' }}>{project.name}</h4>
-                      <span style={{ fontSize: '12px', color: 'var(--ed-text-muted)' }}>Criado em {project.createdAt ? new Date(project.createdAt).toLocaleDateString() : 'N/A'}</span>
+                      <span style={{ fontSize: '12px', color: 'var(--ed-text-muted)' }}>Criado em {project.createdAt ? new Date(project.createdAt).toLocaleDateString() : ""}</span>
                     </div>
                   </div>
killedBy: Projects Page renders projects and handles join success
statusReason: Unable to find an element with the text: /N\/A/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] StringLiteral
src/pages/projects.tsx:73:48
                     </div>
                     <div>
                       <h4 style={{ margin: 0, fontSize: '1rem', fontWeight: 600, color: 'var(--ed-text-dark)' }}>{project.name}</h4>
-                      <span style={{ fontSize: '12px', color: 'var(--ed-text-muted)' }}>Criado em {project.createdAt ? new Date(project.createdAt).toLocaleDateString() : 'N/A'}</span>
+                      <span style={{ fontSize: "", color: 'var(--ed-text-muted)' }}>Criado em {project.createdAt ? new Date(project.createdAt).toLocaleDateString() : 'N/A'}</span>
                     </div>
                   </div>

[Survived] StringLiteral
src/pages/projects.tsx:77:101
                     </div>
                   </div>
                 </div>
-                <p style={{ margin: 0, fontSize: '14px', color: 'var(--ed-text-muted)', lineHeight: '1.5' }}>
+                <p style={{ margin: 0, fontSize: '14px', color: 'var(--ed-text-muted)', lineHeight: "" }}>
                   {project.description}
                 </p>

[Killed] ArrowFunction
src/pages/projects.tsx:82:30
                 </p>
                 <div style={{ marginTop: 'auto', paddingTop: '1rem', borderTop: '1px solid var(--border)' }}>
                   <button 
-                    onClick={() => handleJoin(project.id)}
+                    onClick={() => undefined}
                     style={{
                       width: '100%',
killedBy: Projects Page renders projects and handles join success
statusReason: expected "vi.fn()" to be called with arguments: [ '1' ]

Number of calls: 0

[Survived] StringLiteral
src/pages/projects.tsx:92:32
                       borderRadius: '8px',
                       fontWeight: 500,
                       cursor: 'pointer',
-                      display: 'flex',
+                      display: "",
                       alignItems: 'center',
                       justifyContent: 'center',

[Survived] StringLiteral
src/pages/projects.tsx:95:28
                       display: 'flex',
                       alignItems: 'center',
                       justifyContent: 'center',
-                      gap: '8px',
+                      gap: "",
                       transition: 'background 0.2s'
                     }}

[Survived] ArrowFunction
src/pages/projects.tsx:98:34
                       gap: '8px',
                       transition: 'background 0.2s'
                     }}
-                    onMouseOver={(e) => e.currentTarget.style.background = 'var(--ed-purple-dark)'}
+                    onMouseOver={() => undefined}
                     onMouseOut={(e) => e.currentTarget.style.background = 'var(--ed-purple-main)'}
                   >

[Survived] StringLiteral
src/pages/projects.tsx:98:76
                       gap: '8px',
                       transition: 'background 0.2s'
                     }}
-                    onMouseOver={(e) => e.currentTarget.style.background = 'var(--ed-purple-dark)'}
+                    onMouseOver={(e) => e.currentTarget.style.background = ""}
                     onMouseOut={(e) => e.currentTarget.style.background = 'var(--ed-purple-main)'}
                   >

[Survived] ArrowFunction
src/pages/projects.tsx:99:33
                       transition: 'background 0.2s'
                     }}
                     onMouseOver={(e) => e.currentTarget.style.background = 'var(--ed-purple-dark)'}
-                    onMouseOut={(e) => e.currentTarget.style.background = 'var(--ed-purple-main)'}
+                    onMouseOut={() => undefined}
                   >
                     <i className="bi bi-person-plus"></i>

[Survived] StringLiteral
src/pages/projects.tsx:99:75
                       transition: 'background 0.2s'
                     }}
                     onMouseOver={(e) => e.currentTarget.style.background = 'var(--ed-purple-dark)'}
-                    onMouseOut={(e) => e.currentTarget.style.background = 'var(--ed-purple-main)'}
+                    onMouseOut={(e) => e.currentTarget.style.background = ""}
                   >
                     <i className="bi bi-person-plus"></i>

[Killed] ConditionalExpression
src/pages/projects.tsx:111:8
         )}
       </div>
 
-      {toastMessage && (
-        <div style={{
-          position: 'fixed',
-          bottom: '24px',
-          right: '24px',
-          background: 'var(--ed-text-dark)',
-          color: 'white',
-          padding: '12px 24px',
-          borderRadius: '8px',
-          display: 'flex',
-          alignItems: 'center',
-          gap: '12px',
-          boxShadow: '0 4px 12px rgba(0,0,0,0.15)',
-          zIndex: 1000,
-          animation: 'slideIn 0.3s ease'
-        }}>
-          <i className="bi bi-info-circle"></i>
-          <span>{toastMessage}</span>
-        </div>
-      )}
+      {true}
     </DashboardLayout>
   );
killedBy: Projects Page renders projects and handles join success
statusReason: Unable to find an element with the text: Associado ao projeto com sucesso!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/projects.tsx:111:8
         )}
       </div>
 
-      {toastMessage && (
-        <div style={{
-          position: 'fixed',
-          bottom: '24px',
-          right: '24px',
-          background: 'var(--ed-text-dark)',
-          color: 'white',
-          padding: '12px 24px',
-          borderRadius: '8px',
-          display: 'flex',
-          alignItems: 'center',
-          gap: '12px',
-          boxShadow: '0 4px 12px rgba(0,0,0,0.15)',
-          zIndex: 1000,
-          animation: 'slideIn 0.3s ease'
-        }}>
-          <i className="bi bi-info-circle"></i>
-          <span>{toastMessage}</span>
-        </div>
-      )}
+      {false}
     </DashboardLayout>
   );
killedBy: Projects Page renders projects and handles join success
statusReason: Unable to find an element with the text: Associado ao projeto com sucesso!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] StringLiteral
src/pages/projects.tsx:113:21
 
       {toastMessage && (
         <div style={{
-          position: 'fixed',
+          position: "",
           bottom: '24px',
           right: '24px',

[Survived] StringLiteral
src/pages/projects.tsx:114:19
       {toastMessage && (
         <div style={{
           position: 'fixed',
-          bottom: '24px',
+          bottom: "",
           right: '24px',
           background: 'var(--ed-text-dark)',

[Survived] StringLiteral
src/pages/projects.tsx:118:20
           right: '24px',
           background: 'var(--ed-text-dark)',
           color: 'white',
-          padding: '12px 24px',
+          padding: "",
           borderRadius: '8px',
           display: 'flex',

[Survived] StringLiteral
src/pages/projects.tsx:119:25
           background: 'var(--ed-text-dark)',
           color: 'white',
           padding: '12px 24px',
-          borderRadius: '8px',
+          borderRadius: "",
           display: 'flex',
           alignItems: 'center',

[Survived] StringLiteral
src/pages/projects.tsx:125:22
           gap: '12px',
           boxShadow: '0 4px 12px rgba(0,0,0,0.15)',
           zIndex: 1000,
-          animation: 'slideIn 0.3s ease'
+          animation: ""
         }}>
           <i className="bi bi-info-circle"></i>
