[Killed] StringLiteral
src/pages/trail.tsx:13:11
 
   const advisorDocuments = [
     {
-      id: '1',
+      id: "",
       title: 'Metodologia_Qualitativa_v3.pdf',
       project: 'R. Silva - Análise LGPD',
killedBy: ResearchTrail Page switches selected document and updates details
statusReason: Unable to find an element with the text: Timeline de decisões. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] StringLiteral
src/pages/trail.tsx:14:14
   const advisorDocuments = [
     {
       id: '1',
-      title: 'Metodologia_Qualitativa_v3.pdf',
+      title: "",
       project: 'R. Silva - Análise LGPD',
       status: 'Aprovado',
killedBy: ResearchTrail Page switches selected document and updates details
statusReason: Unable to find an element with the text: Metodologia_Qualitativa_v3.pdf. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] StringLiteral
src/pages/trail.tsx:15:16
     {
       id: '1',
       title: 'Metodologia_Qualitativa_v3.pdf',
-      project: 'R. Silva - Análise LGPD',
+      project: "",
       status: 'Aprovado',
       type: 'pdf',

[Survived] StringLiteral
src/pages/trail.tsx:16:15
       id: '1',
       title: 'Metodologia_Qualitativa_v3.pdf',
       project: 'R. Silva - Análise LGPD',
-      status: 'Aprovado',
+      status: "",
       type: 'pdf',
     },

[Survived] StringLiteral
src/pages/trail.tsx:17:13
       title: 'Metodologia_Qualitativa_v3.pdf',
       project: 'R. Silva - Análise LGPD',
       status: 'Aprovado',
-      type: 'pdf',
+      type: "",
     },
     {

[Survived] StringLiteral
src/pages/trail.tsx:22:16
     {
       id: '2',
       title: 'Resultados_Parciais_Q2.pdf',
-      project: 'J. Mendes - Bioinformática',
+      project: "",
       status: 'Em revisão',
       type: 'pdf',

[Killed] StringLiteral
src/pages/trail.tsx:23:15
       id: '2',
       title: 'Resultados_Parciais_Q2.pdf',
       project: 'J. Mendes - Bioinformática',
-      status: 'Em revisão',
+      status: "",
       type: 'pdf',
     },
killedBy: ResearchTrail Page displays different statuses and their classes
statusReason: Unable to find an element with the text: Em revisão. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] StringLiteral
src/pages/trail.tsx:28:14
     },
     { 
       id: '3', 
-      title: 'analise_estatistica_q2.json', 
+      title: "", 
       project: 'A. Costa - Sistemas de IA', 
       status: 'Submetido',

[Survived] StringLiteral
src/pages/trail.tsx:29:16
     { 
       id: '3', 
       title: 'analise_estatistica_q2.json', 
-      project: 'A. Costa - Sistemas de IA', 
+      project: "", 
       status: 'Submetido',
       type: 'csv', // using csv style for json

[Killed] ObjectLiteral
src/pages/trail.tsx:33:5
       status: 'Submetido',
       type: 'csv', // using csv style for json
     },
-    {
-      id: '4',
-      title: 'Dataset_Experimento_B.csv',
-      project: 'J. Ferreira - Análise LGPD',
-      status: 'Rascunho',
-      type: 'csv',
-    },
+    {},
   ];
 
killedBy: ResearchTrail Page renders advisor view by default
statusReason: Cannot read properties of undefined (reading 'endsWith')

[Killed] StringLiteral
src/pages/trail.tsx:37:15
       id: '4',
       title: 'Dataset_Experimento_B.csv',
       project: 'J. Ferreira - Análise LGPD',
-      status: 'Rascunho',
+      status: "",
       type: 'csv',
     },
killedBy: ResearchTrail Page displays different statuses and their classes
statusReason: Unable to find an element with the text: Rascunho. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] StringLiteral
src/pages/trail.tsx:46:16
     {
       id: '1',
       title: 'Referencial_Teorico_Final.pdf',
-      project: 'Projeto - Análise LGPD',
+      project: "",
       status: 'Aprovado',
       type: 'pdf',

[Survived] StringLiteral
src/pages/trail.tsx:53:16
     {
       id: '4',
       title: 'Dataset_Experimento_B.csv',
-      project: 'Projeto - Análise LGPD',
+      project: "",
       status: 'Rascunho',
       type: 'csv',

[Killed] EqualityOperator
src/pages/trail.tsx:59:21
     },
   ];
 
-  const documents = user?.role === 'RESEARCHER' ? researcherDocuments : advisorDocuments;
+  const documents = user?.role !== 'RESEARCHER' ? researcherDocuments : advisorDocuments;
 
   const getStatusBadgeClass = (status: string) => {
killedBy: ResearchTrail Page switches selected document and updates details
statusReason: Unable to find an element with the text: Resultados_Parciais_Q2.pdf. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/trail.tsx:59:21
     },
   ];
 
-  const documents = user?.role === 'RESEARCHER' ? researcherDocuments : advisorDocuments;
+  const documents = true ? researcherDocuments : advisorDocuments;
 
   const getStatusBadgeClass = (status: string) => {
killedBy: ResearchTrail Page switches selected document and updates details
statusReason: Unable to find an element with the text: Resultados_Parciais_Q2.pdf. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] BlockStatement
src/pages/trail.tsx:61:51
 
   const documents = user?.role === 'RESEARCHER' ? researcherDocuments : advisorDocuments;
 
-  const getStatusBadgeClass = (status: string) => {
-    switch (status) {
-      case 'Aprovado':
-        return 'status-approved';
-      case 'Em revisão':
-        return 'status-review';
-      case 'Submetido':
-        return 'status-submitted';
-      default:
-        return 'status-draft';
-    }
-  };
+  const getStatusBadgeClass = (status: string) => {};
 
   return (

[Survived] ConditionalExpression
src/pages/trail.tsx:63:7
 
   const getStatusBadgeClass = (status: string) => {
     switch (status) {
-      case 'Aprovado':
-        return 'status-approved';
+      case 'Aprovado':
       case 'Em revisão':
         return 'status-review';

[Survived] ConditionalExpression
src/pages/trail.tsx:65:7
     switch (status) {
       case 'Aprovado':
         return 'status-approved';
-      case 'Em revisão':
-        return 'status-review';
+      case 'Em revisão':
       case 'Submetido':
         return 'status-submitted';

[Survived] StringLiteral
src/pages/trail.tsx:65:12
     switch (status) {
       case 'Aprovado':
         return 'status-approved';
-      case 'Em revisão':
+      case "":
         return 'status-review';
       case 'Submetido':

[Survived] StringLiteral
src/pages/trail.tsx:66:16
       case 'Aprovado':
         return 'status-approved';
       case 'Em revisão':
-        return 'status-review';
+        return "";
       case 'Submetido':
         return 'status-submitted';

[Survived] ConditionalExpression
src/pages/trail.tsx:67:7
         return 'status-approved';
       case 'Em revisão':
         return 'status-review';
-      case 'Submetido':
-        return 'status-submitted';
+      case 'Submetido':
       default:
         return 'status-draft';

[Survived] ConditionalExpression
src/pages/trail.tsx:69:7
         return 'status-review';
       case 'Submetido':
         return 'status-submitted';
-      default:
-        return 'status-draft';
+      default:
     }
   };

[Survived] StringLiteral
src/pages/trail.tsx:70:16
       case 'Submetido':
         return 'status-submitted';
       default:
-        return 'status-draft';
+        return "";
     }
   };

[Survived] ArrayDeclaration
src/pages/trail.tsx:78:20
     <DashboardLayout
       title="Trilha de Pesquisa"
       subtitle="Histórico imutável de decisões, versões e evidências auditáveis"
-      breadcrumbs={['EdTech', 'Trilha de Pesquisa']}
+      breadcrumbs={[]}
       customTopbarElement={
         <div className="trail-topbar-badge">

[Killed] ConditionalExpression
src/pages/trail.tsx:92:14
             <i className="bi bi-person-badge"></i>
           </div>
           <div className="trail-doc-list-title">
-            {user?.role === 'RESEARCHER' ? (
+            {true ? (
               <>
                 <h3>Meus Documentos</h3>
killedBy: ResearchTrail Page renders advisor view by default
statusReason: Unable to find an element with the text: Documentos dos orientandos. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] EqualityOperator
src/pages/trail.tsx:92:14
             <i className="bi bi-person-badge"></i>
           </div>
           <div className="trail-doc-list-title">
-            {user?.role === 'RESEARCHER' ? (
+            {user?.role !== 'RESEARCHER' ? (
               <>
                 <h3>Meus Documentos</h3>
killedBy: ResearchTrail Page renders advisor view by default
statusReason: Unable to find an element with the text: Documentos dos orientandos. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ArrowFunction
src/pages/trail.tsx:107:26
         </div>
 
         <div>
-          {documents.map((doc) => (
-            <div
-              key={doc.id}
-              className={`trail-doc-item ${selectedDocId === doc.id ? 'active' : ''}`}
-              onClick={() => setSelectedDocId(doc.id)}
-            >
-              <div className="trail-doc-info">
-                <div
-                  className={`trail-file-icon ${doc.title.endsWith('.pdf') ? 'type-pdf-bg type-pdf-text' : 'type-csv-bg type-csv-text'}`}
-                >
-                  <i className="bi bi-file-earmark-text"></i>
-                </div>
-                <div>
-                  <span className="trail-doc-name">{doc.title}</span>
-                  <span className="trail-doc-project">{doc.project}</span>
-                </div>
-              </div>
-              <div>
-                <span className={`doc-status ${getStatusBadgeClass(doc.status)}`}>
-                  {doc.status}
-                </span>
-              </div>
-            </div>
-          ))}
+          {documents.map(() => undefined)}
         </div>
       </div>
killedBy: ResearchTrail Page switches selected document and updates details
statusReason: Unable to find an element with the text: Resultados_Parciais_Q2.pdf. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Survived] EqualityOperator
src/pages/trail.tsx:110:44
           {documents.map((doc) => (
             <div
               key={doc.id}
-              className={`trail-doc-item ${selectedDocId === doc.id ? 'active' : ''}`}
+              className={`trail-doc-item ${selectedDocId !== doc.id ? 'active' : ''}`}
               onClick={() => setSelectedDocId(doc.id)}
             >

[Survived] ConditionalExpression
src/pages/trail.tsx:110:44
           {documents.map((doc) => (
             <div
               key={doc.id}
-              className={`trail-doc-item ${selectedDocId === doc.id ? 'active' : ''}`}
+              className={`trail-doc-item ${false ? 'active' : ''}`}
               onClick={() => setSelectedDocId(doc.id)}
             >

[Killed] ArrowFunction
src/pages/trail.tsx:111:24
             <div
               key={doc.id}
               className={`trail-doc-item ${selectedDocId === doc.id ? 'active' : ''}`}
-              onClick={() => setSelectedDocId(doc.id)}
+              onClick={() => undefined}
             >
               <div className="trail-doc-info">
killedBy: ResearchTrail Page switches selected document and updates details
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h3
  class="timeline-title"
>
  Timeline de decisões
</h3> instead

[Survived] MethodExpression
src/pages/trail.tsx:115:49
             >
               <div className="trail-doc-info">
                 <div
-                  className={`trail-file-icon ${doc.title.endsWith('.pdf') ? 'type-pdf-bg type-pdf-text' : 'type-csv-bg type-csv-text'}`}
+                  className={`trail-file-icon ${doc.title.startsWith('.pdf') ? 'type-pdf-bg type-pdf-text' : 'type-csv-bg type-csv-text'}`}
                 >
                   <i className="bi bi-file-earmark-text"></i>

[Survived] StringLiteral
src/pages/trail.tsx:125:34
                 </div>
               </div>
               <div>
-                <span className={`doc-status ${getStatusBadgeClass(doc.status)}`}>
+                <span className={``}>
                   {doc.status}
                 </span>

[Killed] EqualityOperator
src/pages/trail.tsx:135:8
       </div>
 
       {/* Details Section for Document 1 (Mocked as per screenshot) */}
-      {selectedDocId === '1' && (
+      {selectedDocId !== '1' && (
         <div className="trail-details-section">
           <div className="trail-details-banner">
killedBy: ResearchTrail Page renders advisor view by default
statusReason: Unable to find an element with the text: Timeline de decisões. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dashboard-layout"
    >

[Killed] ConditionalExpression
src/pages/trail.tsx:135:8
       </div>
 
       {/* Details Section for Document 1 (Mocked as per screenshot) */}
-      {selectedDocId === '1' && (
+      {true && (
         <div className="trail-details-section">
           <div className="trail-details-banner">
killedBy: ResearchTrail Page switches selected document and updates details
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h3
  class="timeline-title"
>
  Timeline de decisões
</h3> instead

[Survived] StringLiteral
src/pages/trail.tsx:143:69
                 <i className="bi bi-file-earmark-text"></i>
               </div>
               <div>
-                <span className="trail-doc-name" style={{ fontSize: '16px' }}>
+                <span className="trail-doc-name" style={{ fontSize: "" }}>
                   {user?.role === 'RESEARCHER' ? 'Referencial_Teorico_Final.pdf' : 'Metodologia_Qualitativa_v3.pdf'}
                 </span>

[Survived] OptionalChaining
src/pages/trail.tsx:144:20
               </div>
               <div>
                 <span className="trail-doc-name" style={{ fontSize: '16px' }}>
-                  {user?.role === 'RESEARCHER' ? 'Referencial_Teorico_Final.pdf' : 'Metodologia_Qualitativa_v3.pdf'}
+                  {user.role === 'RESEARCHER' ? 'Referencial_Teorico_Final.pdf' : 'Metodologia_Qualitativa_v3.pdf'}
                 </span>
                 <span className="trail-doc-project">

[Survived] ConditionalExpression
src/pages/trail.tsx:144:20
               </div>
               <div>
                 <span className="trail-doc-name" style={{ fontSize: '16px' }}>
-                  {user?.role === 'RESEARCHER' ? 'Referencial_Teorico_Final.pdf' : 'Metodologia_Qualitativa_v3.pdf'}
+                  {true ? 'Referencial_Teorico_Final.pdf' : 'Metodologia_Qualitativa_v3.pdf'}
                 </span>
                 <span className="trail-doc-project">

[Survived] ConditionalExpression
src/pages/trail.tsx:147:20
                   {user?.role === 'RESEARCHER' ? 'Referencial_Teorico_Final.pdf' : 'Metodologia_Qualitativa_v3.pdf'}
                 </span>
                 <span className="trail-doc-project">
-                  {user?.role === 'RESEARCHER' ? 'Seu projeto - Análise LGPD - 7 eventos · 4 versões' : 'Dra. Renata Silva - Análise LGPD - 7 eventos · 4 versões'}
+                  {true ? 'Seu projeto - Análise LGPD - 7 eventos · 4 versões' : 'Dra. Renata Silva - Análise LGPD - 7 eventos · 4 versões'}
                 </span>
               </div>

[Survived] OptionalChaining
src/pages/trail.tsx:147:20
                   {user?.role === 'RESEARCHER' ? 'Referencial_Teorico_Final.pdf' : 'Metodologia_Qualitativa_v3.pdf'}
                 </span>
                 <span className="trail-doc-project">
-                  {user?.role === 'RESEARCHER' ? 'Seu projeto - Análise LGPD - 7 eventos · 4 versões' : 'Dra. Renata Silva - Análise LGPD - 7 eventos · 4 versões'}
+                  {user.role === 'RESEARCHER' ? 'Seu projeto - Análise LGPD - 7 eventos · 4 versões' : 'Dra. Renata Silva - Análise LGPD - 7 eventos · 4 versões'}
                 </span>
               </div>

[Survived] StringLiteral
src/pages/trail.tsx:151:56
                 </span>
               </div>
             </div>
-            <div style={{ display: 'flex', alignItems: 'center', gap: '16px' }}>
+            <div style={{ display: 'flex', alignItems: "", gap: '16px' }}>
               <span className="doc-status status-approved">
                 <i className="bi bi-check-circle me-1"></i> Aprovado

[Survived] StringLiteral
src/pages/trail.tsx:214:60
                     <div className="timeline-text">
                       <span className="timeline-event-title">Nova versão criada</span>
                       <span className="timeline-event-meta">
-                        Dra. Renata Silva · Hoje · 11:48 ·{' '}
+                        Dra. Renata Silva · Hoje · 11:48 ·{""}
                         <span className="timeline-event-hash">#6a1b9a2</span>
                       </span>

[Survived] StringLiteral
src/pages/trail.tsx:249:66
                     <div className="timeline-text">
                       <span className="timeline-event-title">Risco de conformidade sinalizado</span>
                       <span className="timeline-event-meta">
-                        Verificação automática · Ontem · 09:15 ·{' '}
+                        Verificação automática · Ontem · 09:15 ·{""}
                         <span className="timeline-event-hash">#c628284</span>
                       </span>

[Survived] StringLiteral
src/pages/trail.tsx:265:62
                     <div className="timeline-text">
                       <span className="timeline-event-title">Versão inicial submetida</span>
                       <span className="timeline-event-meta">
-                        Dra. Renata Silva · 10 Jun · 09:00 ·{' '}
+                        Dra. Renata Silva · 10 Jun · 09:00 ·{""}
                         <span className="timeline-event-hash">#1565c05</span>
                       </span>

[Survived] ObjectLiteral
src/pages/trail.tsx:305:30
                     </div>
                     <span
                       className="doc-status status-approved"
-                      style={{ fontSize: '10px', padding: '2px 8px' }}
+                      style={{}}
                     >
                       Aprovado

[Survived] ObjectLiteral
src/pages/trail.tsx:319:30
                     </div>
                     <span
                       className="doc-status status-draft"
-                      style={{ fontSize: '10px', padding: '2px 8px' }}
+                      style={{}}
                     >
                       Substituído

[Survived] StringLiteral
src/pages/trail.tsx:319:42
                     </div>
                     <span
                       className="doc-status status-draft"
-                      style={{ fontSize: '10px', padding: '2px 8px' }}
+                      style={{ fontSize: "", padding: '2px 8px' }}
                     >
                       Substituído

[Survived] ObjectLiteral
src/pages/trail.tsx:340:60
                   </div>
                   <div className="version-item">
                     <div className="version-info">
-                      <span className="version-tag" style={{ color: 'var(--ed-text-muted)' }}>
+                      <span className="version-tag" style={{}}>
                         v1
                       </span>

[Survived] StringLiteral
src/pages/trail.tsx:347:59
                     </div>
                     <span
                       className="doc-status status-draft"
-                      style={{ fontSize: '10px', padding: '2px 8px' }}
+                      style={{ fontSize: '10px', padding: "" }}
                     >
                       Substituído
