[Survived] ObjectLiteral
src/i18n.ts:8:7
 import translationPT from './locales/pt/translation.json';
 
 const resources = {
-  en: {
-    translation: translationEN
-  },
+  en: {},
   pt: {
     translation: translationPT

[Survived] ObjectLiteral
src/i18n.ts:11:7
   en: {
     translation: translationEN
   },
-  pt: {
-    translation: translationPT
-  }
+  pt: {}
 };
 

[Killed] StringLiteral
src/i18n.ts:20:10
   .use(initReactI18next)
   .init({
     resources,
-    lng: 'pt', // default language
+    lng: "", // default language
     fallbackLng: 'en',
     interpolation: {
killedBy: i18n configuration should be initialized
statusReason: expected 'en' to be 'pt' // Object.is equality

[Killed] StringLiteral
src/i18n.ts:21:18
   .init({
     resources,
     lng: 'pt', // default language
-    fallbackLng: 'en',
+    fallbackLng: "",
     interpolation: {
       escapeValue: false 
killedBy: i18n configuration should have correct default and fallback languages
statusReason: expected [ '' ] to deeply equal [ 'en' ]

[Survived] BooleanLiteral
src/i18n.ts:23:20
     lng: 'pt', // default language
     fallbackLng: 'en',
     interpolation: {
-      escapeValue: false 
+      escapeValue: true 
     }
   });
